{
  "slug": "ipa-partnership",
  "source_info": {
    "url": "https://www.ipa.go.jp/files/000098799.pdf",
    "title": "情報セキュリティ早期警戒パートナーシップガイドライン",
    "retrieved_at": "2025-09-24T12:12:44.015Z",
    "last_modified": "Fri, 14 Apr 2023 06:50:57 GMT",
    "content_type": "application/pdf",
    "file_size": 1089012,
    "checksum": "8b684968950f8035"
  },
  "extraction_meta": {
    "success": true,
    "method": "pdf",
    "total_pages": 59,
    "extracted_pages": 59,
    "warnings": []
  },
  "content": {
    "full_text": "\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n独立行政法人情報処理推進機構\n一般社団法人JPCERTコーディネーションセンター\n一般社団法人電子情報技術産業協会\n一般社団法人ソフトウェア協会\n一般社団法人情報サービス産業協会\n特定非営利活動法人日本ネットワークセキュリティ協会\n2022年5月 \n               \n情報セキュリティ早期警戒 \nパートナーシップガイドライン \n                    \n\n \n \n \n目    次 \n \nI．はじめに .................................................................. 1 \nII．用語の定義と前提 .......................................................... 3 \nIII．本ガイドラインの適用の範囲 ................................................ 6 \nIV．ソフトウエア製品に係る脆弱性関連情報取扱 .................................. 7 \n１．概要 .................................................................... 7 \n２．発見者の対応 ............................................................ 8 \n３．IPA（受付機関）の対応 ................................................... 10 \n４．JPCERT/CC（調整機関）の対応 ............................................. 15 \n５．製品開発者の対応 ........................................................ 19 \n６．その他 ................................................................. 22 \nV．ウェブアプリケーションに係る脆弱性関連情報取扱 ........................... 23 \n１．概要 ................................................................... 23 \n２．発見者の対応 ........................................................... 24 \n３．IPA（受付機関）の対応 ................................................... 25 \n４．ウェブサイト運営者の対応 ................................................ 28 \n付録１  用語の解説 ........................................................... 30 \n付録２  脆弱性情報取扱いのフロー ............................................. 32 \n付録３  法的な論点について ................................................... 35 \n１  発見者が心得ておくべき法的な論点 ........................................ 35 \n２  製品開発者が心得ておくべき法的な論点 .................................... 37 \n３  ウェブサイト運営者が心得ておくべき法的な論点 ............................ 38 \n付録４  脆弱性の影響度に関する考え方について ................................. 39 \n付録５  ソフトウエア製品における連絡不能案件の取扱いについて ................. 40 \n１  連絡不能開発者一覧の公表 ................................................ 40 \n２  対象製品情報の公表と関係者へのお願い .................................... 41 \n付録６  ソフトウエアの脆弱性の取扱いに関する国際標準への対応 ................. 43 \n付録７  本ガイドラインの別冊・関連資料一覧 ................................... 55 \n \n\nI．はじめに \n \n \n1 \nI．はじめに \n \n〇 本ガイドラインの目的 \n2000 年頃より、日本国内においてソフトウエアやウェブアプリケーションの脆\n弱性が発見されることが増えており、これらの脆弱性を悪用した不正アクセス行\n為やコンピュータウイルスの増加により、企業活動が停止したり情報資産が滅失\nしたり個人情報が漏えいしたりといった、重大な被害が生じています。そこで、脆\n弱性関連情報が発見された場合に、それらをどのように取り扱うべきかを示した、 \n経済産業省告示「ソフトウエア等脆弱性関連情報取扱基準」が 2004 年に制定され、\n2014 年の改正を経て、2017 年に新たに経済産業省告示「ソフトウエア製品等の脆\n弱性関連情報に関する取扱規程」になりました。 \n \n本ガイドラインは、上記告示を踏まえ、脆弱性関連情報の適切な流通により、コ\nンピュータ不正アクセス、コンピュータウイルス等による被害発生を抑制するた\nめに、関係者に推奨する行為をとりまとめたものです。さらに、本ガイドラインに\n基づく取組みがより効果的に社会貢献できるように、影響の大きい届出（脆弱性の\n深刻度の大きさや影響範囲の広さで判断、詳細は付録４を参照）を優先して取り扱\nうことや、発見者と製品開発者または、ウェブサイト運営者との調整において自律\n的な進展が困難な場合の打開を促すことにも取り組みます。 \n \n具体的には、独立行政法人情報処理推進機構（以下、「IPA」とする）が受付機関、\n一般社団法人 JPCERT コーディネーションセンター（以下、「JPCERT/CC」とする）\nが調整機関という役割を担い、発見者、製品開発者、ウェブサイト運営者と協力を\nしながら脆弱性関連情報に対処するための、その発見から公表に至るプロセスを\n詳述しています。 \n \n関係者の方々は、脆弱性関連情報の取扱いに際し、本ガイドラインを基本として\nご対応くださいますようお願い申し上げます。 \n \n \n〇 本ガイドラインの想定する読者 \n本ガイドラインの想定する読者と、その方に特に参照いただきたい箇所を以下\nに示します。 \n \n1) ソフトウエアやウェブアプリケーションに脆弱性を発見した方 \n脆弱性を発見された際は IPA への届出をご検討ください。ソフトウエアの脆弱\n性を発見された方はIV．２．を、ウェブアプリケーションの脆弱性を発見された方\nはＶ．２．をご参照ください。 \n \n\nI．はじめに \n \n \n2 \n2) 自組織が扱うソフトウエア製品の脆弱性について連絡を受けた方 \nJPCERT/CC からソフトウエア製品の脆弱性について製品開発者に連絡する場合\nがあります。ソフトウエア製品の脆弱性関連情報の取扱いのプロセスはIV．に記し\nています。製品開発者による対応はIV．５．をご参照ください。 \n \n3) 自組織のウェブアプリケーションの脆弱性について連絡を受けた方 \nIPA からウェブアプリケーションの脆弱性についてウェブサイト運営者に連絡\nする場合があります。ウェブアプリケーションの脆弱性関連情報の取扱いのプロ\nセスはV．に記しています。ウェブサイト運営者による対応はV．４．をご参照く\nださい。 \n\nII．用語の定義と前提 \n \n3 \n \nII．用語の定義と前提 \n \n本ガイドラインに用いられる用語の定義は以下の通りです。 \n \n１．脆弱性 \n脆弱性とは、ソフトウエア製品やウェブアプリケーション等において、コンピュ\nータ不正アクセスやコンピュータウイルス等の攻撃により、その機能や性能を損\nなう原因となりうるセキュリティ上の問題箇所です。 \nなお、製品開発者の不適切な実装やウェブサイト運営者の不適切な運用によっ\nて、個人情報等が適切なアクセス制御の下に管理されておらずセキュリティが維\n持できなくなっている状態も含みます（ウェブサイトの不適切な運用に関しては\n付録１に例を示します）。 \n \n２．脆弱性関連情報の種類 \n脆弱性関連情報とは、脆弱性に関する情報であり、次のいずれかに該当するもの\nです。 \n1) 脆弱性情報 \n脆弱性の性質および特徴を示す情報のことです。 \n2) 検証方法 \n脆弱性が存在することを調べるための方法のことです。例えば、特定の入力パ\nターンにより脆弱性の有無を検証するツール等が該当します。 \n3) 攻撃方法 \n脆弱性を悪用するプログラムやコマンド、データおよびそれらの使い方のこと\nです。例えば、エクスプロイトコード（付録１を参照）や、コンピュータウイ\nルス等が該当します。 \n \n３．対策方法 \n対策方法とは、脆弱性から生じる問題を回避するまたは解決を図る方法のこと\nです。回避方法と修正方法から成ります。ただし、本ガイドラインで、「対策方法」\nとの記述がある場合、「回避方法または修正方法」の意味となります。 \n1) 回避方法 \n脆弱性が原因となって生じる被害を回避するための方法（修正方法は含まない）\nであり、ワークアラウンド（付録１を参照）と呼ばれます。 \n2) 修正方法 \n脆弱性そのものを修正する方法であり、パッチ（付録１を参照）等と呼ばれま\nす。 \n \n４．対応状況 \n対応状況とは、JPCERT/CC から脆弱性関連情報の通知を受けた製品開発者が報告\nする、脆弱性対応の取組みの状況等のことです。 \n \n\nII．用語の定義と前提 \n \n4 \n \n５．ソフトウエア製品 \nソフトウエア製品とは、ソフトウエア自体またはソフトウエアを組み込んだハ\nードウエア等の汎用性を有する製品のことです。技術情報の統括や開発保守を行\nっている者をコミュニティとしてしか特定できない、オープンソースソフトウエ\nアのようなものも含みます。具体例は、付録１を参照してください。 \n \n６．オープンソースソフトウエア（OSS） \nオープンソースソフトウエア（OSS）とは、ソースコードが公開されていて、誰\nでも無償で入手、利用することができ、さらに改良、再配布ができるライセンスを\nもつソフトウエアのことです。 \n \n７．ウェブアプリケーション \nウェブアプリケーションとは、インターネット上のウェブサイト等で稼動する\n固有のシステムのことです。 \n \n８．発見者 \n発見者とは、脆弱性関連情報を発見または取得した者のことです。例えば、ソフ\nトウエアの脆弱性を発見した人や、インターネット上で脆弱性関連情報を入手し\nた人等が当てはまります。ソフトウエアの脆弱性を発見した人のみを対象として\nいるわけではありません。 \n \n９．製品開発者 \n製品開発者とは、次のいずれかに該当する者のことです。 \n1) ソフトウエア製品（OSS を含む）を開発した官庁、法人、個人、またはコミ\nュニティ \n2) ソフトウエア製品（OSS を含む）の加工、輸入、販売または頒布する官庁、\n法人\n1\n、個人、またはコミュニティ \n \n \n１０．脆弱性検証 \n脆弱性検証とは、受け取った脆弱性関連情報について、再現性、脆弱性に該当す\nることを検証することです。 \n \n１１．ウェブサイト運営者 \nウェブサイト運営者とは、ウェブアプリケーションを運営する主体のことです。\n当該ウェブアプリケーションが官庁、法人等の組織によって運営されているので\nあれば、その組織が該当します。個人によって運営されているのであれば、その個\n人が該当します。ウェブサイト運営者の例は、付録１を参照してください。 \n \n1\n 海外のソフトウエア製品の国内での主たる販売権を有する会社（外国企業の日本法人や総\n代理店等）を含みます。 \n\nII．用語の定義と前提 \n \n5 \n \n \n１２．製品利用者 \n製品利用者とは、ソフトウエア製品のライセンス許諾（明示的でないケースを含\nむ）を受けてソフトウエア製品を導入・管理する官庁、法人または個人のことです。\n一般に、ソフトウエア製品の脆弱性対策を適用する立場にあります。 \n \n１３．システム構築事業者 \nシステム構築事業者とは、ソフトウエア製品を入手し、それを使ってシステムを\n構築し、利用者に提供する法人または個人のことです。システムの構築サービスや\n保守、運用のサービスを通じて、顧客であるウェブサイト運営者の脆弱性対策を実\n施することもあります。 \n \n \n\nIII．本ガイドラインの適用の範囲 \n \n6 \n \nIII．本ガイドラインの適用の範囲 \n \n本ガイドラインは、次のものに係る脆弱性であって、その脆弱性に起因する影響\nが不特定または多数の人々におよぶおそれのあるものに適用します。 \n \n○日本国内で利用されているソフトウエア製品 \n 「暗号アルゴリズム」や「プロトコル」を実装しているものも含みますが、\n一般的な「暗号アルゴリズム」や「プロトコル」等の仕様そのものの脆弱性\nは含みません（プロトコルの実装に係る脆弱性については付録１を参照）。 \n ソフトウエア製品に係る脆弱性関連情報の取扱いは、IV．で記述します。 \n \n○日本国内からのアクセスが実質的になされているウェブサイトで稼動するウ\nェブアプリケーション \n 例えば、主なコンテンツが日本語である、あるいは URL のホスト名の最上位\nドメインが「jp」であるウェブサイト等のことです。 \n ウェブアプリケーションに係る脆弱性関連情報の取扱いは、V．で記述しま\nす。 \n \nなお上記の分類が難しい場合には、修正作業が事業者側のみで済む場合をウェ\nブアプリケーション、製品利用者側の対応が必要な場合をソフトウエア製品とし\nて判断することを基本とします。 \n \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n7 \n \nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n１．概要 \nソフトウエア製品に係る脆弱性関連情報取扱の概要は、図１の通りです。 \n \n図１  ソフトウエア製品に係る脆弱性関連情報取扱の概要 \n(ソフトウエア製品における脆弱性情報取扱いの全体フローは付録２を参照) \n \n1) 発見者は、IPA に脆弱性関連情報を届け出る \n2) IPA は、受け取った脆弱性関連情報を、原則として JPCERT/CC に通知する \n3) JPCERT/CC は、脆弱性関連情報に関係する製品開発者を特定し、製品開発者に\n脆弱性関連情報を通知する \n4) 製品開発者は、脆弱性検証を行い、その結果を JPCERT/CC に報告する \n5) JPCERT/CC と製品開発者は、対策方法の作成や海外の調整機関との調整に要す\nる期間、当該脆弱性情報流出に係るリスクを考慮しつつ、脆弱性情報の公表に\n関するスケジュールを調整し決定する \n6) 製品開発者は、脆弱性情報の公表日までに対策方法を作成するよう努める \n7) 製品開発者は、製品利用者に生じるリスクを低減できると判断した場合、\nJPCERT/CC と調整した上で、公表日以前に製品利用者に脆弱性検証の結果、対\n策方法および対応状況について通知することができる \n8) IPA および JPCERT/CC は、脆弱性情報と、3)にて JPCERT/CC から連絡したすべ\nての製品開発者の脆弱性検証の結果、対策方法および対応状況を公表する \n製品開発者\n発見者\nＩＰＡ\n1\n発見者は、IPAに脆弱性\n関連情報を届け出る\n2IPAは、JPCERT/CCに\n脆弱性関連情報を通知\nする\nJPCERT/CC\n製品開発者\n3\nJPCERT/CCは、\n製品開発者に脆弱\n性関連情報を連絡する\n4製品開発者は、\n脆弱性検証を行う\n6製品開発者は、\n対策方法を作成する\n8IPAとJPCERT/CCは、\n脆弱性情報、脆弱性検証の結果\nおよび対策状況を公表する\n※\n一般\n5\nJPCERT/CCは、製品開発者\nと調整を行う\n9IPAは四半期ごとに統計情報を公表する\n製品\n利用者\n7\n製品開発者は、\n製品利用者に生じるリスクを低減できると\n判断した場合、JPCERT/CCと調整した上で、\n公表日以前に製品利用者に脆弱性検証の\n結果及び対応状況について通知することが\nできる\n※製品開発者が自社製品のすべての製品利用者に\n脆弱性検証の結果や対応状況について連絡する\nことが確認できる場合には、公表と同等の周知を\n実施するものとみなす\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n8 \n \n9) IPA は統計情報を、原則、四半期ごとに公表する \n \n \n２．発見者の対応 \n \n1) 発見者の範囲 \nIVにおける発見者とは、製品開発者以外の者（研究者等）のみを指しているわ\nけではありません。製品開発者自身であっても、自身のソフトウエア製品につい\nての脆弱性関連情報であって、脆弱性が外部のソフトウエア製品に含まれるこ\nとが推定されるものを発見・取得した場合、発見者としての対応が推奨されます。 \n \n2) 脆弱性関連情報の発見・取得 \n脆弱性関連情報の発見・取得に際しては、関連法令に触れることがないよう\nに留意してください。詳細は、付録３を参照してください。 \n \n3) 脆弱性関連情報の届出 \n発見者は、発見した脆弱性関連情報を IPA に届け出てください\n2\n。 \nただし、発見者から直接の届出を受け入れる旨を承諾している製品開発者\n3\nの\n場合、直接届け出ることも可能です。 \nその際、IPA と製品開発者の両方に届け出る場合には、関係者間の調整が混乱\nしないように、脆弱性の解消に向けた製品開発者との調整を自ら行うか、IPA に\n任せるかを届出の際に、明確にしてください。さらに、以降の調整を IPA に任せ\nる場合は、製品開発者へその旨を通知するとともに、その通知を行った旨を届出\nに明記してください。 \n \n4) 脆弱性関連情報の管理および開示 \n発見者は、脆弱性関連情報を正当な理由がない限り第三者に開示しないでく\nださい（発見者に対する情報非開示依頼、以下「情報非開示依頼」という）。た\nだし、正当な理由があって脆弱性関連情報を開示する必要がある場合には、事前\nに IPA に相談してください。脆弱性関連情報の管理および開示に係る法的な問\n題に関しては、付録３を参照してください。 \nなお、起算日\n4\nから 1 年以上経過した届出については、発見者は IPA に対し、\n情報非開示依頼の取り下げを求めることができます。 \nまた、情報非開示依頼の効力のある間は、脆弱性関連情報が第三者に漏えいし\n \n2\n 特に、複数の製品開発者の製品に影響する可能性がある脆弱性関連情報については、受け\n取れない製品開発者が出ないように、IPA へ届出を行うことが望まれます。 \n3\n IPA および JPCERT/CC が提供する脆弱性対策情報ポータルサイトJapan Vulnerability \nNotes（JVN）にある JPCERT/CC 製品開発者リストの中に掲載しています。 \n4\n 本ガイドラインのIV．４．2)において規定された連絡を最初に試みた日を起算日とします。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n9 \n \nないように適切に管理してください。 \n \n5) 届け出る情報の内容 \n発見者は、届け出る情報の中で以下の点を明示してください（詳細は、\nhttps://www.ipa.go.jp/security/vuln/ を参照）。 \n(ア) 氏名等の発見者を識別するための情報 \n(イ) 電子メールアドレス等の発見者の連絡先 \n(ウ) (ア)および(イ)の製品開発者への通知の可否 \n(エ) 製品開発者から直接連絡を受けることの可否 \n(オ) (ア)の公表の可否 \n(カ) 脆弱性関連情報に係るソフトウエア製品の名称 \n(キ) 脆弱性関連情報の内容（脆弱性関連情報を確認する環境、手順および\n結果） \n可能であれば、脆弱性が存在する証拠\n5\nを一緒に提出してください。\nただし、証拠の取得に際しては、関連法令に触れることがないように\n留意してください（付録３を参照）。 \n(ク) 個人情報の取扱方法（製品開発者への通知および直接の情報交換の可\n否、一般への公表の可否） \n 発見者が望まない場合、IPA は、JPCERT/CC および製品開発者に対し\nて、発見者を特定しうる情報を通知することはありません。 \n 発見者が望む場合、IPA および JPCERT/CC は、脆弱性情報と製品開\n発者ごとの脆弱性検証の結果、対策方法および対応状況を公表する\n際に発見者名を付記するとともに、製品開発者に対しても、対策方\n法の公表時に発見者名を付記することを推奨します。 \n(ケ) 他組織（製品開発者、他のセキュリティ関係機関等）への届出の状況 \n等 \n \n6) 製品開発者との直接の情報交換 \n発見者は、IPA に脆弱性関連情報を届け出た後、IPA および JPCERT/CC を介し、\n製品開発者の了解を得て、製品開発者と直接情報交換を行うことができます。 \n \n7) 届出後の対応 \n発見者は、届出後、IPA に進捗状況の問い合わせを行うことができます。IPA\nは、本ガイドラインの３．に則って処理を行い、発見者の問い合わせに対し、適\n切に情報の開示を行います。発見者は、開示された情報をみだりに第三者に開\n示しないでください。 \n \n \n5\n 具体的には、「検証コード」、「画面キャプチャ」、「ログ」等。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n10 \n \n３．IPA（受付機関）の対応 \n \n(1)脆弱性関連情報の届出受付と取扱いについて \n \n1) 脆弱性関連情報の受付 \nIPA の脆弱性関連情報の受付に関し、詳細は以下の URL をご参照ください。 \nhttps://www.ipa.go.jp/security/vuln/  \n届出は 24 時間受け付けますが、受け付けた情報について 2)以降の作業を行う\nのは原則営業日のみとなります。 \n \n2) 届出の受理 \nIPA は、届出の記載が以下の条件をすべて満たしていると判断した時、その時\n点で届出を受理し、発見者に連絡します。 \n(ア) 上記２．5)の項目がすべて記載されていること \n(イ) 届出内容に矛盾等が無いこと \n(ウ) 届出の対象が本ガイドラインの適用範囲に該当すること（III章を参照） \n(エ) 記載されている内容が脆弱性であること \n(オ) 既知の脆弱性とは異なる脆弱性の関連情報であること（JPCERT/CC、製\n品開発者等により公表された脆弱性の関連情報ではないこと） \nなお、IPA は、これらの条件により、届出の受理または不受理を判断し、その\n理由とともに発見者に連絡します。なお、発見者に届出の受理を連絡した日が\nIPA および JPCERT/CC が脆弱性関連情報の取扱いを開始した日（受理日）となり\nます。 \n \n3) 違法な手段で入手された脆弱性関連情報への対応 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な手\n段で入手された脆弱性関連情報であることが明白な場合、処理を取りやめるこ\nとがあります。 \n \n4) JPCERT/CC への連絡 \nIPA は、上記 2)、3)における対応の是非の判断の結果、対応することが妥当\nとの判断を下した脆弱性関連情報について、速やかに JPCERT/CC に通知しま\nす。なお、届け出された脆弱性による影響が大きい場合、受付の順序に関わら\nず、優先的に取扱いを行います（付録４を参照）。 \n \n5) 脆弱性関連情報の取扱い \nIPA は、脆弱性関連情報に関して、正当な理由がない限り発見者・JPCERT/CC・\n当該製品開発者以外の第三者に開示しません。ただし、以下のような正当な理由\nがある場合、IPA は第三者に情報を開示することがあります。なお、技術的分析\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n11 \n \nを依頼する場合、IPA は秘密保持契約を結びます。 \n(ア) 脆弱性を有するソフトウエア製品が、他のソフトウエアやウェブサイ\nトで利用されている場合に、それらの製品開発者やウェブサイト運営者\nに連絡する場合 \n(イ) 脆弱性が再現する状況を特定できない等の場合に、国立研究開発法人\n産業技術総合研究所や技術研究組合制御システムセキュリティセンタ\nー等の外部機関に脆弱性関連情報に関する技術的分析を依頼する場合 \nこの場合、関係者の許諾を得た上で、JPCERT/CC と連携し、脆弱性の\n再現に必要な情報を製品開発者に開示することがあります。 \nまた、IPA は、脆弱性関連情報に関して、それに関する脆弱性情報が一般に公\n表されるまでの間は、発見者・JPCERT/CC・当該製品開発者以外の第三者に漏え\nいしないように適切に管理します。 \n \n6) 発見者に係る情報の取扱い \nIPA は、氏名・連絡先を含む発見者に係る情報を、発見者が望む場合以外には、\nJPCERT/CC と製品開発者および第三者に漏えいしないよう適切に管理します。 \n \n7) 脆弱性関連情報の受理後の対応 \nIPA は、JPCERT/CC に通知した脆弱性関連情報に関して、以下のいずれかに該\n当する場合、発見者に連絡するとともに、処理を取りやめることがあります。 \n(ア) 脆弱性関連情報に該当しない場合 \n(イ) 本ガイドラインの適用範囲外である場合 \n(ウ) 脆弱性による影響が小さい場合（付録４を参照） \n(エ) 脆弱性関連情報が既知であり、かつ公表されている場合 \n(オ) 製品開発者がすべての製品利用者に通知する場合（システム構築事業\n者を介して通知するケースを含む） \n \n8) 発見者との情報交換 \nIPA は、届出を受理した後、発見者に問い合わせをすることがあります。また、\n発見者から問い合わせがあった場合、JPCERT/CC と相談の上、適切な情報の開示\nを行います。なお、発見者との情報交換に際しては、第三者に情報が漏えいしな\nいよう留意します。 \n \n9) 脆弱性関連情報の影響の分析 \nIPA は、JPCERT/CC と連携して、届け出られた脆弱性関連情報が他のソフトウ\nエアやシステムに及ぼす影響の分析を行うよう努めます。影響の分析結果につ\nいては、JPCERT/CC を介して、製品開発者に連絡します。 \n \n10) 対策方法および対応状況の共有 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n12 \n \nIPA は、JPCERT/CC を介して連絡した脆弱性関連情報に係る製品開発者の対策\n方法および対応状況を、JPCERT/CC と共有します。 \n \n11) 情報非開示依頼の取下げ \nIPA は、起算日から 1 年以上経過した届出について、発見者から情報非開示依\n頼の取下げが求められた場合、これを取り下げます。そのとき、製品開発者が正\n当な理由により対応に時間を要する場合、IPA はその状況を発見者に適切に説明\nし、発見者が情報開示の必要性を客観的に判断できるようにします。 \n \n12) 優先的な情報提供実施時の発見者への通知 \nIPA は、届出がなされた脆弱性関連情報に関して、JPCERT/CC から政府機関や\n国民の日常生活に必要不可欠なサービスを提供するための基盤となる設備を保\n有する事業者等に対して優先的に提供された場合、発見者に対して、その旨を通\n知します。当該基盤保有事業者は内閣サイバーセキュリティセンター（NISC）の\n最新の「重要インフラの情報セキュリティ対策に係る行動計画」\n6\nで定める重要\nインフラ事業者等とします。 \n \n13) 一般への情報の公表 \nIPA および JPCERT/CC は、JVN を通じて、一般に対し、脆弱性情報と JPCERT/CC\nから連絡したすべての製品開発者の脆弱性検証の結果、対策方法および対応状\n況を公表します。さらに、一旦公表した後、製品開発者から新たな対策方法と対\n応状況のいずれかまたは両方を受け取った場合、その都度更新します。 \nまた、IPA および JPCERT/CC は、JVN に関する問い合わせ先を明示し、主とし\nて OSS 等に関して、システム構築事業者や製品利用者の脆弱性対応を促すこと\nを目的として、問い合わせ対応を実施します。なお、問い合わせに関する内容に\nついては、必要に応じて JVN の公表情報に反映します。 \n一般への情報の公表に際しては、IPA は、発見者にその旨を通知します。 \n \n14) 統計情報の集計と公表 \nIPA は、脆弱性に係る実態を周知徹底し危機意識の向上を図り、その結果とし\nての被害の予防のために、受け付けた脆弱性関連情報を集計し、統計情報として\nインターネット上等で原則、四半期ごとに公表します。統計情報には、届出件数\nの時間的推移等が含まれます。 \n  \n \n6\n NISC  重要インフラの情報セキュリティ対策に係る行動計画 \nhttps://www.nisc.go.jp/policy/materials/index.html \n \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n13 \n \n(2)調整不能案件の公表判定について \n \n1) 公表判定委員会の組織 \nIPA は、JPCERT/CC からIV.４．10)の通知を受けて、JPCERT/CC と製品開発者と\nの間で脆弱性情報の公表に係る調整が不可能であると判断した場合（以下「調整\n不能」という）、その案件が脆弱性情報を公表する条件を満たしているかを判定\nする「公表判定委員会」を組織します。 \n \n調整不能とは、具体的には以下のいずれかのケースに該当します。 \n(ア)IV．４．2)に示した連絡方法をすべて試みても製品開発者と 6 ヶ月以上\n連絡が取れない場合（以下、「連絡不能」という） \n(イ)製品開発者と JVN 公表に関する調整を行ったが合意に至ることが社会\n通念上困難になったと判断される場合 \n \nIPA は、公表判定委員会において、脆弱性情報を公表しない場合に製品利用者\n等が受けうる被害と、公表した場合に製品開発者、製品利用者等が被りうる不利\n益とのバランスに配慮するとともに、社会的影響も考慮し、不利益を被りうる関\n係者が意見を表明することも可能な、透明性・妥当性のある判定プロセスを整備\nします。 \nIPA は、中立性を考慮し、当該調整不能案件に利害関係がない有識者、法律や\nサイバーセキュリティの専門家、当該ソフトウエア製品分野の専門家を公表判定\n委員会の委員に指名します。公表判定委員会は、関係者に意見表明の機会を提供\nし、その意見を踏まえ、公表が適当か否かを判定します。 \n \n2) 判定に必要な情報の収集・整理 \nIPA は、JPCERT/CC から製品開発者の連絡先（メールアドレス等）、当該脆弱性\n関連情報並びに製品開発者による脆弱性検証の結果、対策方法および対応状況を\n聴取し、公表判定委員会の判定に必要な資料を作成します。 \n \n3) 調整不能案件に係る製品開発者への連絡 \n公表判定委員会は、調整不能案件の当事者である製品開発者に対し、当該脆弱\n性情報を公表すべきかどうか判定する旨を連絡します。 \n(ア)連絡内容 \n公表判定委員会が製品開発者に伝える内容は、当該脆弱性情報とその\n存在を判断した根拠、経緯、公表予定の文案、意見書の提出先と提出期\n限です。 \n(イ)連絡方法 \n公表判定委員会から製品開発者に対し、電子メール等の合理的手段を\nもって連絡を試みます。連絡は、プライバシーに十分に配慮します。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n14 \n \nまた、連絡不能案件の場合には、付録５の方法を実施したことをもっ\nて、通達努力を果たしたものとみなします。 \n \nなお、この製品開発者から、脆弱性検証の結果、対策方法および対応状況のい\nずれか一つ以上について新しい報告があった場合には、その内容に応じて、IPA\nは脆弱性関連情報に係る処理を JPCERT/CC に戻すことがあります。 \n4) 関係者からの意見聴取 \n公表判定委員会は、製品開発者をはじめとする関係者からの意見聴取を行いま\nす。意見聴取は、原則として書面による手続きで行います。また、公表判定委員\n会は、その裁量によって、関係者から口頭での意見を聴取することができます。 \n \n5) 判定 \n公表判定委員会は、脆弱性検証結果や当該製品開発者をはじめとする関係者の\n意見書に基づき、脆弱性情報の公表に関する判定を行います。取り扱う案件が下\n記のすべての条件を満たす場合、IPA および JPCERT/CC で公表することが適当と\n判定します。それ以外は公表をしないことと判定します。 \n(ア)調整機関と製品開発者との間の脆弱性情報の公表に係る調整が不可能\nであること（調整不能案件であること） \n(イ)脆弱性の存在が認められること \nソフトウエア製品の脆弱性とは、ソフトウエア製品等において、コン\nピュータ不正アクセスやコンピュータウイルス等の攻撃により、その機\n能や性能を損なう原因となりうるセキュリティ上の問題箇所です。ソフ\nトウエア製品において、情報セキュリティの三大要素（機密性、完全性、\n可用性）の１つ以上が侵害される可能性があり、その原因となる問題挙\n動を IPA または JPCERT/CC が具体的に例示可能であり、製品開発者が反\n証できないとき、脆弱性の存在が認められると判断します。 \nなお、判断においては、一般的なソフトウエア製品の利用方法や、製\n品開発者があらかじめ提示している使用条件等を考慮します。 \n(ウ)IPA が公表しない限り、脆弱性情報を知り得ない製品利用者がいるおそ\nれがあること \n製品開発者が当該ソフトウエア製品の製品利用者全員に確実に通知\nすることが困難な場合を対象とします。例えば、ソフトウエア製品が市\n販されている場合や、ウェブサイト等でダウンロード可能である場合は\nこれに該当します。 \n(エ)製品開発者や製品利用者の状況等を総合的に勘案して、公表が適当でな\nいと判断する理由・事情がないこと \n製品開発者の取組みや製品利用者の状況を鑑みて、公表することが適\n当ではないと判断する明確な理由・事情がある場合には、公表を行いま\nせん。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n15 \n \n \n6) 結果の通知 \nIPA は、公表判定委員会が行った判定に基づいて、公表するかどうかの判断を\n行い、その結果と理由を JPCERT/CC および製品開発者に通知します。ただし、連\n絡不能案件の場合、製品開発者には通知しません。 \n \n7) 判定後の対応 \nIPA は、判定結果によって、以下の処理を行います。 \n（ア）脆弱性情報を公表すると判定された場合の対応 \n      脆弱性情報を公表するという判定になった場合、IPA は、その判定\nを踏まえ、脆弱性情報の公表を判断するとともに、以下の処理を行い\nます。 \n・経済産業大臣に対して、公表に関する手続きが告示の定める手続\nきに適合していることについての確認を求めます。ただし、連絡\n不能案件の場合、告示の定める手続きに適合していることについ\nて確認はしません。 \n・公表日を決定します。 \n・公表する内容について製品開発者から併記を希望する見解を聴取\nします。ただし、連絡不能案件の場合、この確認はしません。 \n・JPCERT/CC に、公表日と製品開発者から得られた併記を希望する\n見解を通知します。 \n・公表日に、製品開発者名とともに脆弱性情報等を JVN で公表しま\nす。また、製品開発者から併記を希望する見解が提出された場合、\nその見解を併記して公表します。 \n・発見者に、公表したことを通知します。 \n（イ）脆弱性情報を公表しないと判定された場合の対応 \n脆弱性情報を公表しないという判定になった場合、IPA は、発見者\nにその結果と理由を通知します。 \n（ウ）脆弱性情報の公表に係る調整が可能であると判定された場合の対応 \n脆弱性情報の公表に係る調整が可能であると判定された場合、IPA\nは JPCERT/CC に製品開発者との調整を再度行うように通知します。 \n \n \n４．JPCERT/CC（調整機関）の対応 \n \n1) 製品開発者リストの整備 \nJPCERT/CC は、製品開発者に対して脆弱性関連情報を連絡するために、日\n頃より製品開発者リストの整備に努めます。この製品開発者リストには、\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n16 \n \n製品開発者ごとに、製品脆弱性対策管理者名、連絡窓口（メールアドレス、電\n話番号、住所等）等を登録します。 \nまた、製品開発者が自身の名称等を公表することを承諾した場合、\nJPCERT/CC はそれを「JPCERT/CC 製品開発者リスト\n7\n」に掲載します。 \nなお、製品開発者が発見者からの直接届出を受け付けることを希望する\n場合、JPCERT/CC は当該製品開発者の脆弱性受付窓口の設置状況や自身のウ\nェブサイトでの脆弱性公表の実績等を勘案して、「JPCERT/CC 製品開発者リ\nスト」上に当該製品開発者の脆弱性受付窓口の情報を追記します。 \n \n2) 製品開発者への連絡 \nJPCERT/CC は、届け出られた脆弱性関連情報の IPA からの通知を受け、製品開\n発者リストの活用や脆弱性関連情報を分析することにより、速やかに製品開発\n者を特定し、必要に応じて製品開発者リストに当該製品開発者を追加した上で、\nその製品開発者に連絡を行います。その際に、各製品開発者に対して、脆弱性検\n証を行い、その結果を報告することを求めます。 \nJPCERT/CC は、届け出られた製品と実質的な相互関係にある製品を特定した場\n合には、その製品開発者に連絡を行い、調整することができます。 \nまた、JPCERT/CC は、OSS に関する事前通知を、製品開発者または開発コミュ\nニティに加えて、必要に応じて OSS を導入した製品の開発者・ディストリビュー\nタ・製品の仕様を決定するサービス提供者（例：携帯電話会社）へ通知します。 \n \nこれは、製品開発者または開発コミュニティによる脆弱性対応が困難でかつ\n発表もされない場合に、当該 OSS を導入した製品の開発者やディストリビュー\nタ、製品の仕様を決定するサービス提供者は、それらの脆弱性対応が重要であ\nるケースが想定されるためです。 \nなお、IPA から通知された脆弱性関連情報が、脆弱性による影響が大きい場合、\n受付の順序に関わらず、優先的に取扱いを行います(付録４を参照)。 \nさらに、製品開発者が申告した連絡先情報や製品に添えられた宛先情報等を\nもとに電子メールや郵便、電話、FAX 等いずれの手段で製品開発者に連絡を試み\nても一定期間にわたりまったく応答がない場合には、「連絡が取れない」と判断\nします。その場合、JPCERT/CC は、該当する製品開発者を「連絡不能開発者」と\n位置づけて公表し、連絡を呼びかけます（連絡不能開発者一覧の公表について\nは、付録５を参照）。それでも連絡が取れない場合には、JPCERT/CC は、対象製\n品（製品名およびバージョン）を公表し、広く一般に情報提供を呼びかけること\nがあります（対象製品情報の公表と関係者へのお願いについては、付録５を参\n照）。 \n \n \n7\n 「JPCERT/CC 製品開発者リスト」https://jvn.jp/nav/index.html \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n17 \n \n3) 公表日の決定 \nJPCERT/CC は、製品開発者から脆弱性検証の結果を受け取り、製品開発者と\n相談した上で、脆弱性情報と製品開発者の対策方法および対応状況の公表日を\n決定し、IPA および関係する製品開発者に通知します。公表日は、JPCERT/CC\nが「製品開発者への連絡」（４．2）を参照）にて規定された連絡を最初に試\nみた日（起算日、２．注釈 4 を参照）から 45 日後を目安とします。ただし、\n公表日の決定に際しては、以下の点も考慮します。 \n① 対策方法の作成に要する期間 \n② 海外の調整機関との調整に要する期間 \n③ 脆弱性情報流出に係るリスク \nまた、通知した製品開発者が複数いて、その一部の製品開発者しか脆弱性検\n証の結果報告をしない場合、JPCERT/CC は、得られた結果報告を踏まえつつ、\n過去の類似事例や②③を参考にして公表日を決定し、IPA および関係する製品\n開発者に通知します。 \n \n4) 公表日決定後の対応 \nJPCERT/CC は、製品開発者から、一般への公表日の変更の要請を受けた場合、\n公表日を変更することがあります。その場合、変更した公表日を IPA および脆弱\n性関連情報に関して連絡を行ったすべての製品開発者に連絡します。 \nさらに、以下の場合、一般への公表を取りやめることがあります。その場合、\nその旨を製品開発者および IPA に連絡します。 \n(ア)通知を行った製品開発者から脆弱性情報に該当しないとの連絡を受け\nた場合 \n(イ)通知を行った製品開発者から脆弱性による影響がないとの連絡を受け\nた場合 \n(ウ)通知を行った製品開発者から脆弱性による影響が小さいとの連絡を受\nけた場合（付録４を参照） \n(エ)脆弱性関連情報が既知であり、脆弱性情報等が公表されている場合 \n(オ)製品開発者がすべての製品利用者に通知する場合（システム構築事業者\nを介して通知するケースを含む） \n \n5) 脆弱性関連情報の取扱い \nJPCERT/CC は、脆弱性関連情報を第三者に開示しません。ただし、以下のよ\nうな正当な理由がある場合、JPCERT/CC は第三者に情報を開示することがあり\nます。 \n(ア)海外製品であり外国企業の日本法人や総代理店が無い場合 \n(イ)海外に大きな影響を与える脆弱性関連情報の場合 \n(ウ)脆弱性関連情報の詳細な分析が必要な場合  等 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n18 \n \n具体的には、秘密保持契約を締結した上で、海外の調整機関または IPA を含\nむ外部機関に連絡や分析を依頼するケースがあります。 \nまた、JPCERT/CC は、脆弱性情報を一般に公表するまでは、第三者に漏えい\nしないように管理します。 \n \n6) 脆弱性関連情報の影響の分析 \nJPCERT/CC は、IPA と連携して、届け出られた脆弱性関連情報が他のソフトウ\nエアやシステムに及ぼす影響の分析を行うよう努めます。影響の分析結果につ\nいては、製品開発者に連絡します。 \n \n7) 対策方法および対応状況の受付 \nJPCERT/CC は、JPCERT/CC から連絡したすべての製品開発者に対して、脆弱性\n情報の一般公表日までに、脆弱性関連情報に係る対策方法および対応状況を報\n告するように要請します。一般への脆弱性情報の公表に際しては、対策方法およ\nび対応状況を IPA と共有します。 \n \n8) 優先的な情報提供 \nJPCERT/CC は、届出がなされた脆弱性関連情報に関して、国民の日常生活に必\n要不可欠なサービスを提供するための基盤となる設備に対し特に影響が大きい\nと推察される場合、IPA および製品開発者と協議の上、対策方法が作成されてか\nら一般公表日までの間に、脆弱性情報と対策方法を、政府機関や当該基盤保有事\n業者等に対して優先的に提供することができます。 \nなお、優先的な情報提供を受ける基盤保有事業者は、以下の条件をすべて満た\nす必要があります。 \n(ア)情報を提供された当該事業者の中で秘密情報管理を徹底すること \n(イ)当該事業者自身の委託先（システム構築事業者、セキュリティベンダ等）\n各社において、秘密情報管理を徹底すること \n(ウ)JPCERT/CC から優先的に提供される情報は当該基盤を防護する目的に対\nしてのみ利用することを徹底すること \nただし、優先提供の趣旨を鑑み、運用方法および提供対象事業者を継続的に\n見直していくものとします。 \n当該基盤保有事業者は、内閣サイバーセキュリティセンター（NISC）の最新の\n「重要インフラの情報セキュリティ対策に係る行動計画」で定める重要インフ\nラ事業者等とします。 \n \n9) 一般への情報の公表 \nJPCERT/CC および IPA は、JVN を通じて、一般に対し、脆弱性情報と JPCERT/CC\nから連絡したすべての製品開発者の脆弱性検証の結果、対策方法および対応状\n況を公表します。さらに、一旦公表した後、製品開発者から新たな対策方法と対\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n19 \n \n応状況のいずれか一つ以上を受け取った場合、その都度更新します。 \nまた、製品開発者が製品利用者に生じるリスクを低減できると判断した場合、\nJPCERT/CC は製品開発者と調整した上で、製品開発者が製品利用者に脆弱性検証\nの結果、対策方法および対応状況を公表前に通知することを認めることができ\nます。 \nさらに、JPCERT/CC および IPA は、JVN に関する問い合わせ先を明示し、主と\nして OSS 等に関して、システム構築事業者や製品利用者の脆弱性対応を促すこ\nとを目的として、問い合わせ対応を実施します。なお、問い合わせに関する内容\nについては、必要に応じて JVN の公表情報に反映します。 \n \n10) IPA への通知と判定に基づく公表 \nJPCERT/CC は、製品開発者との公表に係る調整が不可能と判断した場合には、\nその旨を IPA に通知します。 \n \nJPCERT/CC は、IPA から脆弱性情報を公表すると判定した旨の通知を受けた場\n合、脆弱性情報等を JVN で公表します。また、IPA から製品開発者の見解が通知\nされた場合、その見解を併記\n8\nして公表します。判定により脆弱性情報を公表し\nないこととなった場合、公表せず取扱いを終了します。 \nなお、公表に係る調整を再度行うように IPA から通知された場合には、その内\n容に応じて、JPCERT/CC は脆弱性関連情報に係る処理を再開します。 \n \n \n５．製品開発者の対応 \n \n製品開発者は、製品に脆弱性が存在する場合には、その対策に関して適切な対応\nをすることが望まれます。製品開発者に係る法的な論点は、付録３を参照してくだ\nさい。 \n以下で、製品開発者が脆弱性関連情報の対応のために、行うことが望ましい事項\nを説明します。 \n \n1) 窓口の設置 \n製品開発者は、JPCERT/CC との間で脆弱性関連情報に関する情報交換を行うた\nめの窓口を設置し、あらかじめ JPCERT/CC に連絡してください。この窓口が、\nJPCERT/CC の製品開発者リストに登録されることになります。併せて、製品開発\n者名等を「JPCERT/CC 製品開発者リスト」に掲載し公表することを承諾するかど\nうか連絡してください。 \nまた、窓口の変更があれば速やかに JPCERT/CC に連絡してください。 \n \n8\n 製品開発者が見解の併記を希望した場合のみ併記します。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n20 \n \n \nさらに、製品開発者が発見者からの直接届出を受け付けるために「JPCERT/CC\n製品開発者リスト」へ自身の窓口情報の掲載を希望する場合は、その旨を申し出\nてください。 \n \n2) 脆弱性検証の実施 \n製品開発者は、JPCERT/CC から脆弱性関連情報を受け取ったら、ソフトウエア\n製品への影響を調査し、脆弱性検証を行い、その結果を JPCERT/CC に報告してく\nださい。また、脆弱性が外部のソフトウエア製品に含まれることが推定される場\n合、JPCERT/CC に連絡してください。 \n何らかの理由で JPCERT/CC からの連絡を受け取れなかった場合も、JPCERT/CC\nから連絡不能開発者として示された場合には、速やかに JPCERT/CC に連絡して\nください。 \n \n3) 脆弱性情報の公表日の調整 \n製品開発者は、検証の結果、脆弱性が存在することを確認した場合、対策方法\nの作成や外部機関との調整に要する期間、当該脆弱性情報流出に係るリスクを\n考慮しつつ、脆弱性情報の公表に関するスケジュールについて JPCERT/CC と相\n談してください。なお、公表日は、JPCERT/CC が「製品開発者への連絡」（４．2）\nを参照）にて規定された連絡を最初に試みた日（起算日、２．注釈 4 を参照）か\nら 45 日後を目安とします。公表に更なる時間を要する場合は、JPCERT/CC と相\n談してください。 \n \n4) 発見者との直接の情報交換 \n製品開発者は、JPCERT/CC から脆弱性関連情報を受け取った後、JPCERT/CC お\nよび IPA を介し、発見者の了解を得て、発見者と直接情報交換を行うことができ\nます。 \n \n5) 関連ウェブサイトに関する情報の取扱い \n当該ソフトウエア製品がウェブサイトの構成要素であり、製品開発者が当該\n脆弱性を再現できない場合、 製品開発者は、届出に関連したウェブサイトの情\n報を JPCERT/CC に求めることができます。製品開発者は、関連ウェブサイトの情\n報が提供された場合、その情報を第三者に漏えいしないように適切に管理して\nください。  \n \n6) 問い合わせへの対応 \n製品開発者は、JPCERT/CC からの脆弱性関連情報に係る技術的事項および進捗\n状況に関する問い合わせに的確に答えてください。 \n \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n21 \n \n7) 対策方法および対応状況の連絡 \n製品開発者は、脆弱性情報の一般への公表日までに脆弱性関連情報に係る対\n策方法を作成するように努めて、対策方法および対応状況を JPCERT/CC に連絡\nしてください。JPCERT/CC に対する対策方法および対応状況の報告をもって、IPA\nにも報告したこととみなされます。また、新たな対策方法を作成した場合や対応\n状況が変わった場合、その都度、JPCERT/CC に最新の情報を連絡してください。 \n \n8) 対策方法の周知 \n製品開発者は、対策方法を作成した場合、脆弱性情報一般公表日以降、それを\n製品利用者に周知してください。望ましい公表の手順については、本ガイドライ\nンの別冊「ソフトウエア製品開発者による脆弱性対策情報の公表マニュアル」を\n参考にしてください。 \n \n9) 製品開発者内の情報の管理と開示 \n製品開発者は、正当な理由がない限り、第三者に脆弱性関連情報を開示しない\nでください。また、製品開発者は、上記 3)で作成した脆弱性情報の一般公表ス\nケジュールおよび脆弱性関連情報を、脆弱性情報を一般に公表する日まで第三\n者に漏えいしないように管理してください。 \nただし、製品利用者に生じるリスクを低減できると判断した場合、製品開発者\nは、JPCERT/CC と調整した上で、直接あるいはシステム構築事業者を介して製品\n利用者に脆弱性検証の結果、対策方法および対応状況を公表前に通知すること\nができます。その際、製品開発者は、通知先に対し、脆弱性関連情報を第三者に\n開示しないこと、および脆弱性情報を一般に公表するまでの間、脆弱性情報と対\n策方法について、第三者に漏えいしないように適切に管理することを要請して\nください。 \n \n10) 公表判定委員会に関する対応 \nIPA および JPCERT/CC は、製品開発者と適切な連絡が取れない等の理由により\n進展が見込めなくなった場合には、３．(2)に定める手続きを行い、公表するか\nどうかを IPA が組織する公表判定委員会で判定することができます。脆弱性情\n報を公表すると判定した場合、IPA および JPCERT/CC は、製品開発者名とともに\n脆弱性情報等を JVN で公表します。 \n公表判定委員会による判定が行われる場合、製品開発者には意見を表明する\n機会が与えられます。公表判定委員会による判定のプロセスについては３．(2)\nを参照してください。 \n \n  \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n22 \n \n６．その他 \n \n1) 製品開発者自身による脆弱性関連情報の発見・取得 \n製品開発者は、自身のソフトウエア製品に関する脆弱性関連情報について自\n身で発見・取得した場合、または他の者によって開示された脆弱性関連情報を取\n得した場合、対策方法を作成し、製品利用者に対して当該脆弱性情報と対策方法\nを周知してください。 \nさらに、製品開発者は、当該脆弱性関連情報および対策方法を IPA または\nJPCERT/CC に通知してください。ただし、すべての製品利用者に当該脆弱性関連\n情報および当該対策方法を通知した場合、通知は不要です。 \n \n2) IPA および JPCERT/CC による普及支援 \nIPA および JPCERT/CC は、上記 1)で受け取った届出に関して、当該脆弱性情\n報および対策方法を JVN で公表します。公表する時期については、製品開発者と\n事前に調整を図ります。 \n \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n23 \n \nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n１．概要 \nウェブアプリケーションに係る脆弱性関連情報取扱概要は、図２の通りです。 \n \n図２  ウェブアプリケーションに係る脆弱性関連情報取扱概要 \n(ウェブアプリケーションにおける脆弱性情報取扱いの全体フローは付録２を参\n照) \n \n1) 発見者は、IPA に脆弱性関連情報を届け出る \n2) IPA は、受け取った脆弱性関連情報に関して、原則としてウェブサイト運営者\nに通知する \n3) ウェブサイト運営者は、脆弱性関連情報の内容を検証し、影響の分析を行った\n上で、必要に応じて脆弱性の修正を行う \n4) 個人情報漏えい等の事件があった場合、ウェブサイト運営者は、その事実を一\n般に公表する等適切な処置をとる \n5) IPA は統計情報を、原則、四半期ごとに公表する \n \n \n発見者\nIPA\nウェブサイト運営者\n一般\n1 \n発見者は、IPAに脆弱性\n関連情報を届け出る\n2IPAは、ウェブサイト運営者に\n脆弱性関連情報を通知する\n3ウェブサイト運営者は、\n脆弱性を修正する\n4ウェブサイト運営者は、\n個人情報漏洩等があった\n場合、その事実を一般に\n公表する等の措置をとる\n５IPAは、四半期ごとに\n統計情報を公表する\n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n24 \n \n２．発見者の対応 \n \n1) 脆弱性関連情報の発見・取得 \n脆弱性関連情報の発見・取得に際しては、関連法令に触れることが無いよう\nに留意してください。法的な論点に関しては、付録３を参照してください。 \n \n2) 脆弱性関連情報の届出 \n発見者は、発見した脆弱性関連情報を IPA に届け出てください。 \nなお、外部からの連絡窓口\n9\nを設置しているウェブサイト運営者については、\n直接届出を行うことも可能です。ウェブサイト運営者に直接届け出たが、脆弱性\nの解消に向けたウェブサイト運営者との調整が難航した場合には、IPA に連絡し\nてください。 \n \n3) 脆弱性関連情報の管理および開示 \n発見者は、脆弱性関連情報を正当な理由がない限り第三者に開示しないでく\nださい。ただし、正当な理由があって脆弱性関連情報を開示する場合には、事前\nに IPA に相談してください。発見者は、脆弱性が修正されるまでの間は、脆弱性\n関連情報が第三者に漏えいしないように適切に管理してください（発見者に対\nする情報非開示依頼、以下「情報非開示依頼」という）。脆弱性関連情報の管理\nおよび開示に係る法的な問題に関しては、付録３を参照してください。 \n \n4) 届け出る情報の内容 \n発見者は、届け出る情報の中で以下の点を明示してください（詳細は、\nhttps://www.ipa.go.jp/security/vuln/ を参照）。 \n(ア) 氏名等の発見者を識別するための情報 \n(イ) 電子メールアドレス等の発見者の連絡先 \n(ウ) (ア)および(イ)のウェブサイト運営者への通知の可否 \n(エ) ウェブサイト運営者から直接連絡を受けることの可否 \n(オ)  脆弱性関連情報に係るウェブアプリケーションが稼動しているウェ\nブサイトの URL \n(カ) 脆弱性関連情報の内容（脆弱性関連情報を確認する環境と、手順およ\nび結果） \n可能であれば、脆弱性が存在する証拠\n10\nを一緒に提出してください。\nただし、証拠の取得に際しては、関連法令に触れることがないように\n留意してください（付録３を参照）。 \n(キ) 個人情報の取扱い方法（ウェブサイト運営者との直接の情報交換の可\n否、ウェブサイト運営者への通知の可否） \n発見者が望まない場合、IPA は、ウェブサイト運営者へ発見者を特定\n \n9\n たとえば「ホームページに対するお問い合わせ窓口」のことです。 \n10\n 具体的には、「検証コード」、「画面キャプチャ」、「ログ」等。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n25 \n \nしうる情報を連絡することはありません。 \n(ク) 他の組織（製品開発者、他のセキュリティ関係機関等）への届出状況\n等 \n \n5) ウェブサイト運営者との直接の情報交換 \n発見者は、IPA に脆弱性関連情報を届け出た後、IPA と協議の上、ウェブサイ\nト運営者の了解を得て、ウェブサイト運営者と直接情報交換を行うことができ\nます。 \n \n6) 届出後の対応 \n発見者は、届出後、IPA に進捗状況の問い合わせを行うことができます。IPA\nは、本ガイドラインの３．に則って処理を行い、発見者から問い合わせがあった\n場合、適切な情報の開示を行います。発見者は、開示された情報をみだりに第三\n者に開示しないでください。 \n \n \n３．IPA（受付機関）の対応 \n \n1) 脆弱性関連情報の受付 \n脆弱性関連情報の受付に関し、詳細は以下の URL をご参照ください。 \nhttps://www.ipa.go.jp/security/vuln/  \n届出は 24 時間受け付けますが、受け付けた情報について 2)以降の作業を行うの\nは原則営業日のみとなります。 \n \n2) 届出の受理 \nIPA は、届出の記載が以下の条件をすべて満たしていると判断した時、その時\n点で届出を受理し、発見者に連絡します。 \n(ア)上記２．4)の項目がすべて記載されていること \n(イ)届出内容に矛盾等が無いこと \n(ウ)届出の対象が本ガイドラインの適用範囲に該当すること（\nIII章を参照） \n(エ)記載されている内容が脆弱性であること \n(オ)既知の脆弱性とは異なる脆弱性の関連情報であること（ウェブサイト運\n営者により既に修正された脆弱性ではないこと） \n \nなお、IPA は、これらの条件により、届出の受理または不受理を判断し、その\n理由とともに発見者に連絡します。なお、発見者に届出の受理を連絡した日が\nIPA による脆弱性関連情報の取扱いを開始した日（受理日）となります。 \n \n \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n26 \n \n3) 違法な手段で入手された脆弱性関連情報への対応 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な手\n段で入手されたことが明白な脆弱性関連情報に関しては、処理を取りやめるこ\nとがあります。 \n \n4) 脆弱性関連情報への対応続行の判断 \nIPA は、以下の条件のいずれかと合致した場合、処理を取りやめるとともにウ\nェブサイト運営者および発見者に連絡します。なお、取扱いを終了する場合、\nIPA の発見者に対する情報非開示依頼は効力を失います。 \n(ア)脆弱性関連情報に該当しない場合 \n(イ)本ガイドラインの適用範囲外である場合 \n(ウ)脆弱性による影響が小さい場合（付録４を参照） \n(エ)ウェブサイト運営者から脆弱性関連情報が既知であり、その脆弱性が \n修正されていると連絡があった場合 \n(オ)ウェブサイトの不適切な運用（付録１を参照）のうち、脆弱性の原因が\n下記と判明したもので、IPA が注意喚起等の方法で広く対策を促した後、\n処理を取りやめる判断をした場合 \n・ウェブサイトが利用しているソフトウエア製品の設定情報が誤って\nいる場合や初期状態のままとなっている場合。 \n・ウェブサイトが利用しているソフトウエア製品の修正プログラムが\n適用されていない場合。 \n(カ)ウェブサイト運営者から適切な応答が得られない場合（ 5）を参照） \n(キ)ウェブサイト運営者から脆弱性による影響度が低い等の理由により対\n応を行わないと連絡があった場合 \n上記(オ)の注意喚起後は、該当するソフトウエア製品の製品開発者も対策方\n法の再度の周知をウェブサイト運営者へ行うことを推奨します。 \n \n5) ウェブサイト運営者への連絡 \nIPA は、上記 2)、3)および 4)における対応の是非の判断の結果、対応するこ\nとが妥当との判断を下した脆弱性関連情報について、速やかにウェブサイト運\n営者に通知します。また、ウェブサイト運営者が脆弱性の再現する状況を特定で\nきない場合等は、ウェブサイト運営者の了解を得た上で、IPA は IPA の内部また\nは外部で脆弱性関連情報に関する技術的分析を行います。なお、届出された脆弱\n性による影響が大きい場合、受付の順序に関わらず、優先的に取扱いを行います\n（付録４を参照）。 \n  ウェブサイトに掲載された宛先情報をもとに電子メールや電話、FAX 等いずれ\nの手段でウェブサイト運営者に脆弱性関連情報に係る問い合わせを試みても、\n一定期間にわたり的確な答えがない場合、IPA は、その脆弱性の影響範囲や取扱\n期間を考慮して取扱いを終了することがあります（ 4)(カ)を参照）。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n27 \n \n \n6) 発見者との情報交換 \nIPA は、届出を受理した後でも、発見者に問い合わせすることがあります。ま\nた、発見者から問い合わせがあった場合、ウェブサイト運営者と相談の上、適切\nな情報の開示を行います。 \n \n7) 脆弱性関連情報の取扱い \nIPA は、脆弱性関連情報に関して、発見者・ウェブサイト運営者以外の第三者\nに開示しません。ただし、下記のような正当な理由がある場合は、外部機関に脆\n弱性関連情報を開示することがあります。これらの場合、IPA は秘密保持契約を\n結びます。さらに、下記 8)に関しては例外とします。 \n（ア）脆弱性が再現する状況を特定できない等止むを得ない場合、IPA は国\n立研究開発法人産業技術総合研究所等の外部機関に脆弱性関連情報に\n関する技術的分析を依頼する \n（イ）政府機関のウェブサイトの場合、IPA は内閣サイバーセキュリティセ\nンター（NISC）へ当該ウェブサイト運営者への脆弱性関連情報の一部を\n開示し迅速な情報の取得を依頼する \n（ウ）地方公共団体のウェブサイトの場合、IPA は総務省へ当該ウェブサイ\nト運営者への脆弱性関連情報の一部を開示し迅速な情報の取得を依頼\nする \n（エ）個人情報が漏えいしているおそれがあり、ウェブサイト運営者による\n対応がされない場合、IPA は個人情報保護委員会に脆弱性関連情報を連\n絡し、個人情報保護法（平成 15 年法律第 57 号）第 42 条に基づく措置\nを依頼する \n \n8) ソフトウエア製品の脆弱性である場合の対応 \nIPA は、届け出られた脆弱性関連情報を分析する過程で、ソフトウエア製品の\n脆弱性であることを認識した場合、JPCERT/CC を介して製品開発者に連絡を行い\nます。その際、原則としてウェブサイトを特定可能な情報を提供しないように適\n切に管理します。ただし脆弱性の再現のため必要な場合、ウェブサイト運営者の\n同意が得られれば、当該ウェブサイトに関する情報を製品開発者に提供するこ\nとがあります。 \n \n9) 発見者の個人情報の管理 \nIPA は、氏名・連絡先を含む発見者に係る情報を、発見者が望む場合以外には、\nウェブサイト運営者および第三者に漏えいしないよう適切に管理します。 \n \n10) 脆弱性の修正の通知 \nIPA は、ウェブサイト運営者から脆弱性を修正した旨の通知を受けた場合、そ\n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n28 \n \nれを速やかに発見者に通知します。 \n \n11) 統計情報の集計と公表 \nIPA は、脆弱性に係る実態を周知徹底し危機意識の向上を図り、その結果とし\nての被害の予防のために、受け付けた脆弱性関連情報を集計し、統計情報として\nインターネット上等で原則、四半期ごとに公表します。統計情報には、届出件数\nの時間的推移等が含まれます。その際に、当該ウェブアプリケーションの脆弱性\n関連情報に関して、サイト名・URL・ウェブサイト運営者名が判別可能な形式で\n公表することはありません。 \n \n \n４．ウェブサイト運営者の対応 \n \nウェブアプリケーションに脆弱性が存在する場合には、ウェブサイト運営者\nは、これに関して適切な対応をすることが望まれます。 \nウェブサイト運営者における法的な論点は、付録３を参照してください。 \n以下で、ウェブサイト運営者が対応すべき事項を説明します。 \n \n1) 脆弱性関連情報への対処 \nウェブサイト運営者は、通知を受けたら、脆弱性の内容を検証し、脆弱性が存\n在することを確認した場合には、脆弱性の及ぼす影響を正確に把握し、その大き\nさを考慮して脆弱性を修正してください。また、当該脆弱性関連情報に関して検\n証した結果、および修正した場合その旨を IPA に連絡してください。この連絡\nは、IPA から脆弱性関連情報の通知を受けてから、3 ヶ月以内を目処としてくだ\nさい。 \n \n2) 問い合わせへの対応 \nウェブサイト運営者は、IPA からの脆弱性関連情報に係る問い合わせに的確に\n答えてください。 \n \n3) 発見者との直接の情報交換 \nウェブサイト運営者は、脆弱性を修正するために、IPA と協議の上、発見者の\n了解のある場合、発見者と直接情報交換を行うことが可能です。 \n \n4) ウェブサイト運営者内の情報の管理と開示 \nウェブサイト運営者は、脆弱性関連情報を正当な理由がない限り第三者に開\n示しないでください。ただし、ウェブサイト運営者が脆弱性修正を依頼した外部\n機関、およびウェブサイトの管理を委託している外部機関には、秘密保持契約を\n締結した上で脆弱性関連情報を連絡することを推奨します。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n29 \n \nまた、ウェブサイト運営者は、脆弱性が修正されるまでの間は、脆弱性関連情\n報を第三者に漏えいしないように管理してください。なお、ウェブサイト運営者\nは、脆弱性の修正の過程でソフトウエア製品の脆弱性であることを認識した場\n合、脆弱性関連情報を第三者に正当な理由がない限り開示しないでください。ま\nた、当該脆弱性情報等が公表されるまで情報を第三者に漏えいしないように管\n理してください。 \n \n5) 脆弱性関連情報の公表 \nウェブサイト運営者は、ウェブアプリケーションの脆弱性関連情報に関して、\n積極的に公表する必要はありません。ただし、この脆弱性が原因で、個人情報が\n漏えいした等の事案が起こったまたは起こった可能性がある場合、二次被害の\n防止および関連事案の予防のために、以下の項目を含むように公表してくださ\nい。 \nまた、当該個人からの問い合わせに的確に回答するようにしてください。 \n・ 個人情報漏えいの概要 \n・ 漏えいしたと推察される期間 \n・ 漏えいしたと推察される件数 \n・ 漏えいしたと推察される個人情報の種類（属性等） \n・ 漏えいの原因 \n・ 問合せ先 \n \n\n付録１  用語の解説 \n \n30 \n \n付録１  用語の解説 \n \n１．ソフトウエア製品 \nソフトウエア製品（技術情報の統括や開発保守を行っている者をコミュニティ\nとしてしか特定できない、オープンソースソフトウエアのようなものも含みます）\nの種類は、OS、ブラウザ、メーラ等のクライアント上のソフトウエア、DBMS\n（Database Management System）、ウェブサーバ等のサーバ上のソフトウエア、プ\nリンタ、IC カード、PDA（Personal Digital Assistance）、コピー機等のソフトウ\nエアを組み込んだハードウエア、制御システム用製品等を想定しています。 \n制御システムは、他の機器やシステムの動作を管理、指示、制御するシステムま\nたは装置であり、センサやアクチュエータ等のフィールド機器、制御用ネットワー\nク、コントローラ、監視制御システム（SCADA：Supervisory  Control  And  Data \nAcquisition とも呼ばれる）等で構成されています。 \n制御システムは、一般にライフサイクルが長いこと、業務の性質上すぐに停止で\nきないため、対策が用意されてもそれを実施することが難しい場合があることか\nら、対策の実施に時間を要する点に配慮する必要があります。さらに、社会基盤を\n支える制御システムの場合、被害が生じたときの社会的影響が大きい点にも配慮\nする必要があります。 \n \n２．エクスプロイトコード \nエクスプロイトコードは、攻撃コードとも呼ばれることもあり、脆弱性を悪用す\nるソフトウエアのソースコードです。しかし、使い方によっては、脆弱性の検証に\n役立つこともあります。 \n \n３．ワークアラウンド \n当該脆弱性を修正する以外の方法で脆弱性による影響を回避・低減する方法で\nす。例えば、ソフトウエア製品においては、脆弱性のある機能の無効化や代替ソフ\nトウエアへの移行等があります。ウェブサイトにおいては、脆弱性の影響を受ける\nサービスの停止や、WAF（ウェブ・アプリケーション・ファイアウォール）の導入\n等があります。 \n \n４．パッチ \n脆弱性を有するソフトウエアから、脆弱性を解消するためにソフトウエアに対\nして適用する差分のソフトウエアあるいはデータのことです。 \n \n５．ウェブサイト運営者 \n\n付録１  用語の解説 \n \n31 \n \nウェブサイト運営者とは、ウェブアプリケーションを運営する主体です（例え\nば、ウェブサイト  https://www.ipa.go.jp/  のウェブサイト運営者は IPA です）。\nウェブサイトの管理を外部の事業者に委託している場合でも、あくまで委託元が\nウェブアプリケーションを運営する主体でありウェブサイト運営者となります。 \n \n６．プロトコルの実装に係る脆弱性 \n過去に報告があったプロトコルに関連する脆弱性の主なものを以下に挙げます。 \n(1) H.323 に係る脆弱性 \n(2) SSH2 に係る脆弱性 \n(3) OpenSSL に係る脆弱性 \n(4) ASN.1 に係る脆弱性 \n \n７．ウェブサイトの不適切な運用 \nウェブサイトの不適切な運用の例を以下に挙げます。 \n・ウェブサイトにおいて、本来提供するべき対象外の機能（ウェブサイト管理画\n面等）やファイル（個人情報ファイル等）が、アクセス制限なしに公開されて\nおり、セキュリティが維持できなくなっている。 \n・ウェブサイトで使用されているソフトウエア製品に脆弱性が存在している。 \n・サービスを行っていないウェブサイトの脆弱性が放置されている。 \n \n\n付録２  脆弱性情報取扱いのフロー \n \n32 \n \n付録２  脆弱性情報取扱いのフロー \n \nソフトウエア製品、ウェブアプリケーションそれぞれの脆弱性情報取扱いに関\nする全体的な流れを図３、図４に示す。 \n  \n\n付録２  脆弱性情報取扱いのフロー \n \n33 \n \n \n発見者\nIPA\nJPCERT/CC\n製品開発者\n脆弱性関連情報の届出\n脆弱性関連情報\nの連絡\n不明点の確認\n届出受理の連絡\n公表の連絡\n対応状況の公表\n受理／不受理\nの決定\n受付\n以下を確認\n•\n項目をすべて記載\n•\n内容に矛盾が無い\n•\n適用範囲に該当\n•\n内容が脆弱性である\n•\n既知の脆弱性ではない\n製品開発者\nへ連絡\nIPA\n、\nJPCERT/CC\nが\n共同運営する\nポータルサイト\n（\nJVN\n）\n連絡先の確認\n図３ ソフトウエア製品における脆弱性情報取扱いの全体フロー\n連絡窓口\nの設置\n対策方法\nの作成\n対策情報\nの周知\n脆弱性の\n検証・評価\n対応状況の\n連絡\n脆弱性関連情報\nの連絡\n問い合わせ\n問い合わせ\n起算日の連絡\n問い合わせ\n対応状況\nの受付\n公表日の調整\n検証結果の報告\n対応状況の報告\n対応状況の共有\n統計情報の公表\nJPCERT/CC\nへ連絡\n1\n2\n3\n4\n6-16-2\n6-3\n6-4\n起算日の連絡\n5\n公表日の調整\n7\n8\n9\n10\n9\n起算日の連絡\n5\n公表日の調整\n8\n公表判定\n開催連絡と意見聴取\n6’-4\n脆弱性情報の公表\n(\n製品開発者の\n見解併記\n)\n統計情報の公表\n9’\n左記の6 以降、IPAが、JPCERT/CCから\n調整不能である旨の通知を受けた場合の対応\n場合によっては、重要インフラ事業者に優先的に情報提供する\n【調整不能案件の取扱い】\n影響が小さい脆弱性の場合、製品開発者に通知することで取扱終了とすることができる\nIPA\nおよび\nJPCERT/CC\n（\nIPA\nが組織）\n公表判定委員会\n6’-2\n結果通知\n7’\n判定に必要な情報\nの収集・整理\n6’-1\n併記する見解の聴取\n開催連絡\n意見提出\n意見提出\n6’-3\n結果通知\n見解提出\n8’-1\n製品開発者\n•\n判定結果が「公表しない」だった場合、取り扱いを終了する\n•\n判定結果が再調整だった場合、 製品開発者と再度調整を実施する\n連絡が取れない場合、連絡不能開発者一覧に公表し、製品開発者からの連絡を呼びかける\n8’-2\n見解提出\n10’\n起算日の連絡\n発見者へ\n公表の連絡\n\n付録２  脆弱性情報取扱いのフロー \n \n34 \n \n \n \n発見者\nIPA\nウェブサイト運営者\n脆弱性関連情報の届出\n脆弱性関連情報\nの連絡\n不明点の確認\n届出受理の連絡\n受理\n/\n不受理\nの決定\n受付\n脆弱性の\n検証・評価\n図４ ウェブアプリケーションにおける脆弱性情報取扱いの全体フロー\n修正\n担当窓口\nの確認\n連絡先の確認\n問い合わせ\n問い合わせ\n修正完了の報告\n修正完了の連絡\n統計情報\nの公表\n開始連絡\n取扱い開始の連絡\n対応状況\nの連絡\n修正完了\n連絡\n検証結果の報告\n1\n2\n3\n4\n5-1\n5-2\n5-35-4\n6\n7\nウェブサイト\n運営者へ連絡\n影響が小さい脆弱性の場合、ウェブサイト運営者に通知することで取扱終了とすることができる\n以下を確認\n•\n項目をすべて記載\n•\n内容に矛盾が無い\n•\n適用範囲に該当\n•\n内容が脆弱性である\n•\n既知の脆弱性ではない\n3\n\n付録３  法的な論点について \n \n35 \n \n付録３  法的な論点について \n \n１  発見者が心得ておくべき法的な論点 \n \n発見者が心得ておくべき法的な問題に関する法律専門家の見解を述べます。 \n \n１－１．脆弱性関連情報の発見に際しての法的な問題 \n \n（１）関係する行為と法令の関係 \na) ネットワークを用いた不正 \n・例えば、脆弱性関連情報を利用して、アクセス制御機能を回避し、\nインターネット等を介してシステムにアクセスした場合には、不正ア\nクセス禁止法（不正アクセス行為の禁止等に関する法律）に抵触しま\nす。 \n・例えば、管理者の了解無く、他人のパスワードを取得し、それを用\nいて権限なしでシステムにアクセスした場合には、不正アクセス禁止\n法に抵触します。 \n・故意にサーバの機能や性能の異常を来たそうとして何らかの行為を\nなし、コンピュータの性能を低下させたりした場合、刑法上の偽計（も\nしくは威力）業務妨害罪に抵触する可能性があります。さらに、その妨\n害の程度によっては、刑法の電子計算機損壊等業務妨害罪にも抵触す\nると解される可能性があります。 \nb) 暗号化されている無線通信の復号化 \n・暗号化されている無線通信を傍受し復号する行為（無線 LAN の WEP\nキーを解読して通信内容を復号すること）は、電波法 109 条の 2 に触\nれる可能性があります。 \n \n（２）不正アクセス禁止法に抵触しないと推察される行為の例 \n脆弱性の発見に最も関係が深い不正アクセス禁止法に対しては慎重な扱いが\n求められます。といっても脆弱性を発見する際に、必ずしも不正アクセス禁止\n法に抵触するとは限りません。以下に、不正アクセス禁止法に抵触しないと推\n察される行為の例を挙げます。 \n1) ウェブアプリケーションの利用権者が、正規の手順でログインする等し\nて通常のアクセスをした際に、ブラウザとサーバとの通信の内容を観察\nしたところ、それだけで脆弱性の存在を推定できた場合。 \n\n付録３  法的な論点について \n \n36 \n \n2) ウェブページのデータ入力欄に HTML のタグを含む文字列を入力したとこ\nろ、入力した文字列がそのまま表示された。この段階ではアクセス制御\n機能の制限を回避するに至らなかったが、悪意ある者に別の文字列を入\n力されれば、このサイトにセキュリティ上の問題が引き起こされかねな\nいと予想できた場合。 \n3) アクセス制御による制限を免れる目的ではなく、通常の自由なページ閲\n覧を目的として、日付やページ番号等を表すと推察される URL 中の数字\n列を、別の数字に差し替えてアクセスしてみたところ、社会通念上、本\n来は利用できてはならないはずと推定される結果が、偶発的に起きてし\nまった場合。（ただし、積極的に多数の数字列を変えて試す行為等は、\n制限を免れる目的とみなされる可能性があります。） \n \n（３）IPA の対応と発見者の法的責任 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な\n手段で入手されたことが明白な脆弱性関連情報に関しては、受け付けないこ\nとがあります。 \nまた、IPA が脆弱性関連情報を受け付けた場合でも、IPA は脆弱性関連情報\nの入手手段に関して合法であると判断したわけではありません。さらに、IPA\nが脆弱性関連情報を受け付けた場合、発見者の脆弱性関連情報の発見に係る\n法的責任が免責されるわけではありません。 \n \n１－２．脆弱性関連情報の管理および開示に際しての法的な問題 \n \n発見者の脆弱性関連情報の管理および開示に際しては、以下の法的な問題へ\nの注意が必要です。 \n \n1) 脆弱性についての調査・報告は、その率直な交換により、ソフトウエア\nやウェブアプリケーションシステムのセキュリティが結果として強化さ\nれ・向上するという側面があります。 \n2) しかしながら、その情報については、悪用というデメリットがあるの\nで、その点についての十分な配慮がなされるべきであり、その一つの方\n向性を提唱するのが、このガイドラインといえます。 \n3) また、情報自体そのような性格をもつので、発見者についても脆弱性関\n連情報の管理および開示について真摯な態度が必要とされます。 \n\n付録３  法的な論点について \n \n37 \n \n4) そのような真摯な態度を保つ限り脆弱性関連情報についての調査・報告\nは、社会的に有用なものと考えられます。 \n \nしかしながら、管理および開示について真摯な態度を欠く場合については、\n上述の限りではありません。そのような真摯な態度を欠く場合の具体的な例\nとして以下があります。 \na) 脆弱性関連情報の公表は、その情報の内容が真実と異なることを知っ\nていた場合、あるいは、真実である場合であっても、特定人の名誉を\n毀損する意図で公表がなされ、かつ、公共の利益と無関係である場合\nには、刑法の名誉毀損罪に触れる可能性があります。 \nb) 特定人の信用を毀損する意図で事実と異なる脆弱性関連情報を、事実\nと異なると認識して公表がなされる場合には、刑法の信用毀損罪に触\nれる可能性があります。 \nc) 通常人に求められる程度の相当の注意をもって調査・検証したりした\nのではなしに脆弱性関連情報であるとして公表し、かつ、脆弱性関連\n情報の開示に起因して損害が発生した場合、損害賠償責任等の民事責\n任を追及される可能性があります。 \n \n \n２  製品開発者が心得ておくべき法的な論点 \n \n製品開発者が心得ておくべき法的な問題に関する法律専門家の見解を述べま\nす。 \n \n(1)ソフトウエアの提供行為についていえば、セキュリティに問題が生じず、日\n頃の運用で安心して使えるというレベルのソフトウエアを提供することが、\n法律上、債務の本旨に従った履行（民法４１５条）として求められています。 \n(2)もし、提供したソフトウエアにおいて、設計上の問題、プログラミング上の\n問題、運用上の問題の如何を問わず、社会通念上、安心して使えるというレ\nベルにいたらない箇所が生じている場合には、その点に対してサポートの約\n定の趣旨に従い対策をすべきことが求められます。 \n(3)もっともその対策方法の選択については、種々の考慮が必要になります。 \n \nこの対策方法の選択に際しては、以下の点を論点として意識する必要があり\nます。 \n(a) 上記の対策方法の選択について、状況に応じて債務不履行責任（民法４１\n\n付録３  法的な論点について \n \n38 \n \n５条）、不法行為責任（民法７０９条）の対象となる可能性があります。 \n(b) 提供の際の契約で、これを免除する場合については、消費者契約法の適用\nがある場合には、責任の全部免除が認められない場合がありえます。 \n(c) 製造物責任法上の問題として、現時点において、ソフトウエアそれ自体に\nついては製造物責任が問われないと一般に解釈されていますが、電気機\n器や電子部品その他の工業製品等に組み込まれたソフトウエアは動産で\nある製造物ですので製造物責任法に定める責任規定の適用がなされるこ\nとがありえます。 \n \n \n３  ウェブサイト運営者が心得ておくべき法的な論点 \n \nウェブサイト運営者が心得ておくべき法的な問題に関する法律専門家の見解\nを述べます。 \n \n1) ウェブサイト運営者と、ウェブサイト利用者との間においては、そのウェ\nブアプリケーションの利用に際して、一定の契約関係にはいると考えられま\nす。そして、ウェブサイト利用者が、そのサイトに一定の個人情報等をゆだ\nねる場合には、ウェブサイト運営者は、そのサイトの利用契約に付随した義\n務として一定レベルのセキュリティ維持を果たすべき義務を負担している\nと考えることができます。 \n2) 各サイトに「プライバシポリシ」等が記載されている場合には、その内容を\nも前提にウェブサイト利用者とウェブサイト運営者は、契約関係にはいると\n考えられます。 \n3) この場合、ウェブサイト運営者において、上記のセキュリティ維持等につ\nいて過失がある場合、その過失による損害賠償の責めを免れるような規定は、\n消費者契約法上、全部免責の規定については無効となることがあります。 \n \n \n \n\n付録４  脆弱性の影響度の基準に関する考え方について \n \n39 \n \n付録４  脆弱性の影響度に関する考え方について \n \n脆弱性の「影響度」に関する考え方は、関係者から得られた情報や IPA・\nJPCERT/CC が把握している情報を勘案し、IPA および JPCERT/CC が総合的に判断\nした脆弱性の深刻度（CVSSv3 基本値スコア）と影響範囲により決定します。 \nソフトウエア製品の脆弱性、ウェブアプリケーションの脆弱性のいずれも下\n記の考え方で実施します。ただし、ウェブアプリケーションについては、これま\nでの経緯を踏まえ、CVSSv3 基本値スコアが「4.0 ～ 6.9」でかつ脆弱性の影響\n範囲が中の場合でも、受動型の攻撃であれば、取扱いを終了することを可能とし\nます。 \n影響度の考え方 \n \n脆弱性の深刻度  ：脆弱性の深刻度として、CVSSv3 基本値スコアを適用する。 \n脆弱性の影響範囲：以下の要素を勘案して選択する。①～③がすべて不明の場\n合は「広」と判断する。 \n  ①利用者数 \n当該ソフトウエアの利用者数。 \n  ②社会的影響力 \n重要インフラ等でも取扱っていると思われるソフトウエア製品の脆弱性\nである。 \n  ③攻撃の容易性\n \n攻撃コードの公表、または実際の攻撃の発生が確認された場合に「広」と\n判断する。届出についての取扱いを判断する時点の情報で判断を行う。 \n \n通常の対応    優先対応優先対応\n簡易な対応    通常の対応    優先対応\n簡易な対応    簡易な対応    通常の対応\n4.07.010.0\n0\n狭\n中\n広\n脆弱性の深刻度\n（CVSSv3基本値スコア）\n脆\n弱\n性\nの\n影\n響\n範\n囲\n\n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n40 \n \n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n１  連絡不能開発者一覧の公表\n11\n \n  \n製品開発者名や製品開発者を特定できるような情報を公表することで、掲載\nされた製品開発者からの連絡を求めていることを周知します。想定読者は、製品\n開発者本人です。 \n \n \n製品開発者情報  公開調査  \n \n概要 \nIPA（独立行政法人情報処理推進機構）および JPCERT コーディネーションセン\nターでは、情報セキュリティ早期警戒パートナーシップに基づいて届出られ\nたソフトウエア製品の製品開発者、またはその関係者からのご連絡を求めて\nいます。  \n \n調査対象 \n情報セキュリティ早期警戒パートナーシップに基づいて届けられたソフトウ\nエア製品で、インターネット等から入手しうる情報では連絡が取れない、以下\nの一覧に掲載されている製品開発者、またはその関係者が調査対象です。  \n \n連絡先 \nSubject に問い合わせ番号を明記し jvn@jvn.jp 宛に、ご連絡ください。  \n \n \n連絡不能開発者一覧 \n問合せ番号 開発者名 関連情報 一覧追加日 製品情報 備考 \nDID#AAAA       AAA          －      YYYY/MM/DD     －          － \nDID#BBBB       BBB          －      YYYY/MM/DD     －          － \nDID#CCCC        －          －      YYYY/MM/DD     －     XXXXX の製品\n開発者 \nDID#DDDD        －      http://ddd  YYYY/MM/DD  YYYY/MM/\nDD（開示） \nYYYYY の製品\n開発者 \nDID#EEEE       EEE     http://eee  YYYY/MM/DD  YYYY/MM/\nDD（開示） \nZZZZZ の製品\n開発者 \n \n11\n 連絡不能開発者一覧  https://jvn.jp/reply/index.html \n\n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n41 \n \n２  対象製品情報の公表と関係者へのお願い \n \n製品開発者名や製品開発者を特定できるような情報に加えて、具体的な対象\n製品の名称やバージョンを公表することで、製品開発者だけでなく、製品関係\n者からの連絡を求めていることを周知します。想定読者は、製品開発者本人、\nまたは製品開発者との連絡方法を知っている方です。 \n \n【対象が官庁、法人の場合】 \nXXXXX の製品開発者に関する情報  \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または販売代理店等、本製品に関係する方は下記の宛先までご連\n絡をお願いします。  \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日 \n \n【対象が官庁、法人の場合（連絡期限追記）】 \nXXXXX の製品開発者に関する情報  \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または販売代理店等、本製品に関係する方は下記の宛先までご連\n絡をお願いします。  \n本件に関するご連絡は、yyyy 年 mm 月 dd 日まで受け付けます。  \nなお、yyyy 年 mm 月 dd 日までにご連絡をいただけなかった場合は、製品開発\n者と連絡が取れないため連絡不能と判断し、「情報セキュリティ早期警戒パ\nートナーシップガイドライン」の「IV.ソフトウエア製品に係る脆弱性関連\n情報取扱」の記載に準じて取り扱います。 \n \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n更新日：yyyy 年 mm 月 dd 日（連絡期限追記）  \n \n \n\n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n42 \n \n【対象が個人、コミュニティの場合】   \nXXXXX の製品開発者に関する情報 \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または製品開発者との連絡方法をご存じの方は下記の宛先までご\n連絡をお願いします。また、同製品の派生・関連製品のコミュニティに所属\nする製品開発者の方で、修正版の提供が可能な方からのご連絡もお待ちして\nいます。 \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n \n【対象が個人、コミュニティの場合（連絡期限追記）】 \nXXXXX の製品開発者に関する情報 \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または製品開発者との連絡方法をご存じの方は下記の宛先までご\n連絡をお願いします。また、同製品の派生・関連製品のコミュニティに所属\nする製品開発者の方で、修正版の提供が可能な方からのご連絡もお待ちして\nいます。  \n本件に関するご連絡は、yyyy 年 mm 月 dd 日まで受け付けます。 \n \nなお、yyyy 年 mm 月 dd 日までにご連絡をいただけなかった場合は、製品開発\n者と連絡が取れないため連絡不能と判断し、「情報セキュリティ早期警戒パ\nートナーシップガイドライン」の「IV.ソフトウエア製品に係る脆弱性関連\n情報取扱」の記載に準じて取り扱います。 \n \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n更新日：yyyy 年 mm 月 dd 日（連絡期限追記）  \n \n \n\n付録６  国際標準に準拠するための留意点 \n \n43 \n \n付録６  ソフトウエア製品の脆弱性の取扱いに関する国際標準への対応 \n \n1.  ソフトウエア製品の脆弱性の取扱いに関する国際標準とベンダ \nソフトウエア製品の脆弱性の取扱いに関する国際標準として、ISO/IEC \n29147:2014 (vulnerability disclosure)、ISO/IEC 30111:2013 \n(vulnerability handling processes)が規格化されました。 \n今後、我が国のベンダがグローバルな事業展開を図る場合には、これらの国\n際標準に対応する必要性が高まります。例えば、海外の調達案件等において、\n顧客側から脆弱性対応に関する取組みについて説明を要求された場合、ベンダ\nとして国際標準に対応した体制・取組みを行っていることを説明することで、\n円滑な理解が得られると考えられます。 \nまた、自身の脆弱性の公開ポリシーを公表することで、発見者の協力を得る\n効果も期待できます。 \n \n2.  国際標準の概要 \nISO/IEC 29147:2014 はソフトウエア製品に係る事業者（製品開発者、オンラ\nインサービス事業者（4.(1)を参照）、中間ベンダ（4.(4)を参照）等を指す。\n以下、「ベンダ」という。）の脆弱性に関する社外とのやりとり（外部からの脆\n弱性に関する情報の受領、ユーザに対する脆弱性対策のアドバイザリ配布等）\nを規定しています。一方、ISO/IEC 30111:2013 はベンダの社内での脆弱性取扱\nいのプロセス（脆弱性の検証、脆弱性対策の開発等）の指針を提供します。 \n  これらの関係を次の図に示します。 \n\n付録６  国際標準に準拠するための留意点 \n \n44 \n \n \n図 1  ISO/IEC 29147 と ISO/IEC 30111 の対応 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n3. 情報セキュリティ早期警戒パートナーシップと国際標準の関係 \nこれらの国際標準は、情報セキュリティ早期警戒パートナーシップの取組み\nと比較して、大きな矛盾や不整合はありません。したがって、情報セキュリテ\nィ早期警戒パートナーシップガイドライン（以下、「P ガイドライン」という）\nに沿って脆弱性を取り扱っているベンダが国際標準に対応することも可能で\nす。 \nただし、ISO/IEC 29147:2014 への対応については、細かいレベルで留意すべ\nき事項が指摘されています。そこで、本資料では、P ガイドラインに対応して\nいるベンダが ISO/IEC 29147:2014 にも対応しようとする場合に留意すべき事\n項について補足します。 \n\n付録６  国際標準に準拠するための留意点 \n \n45 \n \n \n \n4.ISO/IEC 29147:2014 について留意すべき事項 \nP ガイドラインに対応しているベンダが ISO/IEC 29147:2014 にも対応しよう\nとする場合に留意すべき事項についてまとめると、次のようになります。 \n留意すべき事項              ISO/IEC 29147 対応に取り組む場合の留意点 \n全体  グローバルな事業展開を図るベンダにおいては、脆弱性取扱いにつ\nいて国際標準に対応していることを顧客に説明する必要性が高まっ\nていることがヒアリング調査から裏付けられた。 \nオンラインサー\nビス \n 脆弱性対策を適用したことについて、文書化し記録として残す。 \n クラウド事業者の場合、顧客の利用環境への影響を考慮し、ソフト\nウエアの更新については事前に周知することが重要。 \n脆弱性公開ポリ\nシー \n 脆弱性公開ポリシーを策定し、その一部を公開する。 \n 脆弱性公開ポリシーには、ベンダへの連絡方法、セキュアな通信オ\nプション、予想されるやり取りの説明、脆弱性と思われる届出を行\nう際に役立つ可能性がある情報、範囲外のサービス、届出をどうや\nって追跡するかを含める。 \n 脆弱性公開ポリシーの一部を公開することにより、発見者から直接\n脆弱性が届け出られる可能性も高まる。 \n 届け出られた脆弱性が他のベンダの供給する部品に内包されている\nケースも考えられるため、そうした場合の対応についてもあらかじ\nめ検討しておく。 \n脆弱性の受領  脆弱性公開ポリシーに則り、発見者や調整機関から脆弱性の届出を\n受け付ける対外的な窓口を用意する。 \n その上で、脆弱性の届出を受信した際には、受信した旨を 7 日以内\nに返信する。 \n お盆、正月等の長期休暇の際は、7 日以内に対応するのが難しい可能\n性がある。 \n中間ベンダ  ベンダは、中間ベンダに求められる対応（脆弱性の問題の切り分け、\n他のベンダとの調整を行うこと、発見者・調整機関に調整状況と今\n後の進め方について説明すること）に取り組む。 \n 中間ベンダとして他のベンダの商材を扱う場合、それらに自社の脆\n弱性対応基準を適用するのは難しく、実際には対応を要請するに留\nまることが多い。 \n クラウド事業者によっては、パートナー向けに審査基準を公開し、\nそれに準拠するよう要請しているケースもある。 \n\n付録６  国際標準に準拠するための留意点 \n \n46 \n \n \n以下に、これらの詳細について説明します。 \n(1) オンラインサービス \nISO/IEC 29147:2014 における「オンラインサービス」についての記載を引用\nします。 \n章・節 内容 \n3 Terms and \ndefinitions  \n3 用語と定義 \n3.4 online services \nservice which is implemented by hardware, software, or a \ncombination of them and provided over a communication line or \nnetwork \nNote 1 to entry: The vendor of an online service may also be \nreferred to as a service provider. Online services are similar \nto products in that both are primarily software systems. Two \nmain distinctions are that a service often appears to users as \na single instance of software and that users do not install, \nmanage, or deploy the software, but they only use the service. \n3.4 オンラインサービス \nハードウエア、ソフトウエアまたはその組み合わせによって実装さ\nれ、通信回線またはネットワーク経由で提供されるサービス \n注記 1  オンラインサービスのベンダは、サービスプロバイダと呼ば\nれることもある。オンラインサービスと製品は、両者とも主にソフト\nウエアシステムであるという点で似ている。両者の主な違いは、サー\nビスはユーザにとって 1 つのソフトウエアのように見えるという点\nと、ユーザはソフトウエアのインストール、管理または展開を行わ\nず、サービスを利用するだけという点である。 \n5.5 \nVulnerability \ndisclosure \nprocess \nsummary \n5.5 脆弱性公\n開プロセスの\n要約 \n5.5.4 Release phase \nThe vendor deploys the remediation. In an online service, the \nvendor deploys the remediation and documents the event. \n5.5.4 公開フェーズ \nベンダは対策を展開する。オンラインサービスの場合、ベンダは対策\nを展開し、その事象について文書化して記録として残す\n12\n。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n表中 3.4 節の定義から、オンラインサービスの事業者には、クラウド事業\n者、EC モール事業者、ウェブサイト運営者等が含まれます。オンラインサービ\nスの場合、P ガイドライン上は対策の適用以上の取組みを求めていません\n13\n。し\nかし、オンラインサービス事業者が何らかの理由で ISO/IEC 29147:2014 対応\nに取り組む場合、脆弱性対策を適用したことについて、文書化し記録として残\n \n12\n 必ずしも「公表」を意味しているわけではない。 \n13\n 個人情報漏えい等の事案が起きた可能性がある場合は、二次被害を防止するため、公表\nを要請している。 \n\n付録６  国際標準に準拠するための留意点 \n \n47 \n \nすことが望まれます。さらにクラウド事業者の場合、顧客の利用環境への影響\nを考慮し、ソフトウエアの更新については事前に周知することが重要です。 \n \n(2) 脆弱性公開ポリシー \nISO/IEC 29147:2014 における「脆弱性公開ポリシー」についての記載を引用\nします。 \n章・節 内容 \n6 Vulnerability \ndisclosure \npolicy \nconsiderations \n6 脆弱性公開ポ\nリシーに関する\n考察 \n \n6.1 General \nVendors should define their responsibilities in the \nvulnerability disclosure policy. Vendors should publicize \ntheir vulnerability disclosure policy or point to an existing \npublic vulnerability disclosure policy.  \n6.1 概要 \nベンダは、脆弱性公開ポリシーにおける責任を定義する必要があ\nる。ベンダは、自身の脆弱性公開ポリシーを公表する、もしくは、\n既存の一般的な脆弱性公開ポリシーを示す必要がある。 \n6.2 Minimum policy aspects  \nA vendor should create an overall vulnerability disclosure \npolicy, but they may choose to publicize only select sections \nif the internal policy contains sensitive information. A \nvulnerability disclosure policy should, at least, include \ninformation about the following. \na) How the vendor would like to be contacted \nVendors who adopt a policy of vulnerability disclosure will \ntypically offer a security website or page. This website/page \nprovides information on the vendor’s accepted method(s) for \nreceiving vulnerability information from a finder. \nContact information might include one or more of the \nfollowing: \n1) E-mail address;(例示は省略) \n2) Phone number; \n3) Web form. \n(以下タイトルのみ抜粋) \nb) Secure communication options \nc) Setting communication expectations \nd) Information that would be useful when submitting a \npossible vulnerability report \ne) Out-of-scope services \nf) How submitted reports are tracked \n\n付録６  国際標準に準拠するための留意点 \n \n48 \n \n6.2 最小限の要素 \nベンダは脆弱性公開ポリシーを策定するが、ポリシーが機微な情報\nを含むこともあるため、公開するのはその一部だけとしてもよい。\n脆弱性公開ポリシーは、少なくとも以下の情報を含める： \na）どのようにベンダに連絡して欲しいか \n脆弱性公開ポリシーを採用するベンダは、一般的にセキュリティの\nウェブサイトやページを提供する。このウェブサイト/ページは発見\n者から脆弱性情報を受信するためにベンダが認めた方法（複数可）\nに関する情報を提供する。問合せ先は、次の一項目以上含めること\nが望ましい： \n  1) 電子メールアドレス \n  2) 電話番号 \n  3) ウェブフォーム \nb）セキュアな通信オプション \nc）予想されるやり取りの説明 \nd）脆弱性と思われる届出を行う際に役立つ可能性がある情報 \ne）範囲外のサービス \nf）届出をどうやって追跡するか \n6.3 Optional policy aspects \nA vulnerability disclosure policy may contain multiple \noptional elements. \na) Credit to finder \nb) Synchronized public disclosure \nc) Distribution \n6.3 オプショナルなポリシーの要素 \n脆弱性公開ポリシーには、複数のオプション情報を含めてもよい。 \n  a）発見者の功績 \n  b）一般公開の同期 \n  c）配布 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \nP ガイドラインでは、ベンダに脆弱性公開ポリシーの策定を求めていません\nが、ISO/IEC 29147:2014 では、脆弱性公開ポリシーを策定することや、その一\n部を公開することを求めています。 \nしたがって、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む\n場合、 \n・脆弱性公開ポリシーを策定し、その一部\n14\nを公開すること \n・脆弱性公開ポリシーには、ベンダへの連絡方法、セキュアな通信オプショ\nン、予想されるやり取りの説明、脆弱性と思われる届出を行う際に役立つ\n可能性がある情報、範囲外のサービス、届出をどうやって追跡するかを含\n \n14\n どこまで公開すべきか判断が難しい可能性もあるため、先行事例を巻末に添付する。 \n\n付録６  国際標準に準拠するための留意点 \n \n49 \n \nめること \nが望まれます。中でもベンダへの連絡方法は公開する必要があるでしょう。ま\nた、脆弱性公開ポリシーの一部を公開することにより、発見者から直接脆弱性\nが届け出られる可能性も高まります。 \nさらに、届け出られた脆弱性が他のベンダの供給する部品に内包されている\nケースも考えられるため、そうした場合の対応についてもあらかじめ検討して\nおくべきでしょう。 \n \n(3) 脆弱性の受領 \nISO/IEC 29147:2014 における「脆弱性の受領」についての記載を引用しま\nす。 \n章・節 内容 \n7 Receipt of \nvulnerability \ninformation \n7 脆弱性情報\nの受領 \n \n7.3 Acknowledgement of receipt from finder or a coordinator  \nThe vendor should respond to a vulnerability report within the \ntime period specified in the vendor’s vulnerability \ndisclosure policy. It is recommended that an acknowledgement \nof receipt of a vulnerability report be provided to a finder \nwithin seven calendar days.  \n7.3 発見者や調整機関からの受領の確認 \nベンダは、自身の脆弱性公開ポリシーの中で規定した期間以内に、脆\n弱性の届出に対処する。脆弱性届出を受領した旨の連絡は、発見者に\n対し暦で 7 日以内に行うことが推奨される。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \nISO/IEC 29147:2014 の「受領」は、その内容には言及せず、単に受信した旨\nを返信する作業を指しています。例えば、IPA では、受信した旨を発見者に返\n信する「受信連絡」という作業がありますが、これが該当します。このような\n作業はできるだけ迅速に行うことが望まれます。 \nしたがって、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む\n場合、まず、脆弱性公開ポリシーに則り、発見者や調整機関から脆弱性の届出\nを受け付ける対外的な窓口を用意すること、その上で、脆弱性の届出を受信し\nた際には、受信した旨を 7 日以内に返信することが必要となります。 \nなお、お盆、正月等の長期休暇の際は、対応が難しい可能性があるので、留\n意が必要です。 \n \n(4) 中間ベンダ \nISO/IEC 29147:2014 における「中間ベンダ」についての記載を引用します。 \n章・節 内容 \n\n付録６  国際標準に準拠するための留意点 \n \n50 \n \n5.4 \nStakeholders \n5.4 利害関係\n者  \n5.4.3 Intermediate Vendor \nAn intermediate vendor gets a subsystem from a vendor and uses \nit to supply a system or service (or a combination of both) to \na user (or another intermediate vendor). Typical examples are \nthe following: \na) system houses that use a PC and an operating system to add \ntheir own healthcare administration software and sell the \ncombined system to a medical doctor (maybe together with a \nmaintenance contract); \nb) telecommunication providers that supply a mobile phone \ntogether with a service contract.  \n5.4.3 中間ベンダ \n中間ベンダは、ベンダからサブシステムを入手し、それを使ってシス\nテムまたはサービス（または両方の組み合わせ）をユーザ（または他\nの中間ベンダ）に提供する。典型的な例では次のようなものがある： \n1）PC や OS と自社のヘルスケア管理ソフトウエアを合わせ、統合した\nシステムを医師に販売する（保守契約も一緒に提供することも）シス\nテムハウス; \n2）携帯電話本体とサービス契約を合わせて提供する通信事業者。 \n7 Receipt of \nvulnerability \ninformation \n7 脆弱性情報\nの受領 \n7.5 On-going communication with finder \nVendors should evaluate the reported issue and make a \ndetermination whether it represents a vulnerability or not. \nThe vendor should inform the finder and coordinator, if \ninvolved, on the results. \nAn intermediate vendor should check whether it can decide on \nthe potential vulnerability on its own or needs to involve the \nvendor it got the related subsystem from. If another vendor \nneeds to be involved in the decision and if this delays the \nresponse, the intermediate vendor should inform the finder \nand/or the coordinator about this fact and about the further \nprocessing. \n7.5  発見者との進行中のやり取り \nベンダは届出を受けた問題を評価し、脆弱性かそうでないかを判断し\nなければならない。ベンダは、結果について発見者に（もし調整機関\nが関与していれば調整機関にも）知らせる。 \n中間ベンダは、潜在的な脆弱性に関して自身で判断できるか、関連す\nるサブシステムを購入したベンダを巻き込む必要があるか、確認しな\nければならない。他のベンダの関与を必要とし、そのために回答が遅\nれる場合、中間ベンダは発見者および／または調整機関にその事実と\n今後の進め方について知らせる。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n中間ベンダとは、ユーザと対策を策定するベンダの間に介在するベンダであ\nり、SIer やリセラーが該当する場合も、組み込みベンダが該当する場合もあり\nます。例えば、自社が提供するプラットフォーム上で別のパートナーがサービ\nスを行っているケースも該当すると考えられます。大半のベンダに中間ベンダ\nとなる可能性があるため、中間ベンダへの要請は、実質的にはベンダ全体への\n\n付録６  国際標準に準拠するための留意点 \n \n51 \n \n要請と考えることができます。ユーザや発見者から見えるのは中間ベンダなの\nで、それらが対応すべき取組みを明確にすることは有益といえます。 \nP ガイドラインでは、「中間ベンダ」を定義しておらず、中間ベンダに求めら\nれる対応についても明示していません。 \nしかし、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む場合\nには、ベンダは、中間ベンダに求められる対応（脆弱性の問題の切り分け、他\nのベンダとの調整を行うこと、発見者・調整機関に調整状況と今後の進め方に\nついて説明すること）に取り組むことが望まれます。 \nただし、中間ベンダとして他のベンダの商材を扱う場合、それらに自社の脆\n弱性対応基準を適用するのは難しく、実際には対応を要請するに留まることが\n多いと考えられます。それでも、クラウド事業者によっては、パートナー向け\nに審査基準を公開し、それに準拠するよう要請しているケースもあります。 \n \n\n付録６  国際標準に準拠するための留意点 \n \n52 \n \n参考 1 ISO/IEC 29147:2014 と情報セキュリティ早期警戒パートナーシップガ\nイドラインの対応 \nISO/IEC 29147:2014 の構成 \n情報セキュリティ早期警戒パートナーシッ\nプガイドラインの対応箇所 \n1.適用範囲 III. 本ガイドラインの適用の範囲 \n2.引用規格 － \n3.用語および定義 II. 用語の定義と前提 \n4.略語 － \n5.概念 \n5.1  一般 \n5.2  ISO/IEC 29147: 脆弱性の公開と\nISO/IEC 30111: 脆弱性取扱プロセスの間\nのインタフェース \n5.3  製品とオンラインサービス \n5.4  ステークホルダー \n5.5  脆弱性公開プロセスの概要 \n5.6  脆弱性公開時における情報交換 \n5.7  交換情報の機密性 \n5.8  脆弱性アドバイザリ \n5.9  脆弱性の悪用 \nI. はじめに \n○本ガイドラインの目的 \n○ 本ガイドラインの想定する読者 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n1. 概要 \n6.脆弱性公開ポリシーにおける考慮事項 \n6.1 全般 \n6.2 最小限のポリシーの要素 \n6.3 オプショナルなポリシーの要素 \n－ \n7.脆弱性情報の受理 \n7.1 全般 \n7.2 潜在的な脆弱性報告およびその安全な\n受信モデル \n7.3 発見者または調整機関からの受理確認 \n7.4 入ってくる報告の追跡 \n7.5 発見者との進行中の通信 \n7.6 詳細情報 \n7.7 調整機関からの支援 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n5. 製品開発者の対応 \n1) 窓口の設置 \n2) 脆弱性検証の実施 \n3) 脆弱性情報の公表日の調整 \n4) 発見者との直接の情報交換 \n5) 関連ウェブサイトに関する情報の取扱\nい \n6) 問い合わせへの対応 \n7) 対策方法および対応状況の連絡 \n \n\n付録６  国際標準に準拠するための留意点 \n \n53 \n \n8.ベンダ間における脆弱性の報告 \n8.1 全般 \n8.2 ベンダ間の脆弱性報告を求める典型的\nなケース \n8.3 他ベンダに対する脆弱性情報の報告 \n－ \n9.アドバイザリの配布 \n9.1 全般 \n9.2 アドバイザリの目的 \n9.3 アドバイザリの公開における配慮 \n9.4 アドバイザリのリリースのタイミング \n9.5 アドバイザリの内容 \n9.6 アドバイザリの通信 \n9.7 アドバイザリのフォーマット \n9.8 アドバイザリの真正性 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n5. 製品開発者の対応 \n 8)対策方法の周知 \n 9)製品開発者内の情報の管理と開示 \n付録 A.（補足情報）脆弱性／アドバイザ\nリ情報の取扱いに関する詳細 \n付録 B.（補足情報）ポリシー、アドバイ\nザリ、国際的な調整機関の事例 \n文献目録 \n－ \n \n\n付録６  国際標準に準拠するための留意点 \n \n54 \n \n参考 2 脆弱性公開ポリシーの事例 \n脆弱性公開ポリシーは、ISO/IEC 29147:2014 の Annex B の”B.1 Sample \nvulnerability disclosure policy”に例示されているが、既に国内外のベン\nダから開示されている事例も見られる。以下にそれらの参考例を示す。 \n \n■Cisco; “Security Vulnerability Policy” \nhttps://tools.cisco.com/security/center/resources/security_vulnerabili\nty_policy.html \n \n■IBM; “Report Security Vulnerabilities” \nhttps://www.ibm.com/security/secure-engineering/report.html \n \n■Microsoft; “Coordinated Vulnerability Disclosure” \nhttps://www.microsoft.com/en-us/msrc/cvd \n \n■Salesforce.com; \n「セールスフォース・ドットコムの脆弱性報告ポリシー」 \nhttps://www.salesforce.com/jp/company/disclosure/ \n「Force.com ISV セキュリティレビュー」 \nhttps://developer.salesforce.com/page/JP:Security_Review \n \n■サイボウズ; 「脆弱性情報ハンドリングポリシー」 \nhttps://cybozu.co.jp/company/security-policy/ \n \n■日立製作所; 「日立グループにおける製品脆弱性情報の開示プロセス」 \nhttp://www.hitachi.co.jp/hirt/publications/hirt-pub10008/index.html \n \n■GMO ペパボ; 「脆弱性報告制度」 \nhttp://pepabo.com/contact/vulnerability_reporting/ \n \n \n\n付録７  本ガイドラインの別冊・関連資料一覧 \n \n55 \n \n付録７  本ガイドラインの別冊・関連資料一覧 \n【別冊】 \n「ソフトウエア製品開発者による脆弱性対策情報の公表マニュアル」\n15\n  \n利用者に脆弱性関連情報が的確に届けられることを目標として、ソフトウエ\nア製品開発者向けに、脆弱性対策情報の望ましい公表の手順について方針を\n示す資料です。 \n \n「ウェブサイト運営者のための脆弱性対応ガイド」\n15\n \nウェブサイト運営者向けに、ウェブサイトの脆弱性対策の必要性や脆弱性対\n応の手順を紹介する資料です。 \n \n「ウェブサイト構築事業者のための脆弱性対応ガイド」 \n15\n \nウェブサイトの構築に係る方向けに、納入前と納入後に分けてウェブサイト\nの脆弱性対策のポイントを紹介する資料です。 \n \n「セキュリティ担当者のための脆弱性対応ガイド」\n15\n \n企業等において情報システムのセキュリティ管理を担当する方向けに、脆弱\n性対策の基本的な考え方を紹介する資料です。 \n \n「制御システム利用者のための脆弱性対応ガイド」第３版\n15\n \n工場やプラントにおける制御システムの導入・運用を行う企業の経営層・管\n理者の方向けに、セキュリティ対策や脆弱性対応を紹介する資料です。 \n \n【関連資料】 \n「平成二十九年経済産業省告示第十九号 ソフトウエア製品等の脆弱性関連情\n報に関する取扱規程」\n16\n \n旧告示「ソフトウエア等脆弱性関連情報取扱基準」が廃止となり、新たに定\nめられた告示です。 \n \n「情報セキュリティ早期警戒パートナーシップの紹介 \n- 脆弱性取扱プロセスの要点解説 -」\n15\n \n情報セキュリティ早期警戒パートナーシップガイドラインの概要版として\n作成した資料です。 \n \n15\n https://www.ipa.go.jp/security/vuln/index.html \n16\n https://www.meti.go.jp/policy/netsecurity/vul_notification.pdf \n\n付録７  本ガイドラインの別冊・関連資料一覧 \n \n56 \n \n \n「Information Security Early Warning Partnership  \n- Overview of Vulnerability Handling Process -」\n15\n \n情報セキュリティ早期警戒パートナーシップガイドラインの概要版を英訳\nした資料です。 \n \n「JPCERT/CC 脆弱性関連情報取扱いガイドライン」\n17\n \n経済産業省告示「ソフトウエア製品等の脆弱性関連情報に関する取扱規程」\nおよび IPA  と JPCERT/CC による「情報セキュリティ早期警戒パートナーシ\nップガイドライン」に対応して、製品開発者の方々に、脆弱性関連情報の取\n扱いに関する事項をお知らせすることを目的として作成された資料です。 \n \n「製品開発ベンダーにおける脆弱性関連情報取扱に関する体制と手順整備のた\nめのガイドライン」\n18\n \nシステムベンダを中心とする製品開発者が、発見者や調整機関から入手した\n脆弱性関連情報を社内的にどのように取り扱い、対応すべきか、必要な体制\nと手順を整備するために、JEITA および JISA がとりまとめた資料です。 \n \n「SI 事業者における脆弱性関連情報取扱に関する体制と手順整備のためのガイ\nダンス」\n19\n \nSI 事業者が、脆弱性情報が公表された後、製品開発ベンダや顧客と連携し、\n迅速かつ適切な対応をとるために必要な社内体制や対応手順を整備するた\nめに、JISA および JEITA がとりまとめた資料です。 \n \n「製品開発ベンダーにおける脆弱性関連情報取扱に関する体制と手順整備のた\nめのガイドライン」\n20\n \nPC ソフトウエアを中心とする製品開発者が、発見者や調整機関から入手し\nた脆弱性関連情報を社内的にどのように取り扱い、対応すべきか、必要な体 \n制と手順を整備するために、JPSA（現 SAJ）がとりまとめた資料です。 \n \n17\n https://www.jpcert.or.jp/vh/vul-guideline2014.pdf \n18\n http://it.jeita.or.jp/infosys/info/0407JEITA-guideline/guideline-v10.pdf \n19\n https://www.ipa.go.jp/files/000002992.pdf \n20\n https://www.saj.or.jp/activity/advocacy/20041203_security.pdf \n \n\n \n57 \n \n・脆弱性関連情報流通の基本枠組み \n  独立行政法人情報処理推進機構（IPA）では、経済産業省告示を踏まえ、2004年7月からソフトウエア製品\nおよびウェブアプリケーションの脆弱性に関する届出を受け付けています。 \n  https://www.ipa.go.jp/security/vuln/report/index.html \n（参考） \n「ソフトウエア製品等の脆弱性関連情報に関する取扱規程」（平成29年経済産業省告示第19号） \n「受付機関及び調整機関を定める告示」（平成31年経済産業省告示第19号） \n「情報セキュリティ早期警戒パートナーシップ」 \n \n・本資料のダウンロード先 \n  本資料の配布に制限はありません。本資料は、次のURLからダウンロードできます。 \n   https://www.ipa.go.jp/security/ciadr/partnership_guide.html \n   https://www.jpcert.or.jp/vh/#link_japan \n・本資料に関するお問合わせ先 \n  独立行政法人情報処理推進機構（略称：IPA）  セキュリティセンター \n   〒113-6591  東京都文京区本駒込二丁目28番8号 文京グリーンコートセンターオフィス16階 \n   https://www.ipa.go.jp/security/ TEL: 03-5978-7527  FAX: 03-5978-7552 \n  一般社団法人JPCERTコーディネーションセンター（略称：JPCERT/CC） \n   〒103-0023  東京都中央区日本橋本町4-4-2  東山ビルディング8階 \n   https://www.jpcert.or.jp/  TEL: 03-6271-8901  FAX 03-6271-8908 \n情報セキュリティ早期警戒パートナーシップガイドライン \n２００４ 年 ７ 月 ８ 日 制定第１版発行    ２０１４ 年 ５ 月３０日 改訂第８版発行 \n２００５ 年 ７ 月 ８ 日 改訂第２版発行    ２０１５ 年 ５ 月２２日 改訂第９版発行 \n２００６ 年 ９ 月 １ 日 改訂第３版発行    ２０１６ 年 ５ 月３０日 改訂第１０版発行 \n２００７ 年 ６ 月１１日 改訂第４版発行    ２０１７ 年 ５ 月３０日 改訂第１１版発行 \n２００８ 年 ４ 月 ４ 日 改訂第５版発行    ２０１９ 年 ５ 月３０日 改訂第１２版発行 \n２００９ 年 ７ 月 ８ 日 改訂第６版発行    ２０２２ 年 ５ 月３１日 改訂第１２版第２刷発行 \n２０１１ 年 ３ 月２８日 改訂第７版発行       \n       \n [著作・制作]    情報システム等の脆弱性情報の取扱いに関する研究会 \n[事務局・発行]  独立行政法人情報処理推進機構 ",
    "metadata": {
      "info": {
        "PDFFormatVersion": "1.6",
        "IsAcroFormPresent": false,
        "IsXFAPresent": false,
        "Title": "情報セキュリティ早期警戒パートナーシップガイドライン2019年版第2刷",
        "Author": "IPA,JPCERT/CC",
        "Creator": "PScript5.dll Version 5.2.2",
        "Producer": "Acrobat Distiller 20.0 (Windows)",
        "CreationDate": "D:20220531135633+09'00'",
        "ModDate": "D:20220531135937+09'00'"
      },
      "metadata": {
        "_metadata": {
          "dc:format": "application/pdf",
          "dc:title": "情報セキュリティ早期警戒パートナーシップガイドライン2019年版第2刷",
          "dc:creator": "IPA,JPCERT/CC",
          "xmp:createdate": "2022-05-31T13:56:33+09:00",
          "xmp:creatortool": "PScript5.dll Version 5.2.2",
          "xmp:modifydate": "2022-05-31T13:59:37+09:00",
          "xmp:metadatadate": "2022-05-31T13:59:37+09:00",
          "pdf:producer": "Acrobat Distiller 20.0 (Windows)",
          "xmpmm:documentid": "uuid:810a3ba4-9680-4f5b-9a08-f426d8978db5",
          "xmpmm:instanceid": "uuid:712f36b6-9d0b-4272-aaf9-e3bc2cc5d503"
        }
      },
      "version": "1.10.100"
    },
    "pages": [
      {
        "page_num": 1,
        "text": "独立行政法人情報処理推進機構\n一般社団法人JPCERTコーディネーションセンター\n一般社団法人電子情報技術産業協会\n一般社団法人ソフトウェア協会\n一般社団法人情報サービス産業協会\n特定非営利活動法人日本ネットワークセキュリティ協会\n2022年5月 \n               \n情報セキュリティ早期警戒 \nパートナーシップガイドライン"
      },
      {
        "page_num": 2,
        "text": "目    次 \n \nI．はじめに .................................................................. 1 \nII．用語の定義と前提 .......................................................... 3 \nIII．本ガイドラインの適用の範囲 ................................................ 6 \nIV．ソフトウエア製品に係る脆弱性関連情報取扱 .................................. 7 \n１．概要 .................................................................... 7 \n２．発見者の対応 ............................................................ 8 \n３．IPA（受付機関）の対応 ................................................... 10 \n４．JPCERT/CC（調整機関）の対応 ............................................. 15 \n５．製品開発者の対応 ........................................................ 19 \n６．その他 ................................................................. 22 \nV．ウェブアプリケーションに係る脆弱性関連情報取扱 ........................... 23 \n１．概要 ................................................................... 23 \n２．発見者の対応 ........................................................... 24 \n３．IPA（受付機関）の対応 ................................................... 25 \n４．ウェブサイト運営者の対応 ................................................ 28 \n付録１  用語の解説 ........................................................... 30 \n付録２  脆弱性情報取扱いのフロー ............................................. 32 \n付録３  法的な論点について ................................................... 35 \n１  発見者が心得ておくべき法的な論点 ........................................ 35 \n２  製品開発者が心得ておくべき法的な論点 .................................... 37 \n３  ウェブサイト運営者が心得ておくべき法的な論点 ............................ 38 \n付録４  脆弱性の影響度に関する考え方について ................................. 39 \n付録５  ソフトウエア製品における連絡不能案件の取扱いについて ................. 40 \n１  連絡不能開発者一覧の公表 ................................................ 40 \n２  対象製品情報の公表と関係者へのお願い .................................... 41 \n付録６  ソフトウエアの脆弱性の取扱いに関する国際標準への対応 ................. 43 \n付録７  本ガイドラインの別冊・関連資料一覧 ................................... 55"
      },
      {
        "page_num": 3,
        "text": "I．はじめに"
      },
      {
        "page_num": 4,
        "text": "1 \nI．はじめに \n \n〇 本ガイドラインの目的 \n2000 年頃より、日本国内においてソフトウエアやウェブアプリケーションの脆\n弱性が発見されることが増えており、これらの脆弱性を悪用した不正アクセス行\n為やコンピュータウイルスの増加により、企業活動が停止したり情報資産が滅失\nしたり個人情報が漏えいしたりといった、重大な被害が生じています。そこで、脆\n弱性関連情報が発見された場合に、それらをどのように取り扱うべきかを示した、 \n経済産業省告示「ソフトウエア等脆弱性関連情報取扱基準」が 2004 年に制定され、\n2014 年の改正を経て、2017 年に新たに経済産業省告示「ソフトウエア製品等の脆\n弱性関連情報に関する取扱規程」になりました。 \n \n本ガイドラインは、上記告示を踏まえ、脆弱性関連情報の適切な流通により、コ\nンピュータ不正アクセス、コンピュータウイルス等による被害発生を抑制するた\nめに、関係者に推奨する行為をとりまとめたものです。さらに、本ガイドラインに\n基づく取組みがより効果的に社会貢献できるように、影響の大きい届出（脆弱性の\n深刻度の大きさや影響範囲の広さで判断、詳細は付録４を参照）を優先して取り扱\nうことや、発見者と製品開発者または、ウェブサイト運営者との調整において自律\n的な進展が困難な場合の打開を促すことにも取り組みます。 \n \n具体的には、独立行政法人情報処理推進機構（以下、「IPA」とする）が受付機関、\n一般社団法人 JPCERT コーディネーションセンター（以下、「JPCERT/CC」とする）\nが調整機関という役割を担い、発見者、製品開発者、ウェブサイト運営者と協力を\nしながら脆弱性関連情報に対処するための、その発見から公表に至るプロセスを\n詳述しています。 \n \n関係者の方々は、脆弱性関連情報の取扱いに際し、本ガイドラインを基本として\nご対応くださいますようお願い申し上げます。"
      },
      {
        "page_num": 5,
        "text": "〇 本ガイドラインの想定する読者 \n本ガイドラインの想定する読者と、その方に特に参照いただきたい箇所を以下\nに示します。 \n \n1) ソフトウエアやウェブアプリケーションに脆弱性を発見した方 \n脆弱性を発見された際は IPA への届出をご検討ください。ソフトウエアの脆弱\n性を発見された方はIV．２．を、ウェブアプリケーションの脆弱性を発見された方\nはＶ．２．をご参照ください。"
      },
      {
        "page_num": 6,
        "text": "I．はじめに"
      },
      {
        "page_num": 7,
        "text": "2 \n2) 自組織が扱うソフトウエア製品の脆弱性について連絡を受けた方 \nJPCERT/CC からソフトウエア製品の脆弱性について製品開発者に連絡する場合\nがあります。ソフトウエア製品の脆弱性関連情報の取扱いのプロセスはIV．に記し\nています。製品開発者による対応はIV．５．をご参照ください。 \n \n3) 自組織のウェブアプリケーションの脆弱性について連絡を受けた方 \nIPA からウェブアプリケーションの脆弱性についてウェブサイト運営者に連絡\nする場合があります。ウェブアプリケーションの脆弱性関連情報の取扱いのプロ\nセスはV．に記しています。ウェブサイト運営者による対応はV．４．をご参照く\nださい。 \n\nII．用語の定義と前提 \n \n3 \n \nII．用語の定義と前提 \n \n本ガイドラインに用いられる用語の定義は以下の通りです。 \n \n１．脆弱性 \n脆弱性とは、ソフトウエア製品やウェブアプリケーション等において、コンピュ\nータ不正アクセスやコンピュータウイルス等の攻撃により、その機能や性能を損\nなう原因となりうるセキュリティ上の問題箇所です。 \nなお、製品開発者の不適切な実装やウェブサイト運営者の不適切な運用によっ\nて、個人情報等が適切なアクセス制御の下に管理されておらずセキュリティが維\n持できなくなっている状態も含みます（ウェブサイトの不適切な運用に関しては\n付録１に例を示します）。 \n \n２．脆弱性関連情報の種類 \n脆弱性関連情報とは、脆弱性に関する情報であり、次のいずれかに該当するもの\nです。 \n1) 脆弱性情報 \n脆弱性の性質および特徴を示す情報のことです。 \n2) 検証方法 \n脆弱性が存在することを調べるための方法のことです。例えば、特定の入力パ\nターンにより脆弱性の有無を検証するツール等が該当します。 \n3) 攻撃方法 \n脆弱性を悪用するプログラムやコマンド、データおよびそれらの使い方のこと\nです。例えば、エクスプロイトコード（付録１を参照）や、コンピュータウイ\nルス等が該当します。 \n \n３．対策方法 \n対策方法とは、脆弱性から生じる問題を回避するまたは解決を図る方法のこと\nです。回避方法と修正方法から成ります。ただし、本ガイドラインで、「対策方法」\nとの記述がある場合、「回避方法または修正方法」の意味となります。 \n1) 回避方法 \n脆弱性が原因となって生じる被害を回避するための方法（修正方法は含まない）\nであり、ワークアラウンド（付録１を参照）と呼ばれます。 \n2) 修正方法 \n脆弱性そのものを修正する方法であり、パッチ（付録１を参照）等と呼ばれま\nす。 \n \n４．対応状況 \n対応状況とは、JPCERT/CC から脆弱性関連情報の通知を受けた製品開発者が報告\nする、脆弱性対応の取組みの状況等のことです。"
      },
      {
        "page_num": 8,
        "text": "II．用語の定義と前提 \n \n4 \n \n５．ソフトウエア製品 \nソフトウエア製品とは、ソフトウエア自体またはソフトウエアを組み込んだハ\nードウエア等の汎用性を有する製品のことです。技術情報の統括や開発保守を行\nっている者をコミュニティとしてしか特定できない、オープンソースソフトウエ\nアのようなものも含みます。具体例は、付録１を参照してください。 \n \n６．オープンソースソフトウエア（OSS） \nオープンソースソフトウエア（OSS）とは、ソースコードが公開されていて、誰\nでも無償で入手、利用することができ、さらに改良、再配布ができるライセンスを\nもつソフトウエアのことです。 \n \n７．ウェブアプリケーション \nウェブアプリケーションとは、インターネット上のウェブサイト等で稼動する\n固有のシステムのことです。 \n \n８．発見者 \n発見者とは、脆弱性関連情報を発見または取得した者のことです。例えば、ソフ\nトウエアの脆弱性を発見した人や、インターネット上で脆弱性関連情報を入手し\nた人等が当てはまります。ソフトウエアの脆弱性を発見した人のみを対象として\nいるわけではありません。 \n \n９．製品開発者 \n製品開発者とは、次のいずれかに該当する者のことです。 \n1) ソフトウエア製品（OSS を含む）を開発した官庁、法人、個人、またはコミ\nュニティ \n2) ソフトウエア製品（OSS を含む）の加工、輸入、販売または頒布する官庁、\n法人\n1\n、個人、またはコミュニティ"
      },
      {
        "page_num": 9,
        "text": "１０．脆弱性検証 \n脆弱性検証とは、受け取った脆弱性関連情報について、再現性、脆弱性に該当す\nることを検証することです。 \n \n１１．ウェブサイト運営者 \nウェブサイト運営者とは、ウェブアプリケーションを運営する主体のことです。\n当該ウェブアプリケーションが官庁、法人等の組織によって運営されているので\nあれば、その組織が該当します。個人によって運営されているのであれば、その個\n人が該当します。ウェブサイト運営者の例は、付録１を参照してください。 \n \n1\n 海外のソフトウエア製品の国内での主たる販売権を有する会社（外国企業の日本法人や総\n代理店等）を含みます。 \n\nII．用語の定義と前提 \n \n5"
      },
      {
        "page_num": 10,
        "text": "１２．製品利用者 \n製品利用者とは、ソフトウエア製品のライセンス許諾（明示的でないケースを含\nむ）を受けてソフトウエア製品を導入・管理する官庁、法人または個人のことです。\n一般に、ソフトウエア製品の脆弱性対策を適用する立場にあります。 \n \n１３．システム構築事業者 \nシステム構築事業者とは、ソフトウエア製品を入手し、それを使ってシステムを\n構築し、利用者に提供する法人または個人のことです。システムの構築サービスや\n保守、運用のサービスを通じて、顧客であるウェブサイト運営者の脆弱性対策を実\n施することもあります。"
      },
      {
        "page_num": 11,
        "text": "III．本ガイドラインの適用の範囲 \n \n6 \n \nIII．本ガイドラインの適用の範囲 \n \n本ガイドラインは、次のものに係る脆弱性であって、その脆弱性に起因する影響\nが不特定または多数の人々におよぶおそれのあるものに適用します。 \n \n○日本国内で利用されているソフトウエア製品 \n 「暗号アルゴリズム」や「プロトコル」を実装しているものも含みますが、\n一般的な「暗号アルゴリズム」や「プロトコル」等の仕様そのものの脆弱性\nは含みません（プロトコルの実装に係る脆弱性については付録１を参照）。 \n ソフトウエア製品に係る脆弱性関連情報の取扱いは、IV．で記述します。 \n \n○日本国内からのアクセスが実質的になされているウェブサイトで稼動するウ\nェブアプリケーション \n 例えば、主なコンテンツが日本語である、あるいは URL のホスト名の最上位\nドメインが「jp」であるウェブサイト等のことです。 \n ウェブアプリケーションに係る脆弱性関連情報の取扱いは、V．で記述しま\nす。 \n \nなお上記の分類が難しい場合には、修正作業が事業者側のみで済む場合をウェ\nブアプリケーション、製品利用者側の対応が必要な場合をソフトウエア製品とし\nて判断することを基本とします。"
      },
      {
        "page_num": 12,
        "text": "IV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n7 \n \nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n１．概要 \nソフトウエア製品に係る脆弱性関連情報取扱の概要は、図１の通りです。 \n \n図１  ソフトウエア製品に係る脆弱性関連情報取扱の概要 \n(ソフトウエア製品における脆弱性情報取扱いの全体フローは付録２を参照) \n \n1) 発見者は、IPA に脆弱性関連情報を届け出る \n2) IPA は、受け取った脆弱性関連情報を、原則として JPCERT/CC に通知する \n3) JPCERT/CC は、脆弱性関連情報に関係する製品開発者を特定し、製品開発者に\n脆弱性関連情報を通知する \n4) 製品開発者は、脆弱性検証を行い、その結果を JPCERT/CC に報告する \n5) JPCERT/CC と製品開発者は、対策方法の作成や海外の調整機関との調整に要す\nる期間、当該脆弱性情報流出に係るリスクを考慮しつつ、脆弱性情報の公表に\n関するスケジュールを調整し決定する \n6) 製品開発者は、脆弱性情報の公表日までに対策方法を作成するよう努める \n7) 製品開発者は、製品利用者に生じるリスクを低減できると判断した場合、\nJPCERT/CC と調整した上で、公表日以前に製品利用者に脆弱性検証の結果、対\n策方法および対応状況について通知することができる \n8) IPA および JPCERT/CC は、脆弱性情報と、3)にて JPCERT/CC から連絡したすべ\nての製品開発者の脆弱性検証の結果、対策方法および対応状況を公表する \n製品開発者\n発見者\nＩＰＡ\n1\n発見者は、IPAに脆弱性\n関連情報を届け出る\n2IPAは、JPCERT/CCに\n脆弱性関連情報を通知\nする\nJPCERT/CC\n製品開発者\n3\nJPCERT/CCは、\n製品開発者に脆弱\n性関連情報を連絡する\n4製品開発者は、\n脆弱性検証を行う\n6製品開発者は、\n対策方法を作成する\n8IPAとJPCERT/CCは、\n脆弱性情報、脆弱性検証の結果\nおよび対策状況を公表する\n※\n一般\n5\nJPCERT/CCは、製品開発者\nと調整を行う\n9IPAは四半期ごとに統計情報を公表する\n製品\n利用者\n7\n製品開発者は、\n製品利用者に生じるリスクを低減できると\n判断した場合、JPCERT/CCと調整した上で、\n公表日以前に製品利用者に脆弱性検証の\n結果及び対応状況について通知することが\nできる\n※製品開発者が自社製品のすべての製品利用者に\n脆弱性検証の結果や対応状況について連絡する\nことが確認できる場合には、公表と同等の周知を\n実施するものとみなす\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n8 \n \n9) IPA は統計情報を、原則、四半期ごとに公表する"
      },
      {
        "page_num": 13,
        "text": "２．発見者の対応 \n \n1) 発見者の範囲 \nIVにおける発見者とは、製品開発者以外の者（研究者等）のみを指しているわ\nけではありません。製品開発者自身であっても、自身のソフトウエア製品につい\nての脆弱性関連情報であって、脆弱性が外部のソフトウエア製品に含まれるこ\nとが推定されるものを発見・取得した場合、発見者としての対応が推奨されます。 \n \n2) 脆弱性関連情報の発見・取得 \n脆弱性関連情報の発見・取得に際しては、関連法令に触れることがないよう\nに留意してください。詳細は、付録３を参照してください。 \n \n3) 脆弱性関連情報の届出 \n発見者は、発見した脆弱性関連情報を IPA に届け出てください\n2\n。 \nただし、発見者から直接の届出を受け入れる旨を承諾している製品開発者\n3\nの\n場合、直接届け出ることも可能です。 \nその際、IPA と製品開発者の両方に届け出る場合には、関係者間の調整が混乱\nしないように、脆弱性の解消に向けた製品開発者との調整を自ら行うか、IPA に\n任せるかを届出の際に、明確にしてください。さらに、以降の調整を IPA に任せ\nる場合は、製品開発者へその旨を通知するとともに、その通知を行った旨を届出\nに明記してください。 \n \n4) 脆弱性関連情報の管理および開示 \n発見者は、脆弱性関連情報を正当な理由がない限り第三者に開示しないでく\nださい（発見者に対する情報非開示依頼、以下「情報非開示依頼」という）。た\nだし、正当な理由があって脆弱性関連情報を開示する必要がある場合には、事前\nに IPA に相談してください。脆弱性関連情報の管理および開示に係る法的な問\n題に関しては、付録３を参照してください。 \nなお、起算日\n4\nから 1 年以上経過した届出については、発見者は IPA に対し、\n情報非開示依頼の取り下げを求めることができます。 \nまた、情報非開示依頼の効力のある間は、脆弱性関連情報が第三者に漏えいし\n \n2\n 特に、複数の製品開発者の製品に影響する可能性がある脆弱性関連情報については、受け\n取れない製品開発者が出ないように、IPA へ届出を行うことが望まれます。 \n3\n IPA および JPCERT/CC が提供する脆弱性対策情報ポータルサイトJapan Vulnerability \nNotes（JVN）にある JPCERT/CC 製品開発者リストの中に掲載しています。 \n4\n 本ガイドラインのIV．４．2)において規定された連絡を最初に試みた日を起算日とします。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n9 \n \nないように適切に管理してください。 \n \n5) 届け出る情報の内容 \n発見者は、届け出る情報の中で以下の点を明示してください（詳細は、\nhttps://www.ipa.go.jp/security/vuln/ を参照）。 \n(ア) 氏名等の発見者を識別するための情報 \n(イ) 電子メールアドレス等の発見者の連絡先 \n(ウ) (ア)および(イ)の製品開発者への通知の可否 \n(エ) 製品開発者から直接連絡を受けることの可否 \n(オ) (ア)の公表の可否 \n(カ) 脆弱性関連情報に係るソフトウエア製品の名称 \n(キ) 脆弱性関連情報の内容（脆弱性関連情報を確認する環境、手順および\n結果） \n可能であれば、脆弱性が存在する証拠\n5\nを一緒に提出してください。\nただし、証拠の取得に際しては、関連法令に触れることがないように\n留意してください（付録３を参照）。 \n(ク) 個人情報の取扱方法（製品開発者への通知および直接の情報交換の可\n否、一般への公表の可否） \n 発見者が望まない場合、IPA は、JPCERT/CC および製品開発者に対し\nて、発見者を特定しうる情報を通知することはありません。 \n 発見者が望む場合、IPA および JPCERT/CC は、脆弱性情報と製品開\n発者ごとの脆弱性検証の結果、対策方法および対応状況を公表する\n際に発見者名を付記するとともに、製品開発者に対しても、対策方\n法の公表時に発見者名を付記することを推奨します。 \n(ケ) 他組織（製品開発者、他のセキュリティ関係機関等）への届出の状況 \n等 \n \n6) 製品開発者との直接の情報交換 \n発見者は、IPA に脆弱性関連情報を届け出た後、IPA および JPCERT/CC を介し、\n製品開発者の了解を得て、製品開発者と直接情報交換を行うことができます。 \n \n7) 届出後の対応 \n発見者は、届出後、IPA に進捗状況の問い合わせを行うことができます。IPA\nは、本ガイドラインの３．に則って処理を行い、発見者の問い合わせに対し、適\n切に情報の開示を行います。発見者は、開示された情報をみだりに第三者に開\n示しないでください。"
      },
      {
        "page_num": 14,
        "text": "5\n 具体的には、「検証コード」、「画面キャプチャ」、「ログ」等。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n10 \n \n３．IPA（受付機関）の対応 \n \n(1)脆弱性関連情報の届出受付と取扱いについて \n \n1) 脆弱性関連情報の受付 \nIPA の脆弱性関連情報の受付に関し、詳細は以下の URL をご参照ください。 \nhttps://www.ipa.go.jp/security/vuln/  \n届出は 24 時間受け付けますが、受け付けた情報について 2)以降の作業を行う\nのは原則営業日のみとなります。 \n \n2) 届出の受理 \nIPA は、届出の記載が以下の条件をすべて満たしていると判断した時、その時\n点で届出を受理し、発見者に連絡します。 \n(ア) 上記２．5)の項目がすべて記載されていること \n(イ) 届出内容に矛盾等が無いこと \n(ウ) 届出の対象が本ガイドラインの適用範囲に該当すること（III章を参照） \n(エ) 記載されている内容が脆弱性であること \n(オ) 既知の脆弱性とは異なる脆弱性の関連情報であること（JPCERT/CC、製\n品開発者等により公表された脆弱性の関連情報ではないこと） \nなお、IPA は、これらの条件により、届出の受理または不受理を判断し、その\n理由とともに発見者に連絡します。なお、発見者に届出の受理を連絡した日が\nIPA および JPCERT/CC が脆弱性関連情報の取扱いを開始した日（受理日）となり\nます。 \n \n3) 違法な手段で入手された脆弱性関連情報への対応 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な手\n段で入手された脆弱性関連情報であることが明白な場合、処理を取りやめるこ\nとがあります。 \n \n4) JPCERT/CC への連絡 \nIPA は、上記 2)、3)における対応の是非の判断の結果、対応することが妥当\nとの判断を下した脆弱性関連情報について、速やかに JPCERT/CC に通知しま\nす。なお、届け出された脆弱性による影響が大きい場合、受付の順序に関わら\nず、優先的に取扱いを行います（付録４を参照）。 \n \n5) 脆弱性関連情報の取扱い \nIPA は、脆弱性関連情報に関して、正当な理由がない限り発見者・JPCERT/CC・\n当該製品開発者以外の第三者に開示しません。ただし、以下のような正当な理由\nがある場合、IPA は第三者に情報を開示することがあります。なお、技術的分析\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n11 \n \nを依頼する場合、IPA は秘密保持契約を結びます。 \n(ア) 脆弱性を有するソフトウエア製品が、他のソフトウエアやウェブサイ\nトで利用されている場合に、それらの製品開発者やウェブサイト運営者\nに連絡する場合 \n(イ) 脆弱性が再現する状況を特定できない等の場合に、国立研究開発法人\n産業技術総合研究所や技術研究組合制御システムセキュリティセンタ\nー等の外部機関に脆弱性関連情報に関する技術的分析を依頼する場合 \nこの場合、関係者の許諾を得た上で、JPCERT/CC と連携し、脆弱性の\n再現に必要な情報を製品開発者に開示することがあります。 \nまた、IPA は、脆弱性関連情報に関して、それに関する脆弱性情報が一般に公\n表されるまでの間は、発見者・JPCERT/CC・当該製品開発者以外の第三者に漏え\nいしないように適切に管理します。 \n \n6) 発見者に係る情報の取扱い \nIPA は、氏名・連絡先を含む発見者に係る情報を、発見者が望む場合以外には、\nJPCERT/CC と製品開発者および第三者に漏えいしないよう適切に管理します。 \n \n7) 脆弱性関連情報の受理後の対応 \nIPA は、JPCERT/CC に通知した脆弱性関連情報に関して、以下のいずれかに該\n当する場合、発見者に連絡するとともに、処理を取りやめることがあります。 \n(ア) 脆弱性関連情報に該当しない場合 \n(イ) 本ガイドラインの適用範囲外である場合 \n(ウ) 脆弱性による影響が小さい場合（付録４を参照） \n(エ) 脆弱性関連情報が既知であり、かつ公表されている場合 \n(オ) 製品開発者がすべての製品利用者に通知する場合（システム構築事業\n者を介して通知するケースを含む） \n \n8) 発見者との情報交換 \nIPA は、届出を受理した後、発見者に問い合わせをすることがあります。また、\n発見者から問い合わせがあった場合、JPCERT/CC と相談の上、適切な情報の開示\nを行います。なお、発見者との情報交換に際しては、第三者に情報が漏えいしな\nいよう留意します。 \n \n9) 脆弱性関連情報の影響の分析 \nIPA は、JPCERT/CC と連携して、届け出られた脆弱性関連情報が他のソフトウ\nエアやシステムに及ぼす影響の分析を行うよう努めます。影響の分析結果につ\nいては、JPCERT/CC を介して、製品開発者に連絡します。 \n \n10) 対策方法および対応状況の共有 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n12 \n \nIPA は、JPCERT/CC を介して連絡した脆弱性関連情報に係る製品開発者の対策\n方法および対応状況を、JPCERT/CC と共有します。 \n \n11) 情報非開示依頼の取下げ \nIPA は、起算日から 1 年以上経過した届出について、発見者から情報非開示依\n頼の取下げが求められた場合、これを取り下げます。そのとき、製品開発者が正\n当な理由により対応に時間を要する場合、IPA はその状況を発見者に適切に説明\nし、発見者が情報開示の必要性を客観的に判断できるようにします。 \n \n12) 優先的な情報提供実施時の発見者への通知 \nIPA は、届出がなされた脆弱性関連情報に関して、JPCERT/CC から政府機関や\n国民の日常生活に必要不可欠なサービスを提供するための基盤となる設備を保\n有する事業者等に対して優先的に提供された場合、発見者に対して、その旨を通\n知します。当該基盤保有事業者は内閣サイバーセキュリティセンター（NISC）の\n最新の「重要インフラの情報セキュリティ対策に係る行動計画」\n6\nで定める重要\nインフラ事業者等とします。 \n \n13) 一般への情報の公表 \nIPA および JPCERT/CC は、JVN を通じて、一般に対し、脆弱性情報と JPCERT/CC\nから連絡したすべての製品開発者の脆弱性検証の結果、対策方法および対応状\n況を公表します。さらに、一旦公表した後、製品開発者から新たな対策方法と対\n応状況のいずれかまたは両方を受け取った場合、その都度更新します。 \nまた、IPA および JPCERT/CC は、JVN に関する問い合わせ先を明示し、主とし\nて OSS 等に関して、システム構築事業者や製品利用者の脆弱性対応を促すこと\nを目的として、問い合わせ対応を実施します。なお、問い合わせに関する内容に\nついては、必要に応じて JVN の公表情報に反映します。 \n一般への情報の公表に際しては、IPA は、発見者にその旨を通知します。 \n \n14) 統計情報の集計と公表 \nIPA は、脆弱性に係る実態を周知徹底し危機意識の向上を図り、その結果とし\nての被害の予防のために、受け付けた脆弱性関連情報を集計し、統計情報として\nインターネット上等で原則、四半期ごとに公表します。統計情報には、届出件数\nの時間的推移等が含まれます。"
      },
      {
        "page_num": 15,
        "text": "6\n NISC  重要インフラの情報セキュリティ対策に係る行動計画 \nhttps://www.nisc.go.jp/policy/materials/index.html"
      },
      {
        "page_num": 16,
        "text": "IV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n13 \n \n(2)調整不能案件の公表判定について \n \n1) 公表判定委員会の組織 \nIPA は、JPCERT/CC からIV.４．10)の通知を受けて、JPCERT/CC と製品開発者と\nの間で脆弱性情報の公表に係る調整が不可能であると判断した場合（以下「調整\n不能」という）、その案件が脆弱性情報を公表する条件を満たしているかを判定\nする「公表判定委員会」を組織します。 \n \n調整不能とは、具体的には以下のいずれかのケースに該当します。 \n(ア)IV．４．2)に示した連絡方法をすべて試みても製品開発者と 6 ヶ月以上\n連絡が取れない場合（以下、「連絡不能」という） \n(イ)製品開発者と JVN 公表に関する調整を行ったが合意に至ることが社会\n通念上困難になったと判断される場合 \n \nIPA は、公表判定委員会において、脆弱性情報を公表しない場合に製品利用者\n等が受けうる被害と、公表した場合に製品開発者、製品利用者等が被りうる不利\n益とのバランスに配慮するとともに、社会的影響も考慮し、不利益を被りうる関\n係者が意見を表明することも可能な、透明性・妥当性のある判定プロセスを整備\nします。 \nIPA は、中立性を考慮し、当該調整不能案件に利害関係がない有識者、法律や\nサイバーセキュリティの専門家、当該ソフトウエア製品分野の専門家を公表判定\n委員会の委員に指名します。公表判定委員会は、関係者に意見表明の機会を提供\nし、その意見を踏まえ、公表が適当か否かを判定します。 \n \n2) 判定に必要な情報の収集・整理 \nIPA は、JPCERT/CC から製品開発者の連絡先（メールアドレス等）、当該脆弱性\n関連情報並びに製品開発者による脆弱性検証の結果、対策方法および対応状況を\n聴取し、公表判定委員会の判定に必要な資料を作成します。 \n \n3) 調整不能案件に係る製品開発者への連絡 \n公表判定委員会は、調整不能案件の当事者である製品開発者に対し、当該脆弱\n性情報を公表すべきかどうか判定する旨を連絡します。 \n(ア)連絡内容 \n公表判定委員会が製品開発者に伝える内容は、当該脆弱性情報とその\n存在を判断した根拠、経緯、公表予定の文案、意見書の提出先と提出期\n限です。 \n(イ)連絡方法 \n公表判定委員会から製品開発者に対し、電子メール等の合理的手段を\nもって連絡を試みます。連絡は、プライバシーに十分に配慮します。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n14 \n \nまた、連絡不能案件の場合には、付録５の方法を実施したことをもっ\nて、通達努力を果たしたものとみなします。 \n \nなお、この製品開発者から、脆弱性検証の結果、対策方法および対応状況のい\nずれか一つ以上について新しい報告があった場合には、その内容に応じて、IPA\nは脆弱性関連情報に係る処理を JPCERT/CC に戻すことがあります。 \n4) 関係者からの意見聴取 \n公表判定委員会は、製品開発者をはじめとする関係者からの意見聴取を行いま\nす。意見聴取は、原則として書面による手続きで行います。また、公表判定委員\n会は、その裁量によって、関係者から口頭での意見を聴取することができます。 \n \n5) 判定 \n公表判定委員会は、脆弱性検証結果や当該製品開発者をはじめとする関係者の\n意見書に基づき、脆弱性情報の公表に関する判定を行います。取り扱う案件が下\n記のすべての条件を満たす場合、IPA および JPCERT/CC で公表することが適当と\n判定します。それ以外は公表をしないことと判定します。 \n(ア)調整機関と製品開発者との間の脆弱性情報の公表に係る調整が不可能\nであること（調整不能案件であること） \n(イ)脆弱性の存在が認められること \nソフトウエア製品の脆弱性とは、ソフトウエア製品等において、コン\nピュータ不正アクセスやコンピュータウイルス等の攻撃により、その機\n能や性能を損なう原因となりうるセキュリティ上の問題箇所です。ソフ\nトウエア製品において、情報セキュリティの三大要素（機密性、完全性、\n可用性）の１つ以上が侵害される可能性があり、その原因となる問題挙\n動を IPA または JPCERT/CC が具体的に例示可能であり、製品開発者が反\n証できないとき、脆弱性の存在が認められると判断します。 \nなお、判断においては、一般的なソフトウエア製品の利用方法や、製\n品開発者があらかじめ提示している使用条件等を考慮します。 \n(ウ)IPA が公表しない限り、脆弱性情報を知り得ない製品利用者がいるおそ\nれがあること \n製品開発者が当該ソフトウエア製品の製品利用者全員に確実に通知\nすることが困難な場合を対象とします。例えば、ソフトウエア製品が市\n販されている場合や、ウェブサイト等でダウンロード可能である場合は\nこれに該当します。 \n(エ)製品開発者や製品利用者の状況等を総合的に勘案して、公表が適当でな\nいと判断する理由・事情がないこと \n製品開発者の取組みや製品利用者の状況を鑑みて、公表することが適\n当ではないと判断する明確な理由・事情がある場合には、公表を行いま\nせん。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n15"
      },
      {
        "page_num": 17,
        "text": "6) 結果の通知 \nIPA は、公表判定委員会が行った判定に基づいて、公表するかどうかの判断を\n行い、その結果と理由を JPCERT/CC および製品開発者に通知します。ただし、連\n絡不能案件の場合、製品開発者には通知しません。 \n \n7) 判定後の対応 \nIPA は、判定結果によって、以下の処理を行います。 \n（ア）脆弱性情報を公表すると判定された場合の対応 \n      脆弱性情報を公表するという判定になった場合、IPA は、その判定\nを踏まえ、脆弱性情報の公表を判断するとともに、以下の処理を行い\nます。 \n・経済産業大臣に対して、公表に関する手続きが告示の定める手続\nきに適合していることについての確認を求めます。ただし、連絡\n不能案件の場合、告示の定める手続きに適合していることについ\nて確認はしません。 \n・公表日を決定します。 \n・公表する内容について製品開発者から併記を希望する見解を聴取\nします。ただし、連絡不能案件の場合、この確認はしません。 \n・JPCERT/CC に、公表日と製品開発者から得られた併記を希望する\n見解を通知します。 \n・公表日に、製品開発者名とともに脆弱性情報等を JVN で公表しま\nす。また、製品開発者から併記を希望する見解が提出された場合、\nその見解を併記して公表します。 \n・発見者に、公表したことを通知します。 \n（イ）脆弱性情報を公表しないと判定された場合の対応 \n脆弱性情報を公表しないという判定になった場合、IPA は、発見者\nにその結果と理由を通知します。 \n（ウ）脆弱性情報の公表に係る調整が可能であると判定された場合の対応 \n脆弱性情報の公表に係る調整が可能であると判定された場合、IPA\nは JPCERT/CC に製品開発者との調整を再度行うように通知します。"
      },
      {
        "page_num": 18,
        "text": "４．JPCERT/CC（調整機関）の対応 \n \n1) 製品開発者リストの整備 \nJPCERT/CC は、製品開発者に対して脆弱性関連情報を連絡するために、日\n頃より製品開発者リストの整備に努めます。この製品開発者リストには、\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n16 \n \n製品開発者ごとに、製品脆弱性対策管理者名、連絡窓口（メールアドレス、電\n話番号、住所等）等を登録します。 \nまた、製品開発者が自身の名称等を公表することを承諾した場合、\nJPCERT/CC はそれを「JPCERT/CC 製品開発者リスト\n7\n」に掲載します。 \nなお、製品開発者が発見者からの直接届出を受け付けることを希望する\n場合、JPCERT/CC は当該製品開発者の脆弱性受付窓口の設置状況や自身のウ\nェブサイトでの脆弱性公表の実績等を勘案して、「JPCERT/CC 製品開発者リ\nスト」上に当該製品開発者の脆弱性受付窓口の情報を追記します。 \n \n2) 製品開発者への連絡 \nJPCERT/CC は、届け出られた脆弱性関連情報の IPA からの通知を受け、製品開\n発者リストの活用や脆弱性関連情報を分析することにより、速やかに製品開発\n者を特定し、必要に応じて製品開発者リストに当該製品開発者を追加した上で、\nその製品開発者に連絡を行います。その際に、各製品開発者に対して、脆弱性検\n証を行い、その結果を報告することを求めます。 \nJPCERT/CC は、届け出られた製品と実質的な相互関係にある製品を特定した場\n合には、その製品開発者に連絡を行い、調整することができます。 \nまた、JPCERT/CC は、OSS に関する事前通知を、製品開発者または開発コミュ\nニティに加えて、必要に応じて OSS を導入した製品の開発者・ディストリビュー\nタ・製品の仕様を決定するサービス提供者（例：携帯電話会社）へ通知します。 \n \nこれは、製品開発者または開発コミュニティによる脆弱性対応が困難でかつ\n発表もされない場合に、当該 OSS を導入した製品の開発者やディストリビュー\nタ、製品の仕様を決定するサービス提供者は、それらの脆弱性対応が重要であ\nるケースが想定されるためです。 \nなお、IPA から通知された脆弱性関連情報が、脆弱性による影響が大きい場合、\n受付の順序に関わらず、優先的に取扱いを行います(付録４を参照)。 \nさらに、製品開発者が申告した連絡先情報や製品に添えられた宛先情報等を\nもとに電子メールや郵便、電話、FAX 等いずれの手段で製品開発者に連絡を試み\nても一定期間にわたりまったく応答がない場合には、「連絡が取れない」と判断\nします。その場合、JPCERT/CC は、該当する製品開発者を「連絡不能開発者」と\n位置づけて公表し、連絡を呼びかけます（連絡不能開発者一覧の公表について\nは、付録５を参照）。それでも連絡が取れない場合には、JPCERT/CC は、対象製\n品（製品名およびバージョン）を公表し、広く一般に情報提供を呼びかけること\nがあります（対象製品情報の公表と関係者へのお願いについては、付録５を参\n照）。"
      },
      {
        "page_num": 19,
        "text": "7\n 「JPCERT/CC 製品開発者リスト」https://jvn.jp/nav/index.html \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n17 \n \n3) 公表日の決定 \nJPCERT/CC は、製品開発者から脆弱性検証の結果を受け取り、製品開発者と\n相談した上で、脆弱性情報と製品開発者の対策方法および対応状況の公表日を\n決定し、IPA および関係する製品開発者に通知します。公表日は、JPCERT/CC\nが「製品開発者への連絡」（４．2）を参照）にて規定された連絡を最初に試\nみた日（起算日、２．注釈 4 を参照）から 45 日後を目安とします。ただし、\n公表日の決定に際しては、以下の点も考慮します。 \n① 対策方法の作成に要する期間 \n② 海外の調整機関との調整に要する期間 \n③ 脆弱性情報流出に係るリスク \nまた、通知した製品開発者が複数いて、その一部の製品開発者しか脆弱性検\n証の結果報告をしない場合、JPCERT/CC は、得られた結果報告を踏まえつつ、\n過去の類似事例や②③を参考にして公表日を決定し、IPA および関係する製品\n開発者に通知します。 \n \n4) 公表日決定後の対応 \nJPCERT/CC は、製品開発者から、一般への公表日の変更の要請を受けた場合、\n公表日を変更することがあります。その場合、変更した公表日を IPA および脆弱\n性関連情報に関して連絡を行ったすべての製品開発者に連絡します。 \nさらに、以下の場合、一般への公表を取りやめることがあります。その場合、\nその旨を製品開発者および IPA に連絡します。 \n(ア)通知を行った製品開発者から脆弱性情報に該当しないとの連絡を受け\nた場合 \n(イ)通知を行った製品開発者から脆弱性による影響がないとの連絡を受け\nた場合 \n(ウ)通知を行った製品開発者から脆弱性による影響が小さいとの連絡を受\nけた場合（付録４を参照） \n(エ)脆弱性関連情報が既知であり、脆弱性情報等が公表されている場合 \n(オ)製品開発者がすべての製品利用者に通知する場合（システム構築事業者\nを介して通知するケースを含む） \n \n5) 脆弱性関連情報の取扱い \nJPCERT/CC は、脆弱性関連情報を第三者に開示しません。ただし、以下のよ\nうな正当な理由がある場合、JPCERT/CC は第三者に情報を開示することがあり\nます。 \n(ア)海外製品であり外国企業の日本法人や総代理店が無い場合 \n(イ)海外に大きな影響を与える脆弱性関連情報の場合 \n(ウ)脆弱性関連情報の詳細な分析が必要な場合  等 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n18 \n \n具体的には、秘密保持契約を締結した上で、海外の調整機関または IPA を含\nむ外部機関に連絡や分析を依頼するケースがあります。 \nまた、JPCERT/CC は、脆弱性情報を一般に公表するまでは、第三者に漏えい\nしないように管理します。 \n \n6) 脆弱性関連情報の影響の分析 \nJPCERT/CC は、IPA と連携して、届け出られた脆弱性関連情報が他のソフトウ\nエアやシステムに及ぼす影響の分析を行うよう努めます。影響の分析結果につ\nいては、製品開発者に連絡します。 \n \n7) 対策方法および対応状況の受付 \nJPCERT/CC は、JPCERT/CC から連絡したすべての製品開発者に対して、脆弱性\n情報の一般公表日までに、脆弱性関連情報に係る対策方法および対応状況を報\n告するように要請します。一般への脆弱性情報の公表に際しては、対策方法およ\nび対応状況を IPA と共有します。 \n \n8) 優先的な情報提供 \nJPCERT/CC は、届出がなされた脆弱性関連情報に関して、国民の日常生活に必\n要不可欠なサービスを提供するための基盤となる設備に対し特に影響が大きい\nと推察される場合、IPA および製品開発者と協議の上、対策方法が作成されてか\nら一般公表日までの間に、脆弱性情報と対策方法を、政府機関や当該基盤保有事\n業者等に対して優先的に提供することができます。 \nなお、優先的な情報提供を受ける基盤保有事業者は、以下の条件をすべて満た\nす必要があります。 \n(ア)情報を提供された当該事業者の中で秘密情報管理を徹底すること \n(イ)当該事業者自身の委託先（システム構築事業者、セキュリティベンダ等）\n各社において、秘密情報管理を徹底すること \n(ウ)JPCERT/CC から優先的に提供される情報は当該基盤を防護する目的に対\nしてのみ利用することを徹底すること \nただし、優先提供の趣旨を鑑み、運用方法および提供対象事業者を継続的に\n見直していくものとします。 \n当該基盤保有事業者は、内閣サイバーセキュリティセンター（NISC）の最新の\n「重要インフラの情報セキュリティ対策に係る行動計画」で定める重要インフ\nラ事業者等とします。 \n \n9) 一般への情報の公表 \nJPCERT/CC および IPA は、JVN を通じて、一般に対し、脆弱性情報と JPCERT/CC\nから連絡したすべての製品開発者の脆弱性検証の結果、対策方法および対応状\n況を公表します。さらに、一旦公表した後、製品開発者から新たな対策方法と対\n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n19 \n \n応状況のいずれか一つ以上を受け取った場合、その都度更新します。 \nまた、製品開発者が製品利用者に生じるリスクを低減できると判断した場合、\nJPCERT/CC は製品開発者と調整した上で、製品開発者が製品利用者に脆弱性検証\nの結果、対策方法および対応状況を公表前に通知することを認めることができ\nます。 \nさらに、JPCERT/CC および IPA は、JVN に関する問い合わせ先を明示し、主と\nして OSS 等に関して、システム構築事業者や製品利用者の脆弱性対応を促すこ\nとを目的として、問い合わせ対応を実施します。なお、問い合わせに関する内容\nについては、必要に応じて JVN の公表情報に反映します。 \n \n10) IPA への通知と判定に基づく公表 \nJPCERT/CC は、製品開発者との公表に係る調整が不可能と判断した場合には、\nその旨を IPA に通知します。 \n \nJPCERT/CC は、IPA から脆弱性情報を公表すると判定した旨の通知を受けた場\n合、脆弱性情報等を JVN で公表します。また、IPA から製品開発者の見解が通知\nされた場合、その見解を併記\n8\nして公表します。判定により脆弱性情報を公表し\nないこととなった場合、公表せず取扱いを終了します。 \nなお、公表に係る調整を再度行うように IPA から通知された場合には、その内\n容に応じて、JPCERT/CC は脆弱性関連情報に係る処理を再開します。"
      },
      {
        "page_num": 20,
        "text": "５．製品開発者の対応 \n \n製品開発者は、製品に脆弱性が存在する場合には、その対策に関して適切な対応\nをすることが望まれます。製品開発者に係る法的な論点は、付録３を参照してくだ\nさい。 \n以下で、製品開発者が脆弱性関連情報の対応のために、行うことが望ましい事項\nを説明します。 \n \n1) 窓口の設置 \n製品開発者は、JPCERT/CC との間で脆弱性関連情報に関する情報交換を行うた\nめの窓口を設置し、あらかじめ JPCERT/CC に連絡してください。この窓口が、\nJPCERT/CC の製品開発者リストに登録されることになります。併せて、製品開発\n者名等を「JPCERT/CC 製品開発者リスト」に掲載し公表することを承諾するかど\nうか連絡してください。 \nまた、窓口の変更があれば速やかに JPCERT/CC に連絡してください。 \n \n8\n 製品開発者が見解の併記を希望した場合のみ併記します。 \n\nIV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n20"
      },
      {
        "page_num": 21,
        "text": "さらに、製品開発者が発見者からの直接届出を受け付けるために「JPCERT/CC\n製品開発者リスト」へ自身の窓口情報の掲載を希望する場合は、その旨を申し出\nてください。 \n \n2) 脆弱性検証の実施 \n製品開発者は、JPCERT/CC から脆弱性関連情報を受け取ったら、ソフトウエア\n製品への影響を調査し、脆弱性検証を行い、その結果を JPCERT/CC に報告してく\nださい。また、脆弱性が外部のソフトウエア製品に含まれることが推定される場\n合、JPCERT/CC に連絡してください。 \n何らかの理由で JPCERT/CC からの連絡を受け取れなかった場合も、JPCERT/CC\nから連絡不能開発者として示された場合には、速やかに JPCERT/CC に連絡して\nください。 \n \n3) 脆弱性情報の公表日の調整 \n製品開発者は、検証の結果、脆弱性が存在することを確認した場合、対策方法\nの作成や外部機関との調整に要する期間、当該脆弱性情報流出に係るリスクを\n考慮しつつ、脆弱性情報の公表に関するスケジュールについて JPCERT/CC と相\n談してください。なお、公表日は、JPCERT/CC が「製品開発者への連絡」（４．2）\nを参照）にて規定された連絡を最初に試みた日（起算日、２．注釈 4 を参照）か\nら 45 日後を目安とします。公表に更なる時間を要する場合は、JPCERT/CC と相\n談してください。 \n \n4) 発見者との直接の情報交換 \n製品開発者は、JPCERT/CC から脆弱性関連情報を受け取った後、JPCERT/CC お\nよび IPA を介し、発見者の了解を得て、発見者と直接情報交換を行うことができ\nます。 \n \n5) 関連ウェブサイトに関する情報の取扱い \n当該ソフトウエア製品がウェブサイトの構成要素であり、製品開発者が当該\n脆弱性を再現できない場合、 製品開発者は、届出に関連したウェブサイトの情\n報を JPCERT/CC に求めることができます。製品開発者は、関連ウェブサイトの情\n報が提供された場合、その情報を第三者に漏えいしないように適切に管理して\nください。  \n \n6) 問い合わせへの対応 \n製品開発者は、JPCERT/CC からの脆弱性関連情報に係る技術的事項および進捗\n状況に関する問い合わせに的確に答えてください。"
      },
      {
        "page_num": 22,
        "text": "IV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n21 \n \n7) 対策方法および対応状況の連絡 \n製品開発者は、脆弱性情報の一般への公表日までに脆弱性関連情報に係る対\n策方法を作成するように努めて、対策方法および対応状況を JPCERT/CC に連絡\nしてください。JPCERT/CC に対する対策方法および対応状況の報告をもって、IPA\nにも報告したこととみなされます。また、新たな対策方法を作成した場合や対応\n状況が変わった場合、その都度、JPCERT/CC に最新の情報を連絡してください。 \n \n8) 対策方法の周知 \n製品開発者は、対策方法を作成した場合、脆弱性情報一般公表日以降、それを\n製品利用者に周知してください。望ましい公表の手順については、本ガイドライ\nンの別冊「ソフトウエア製品開発者による脆弱性対策情報の公表マニュアル」を\n参考にしてください。 \n \n9) 製品開発者内の情報の管理と開示 \n製品開発者は、正当な理由がない限り、第三者に脆弱性関連情報を開示しない\nでください。また、製品開発者は、上記 3)で作成した脆弱性情報の一般公表ス\nケジュールおよび脆弱性関連情報を、脆弱性情報を一般に公表する日まで第三\n者に漏えいしないように管理してください。 \nただし、製品利用者に生じるリスクを低減できると判断した場合、製品開発者\nは、JPCERT/CC と調整した上で、直接あるいはシステム構築事業者を介して製品\n利用者に脆弱性検証の結果、対策方法および対応状況を公表前に通知すること\nができます。その際、製品開発者は、通知先に対し、脆弱性関連情報を第三者に\n開示しないこと、および脆弱性情報を一般に公表するまでの間、脆弱性情報と対\n策方法について、第三者に漏えいしないように適切に管理することを要請して\nください。 \n \n10) 公表判定委員会に関する対応 \nIPA および JPCERT/CC は、製品開発者と適切な連絡が取れない等の理由により\n進展が見込めなくなった場合には、３．(2)に定める手続きを行い、公表するか\nどうかを IPA が組織する公表判定委員会で判定することができます。脆弱性情\n報を公表すると判定した場合、IPA および JPCERT/CC は、製品開発者名とともに\n脆弱性情報等を JVN で公表します。 \n公表判定委員会による判定が行われる場合、製品開発者には意見を表明する\n機会が与えられます。公表判定委員会による判定のプロセスについては３．(2)\nを参照してください。"
      },
      {
        "page_num": 23,
        "text": "IV．ソフトウエア製品に係る脆弱性関連情報取扱 \n \n22 \n \n６．その他 \n \n1) 製品開発者自身による脆弱性関連情報の発見・取得 \n製品開発者は、自身のソフトウエア製品に関する脆弱性関連情報について自\n身で発見・取得した場合、または他の者によって開示された脆弱性関連情報を取\n得した場合、対策方法を作成し、製品利用者に対して当該脆弱性情報と対策方法\nを周知してください。 \nさらに、製品開発者は、当該脆弱性関連情報および対策方法を IPA または\nJPCERT/CC に通知してください。ただし、すべての製品利用者に当該脆弱性関連\n情報および当該対策方法を通知した場合、通知は不要です。 \n \n2) IPA および JPCERT/CC による普及支援 \nIPA および JPCERT/CC は、上記 1)で受け取った届出に関して、当該脆弱性情\n報および対策方法を JVN で公表します。公表する時期については、製品開発者と\n事前に調整を図ります。"
      },
      {
        "page_num": 24,
        "text": "V．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n23 \n \nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n１．概要 \nウェブアプリケーションに係る脆弱性関連情報取扱概要は、図２の通りです。 \n \n図２  ウェブアプリケーションに係る脆弱性関連情報取扱概要 \n(ウェブアプリケーションにおける脆弱性情報取扱いの全体フローは付録２を参\n照) \n \n1) 発見者は、IPA に脆弱性関連情報を届け出る \n2) IPA は、受け取った脆弱性関連情報に関して、原則としてウェブサイト運営者\nに通知する \n3) ウェブサイト運営者は、脆弱性関連情報の内容を検証し、影響の分析を行った\n上で、必要に応じて脆弱性の修正を行う \n4) 個人情報漏えい等の事件があった場合、ウェブサイト運営者は、その事実を一\n般に公表する等適切な処置をとる \n5) IPA は統計情報を、原則、四半期ごとに公表する"
      },
      {
        "page_num": 25,
        "text": "発見者\nIPA\nウェブサイト運営者\n一般\n1 \n発見者は、IPAに脆弱性\n関連情報を届け出る\n2IPAは、ウェブサイト運営者に\n脆弱性関連情報を通知する\n3ウェブサイト運営者は、\n脆弱性を修正する\n4ウェブサイト運営者は、\n個人情報漏洩等があった\n場合、その事実を一般に\n公表する等の措置をとる\n５IPAは、四半期ごとに\n統計情報を公表する\n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n24 \n \n２．発見者の対応 \n \n1) 脆弱性関連情報の発見・取得 \n脆弱性関連情報の発見・取得に際しては、関連法令に触れることが無いよう\nに留意してください。法的な論点に関しては、付録３を参照してください。 \n \n2) 脆弱性関連情報の届出 \n発見者は、発見した脆弱性関連情報を IPA に届け出てください。 \nなお、外部からの連絡窓口\n9\nを設置しているウェブサイト運営者については、\n直接届出を行うことも可能です。ウェブサイト運営者に直接届け出たが、脆弱性\nの解消に向けたウェブサイト運営者との調整が難航した場合には、IPA に連絡し\nてください。 \n \n3) 脆弱性関連情報の管理および開示 \n発見者は、脆弱性関連情報を正当な理由がない限り第三者に開示しないでく\nださい。ただし、正当な理由があって脆弱性関連情報を開示する場合には、事前\nに IPA に相談してください。発見者は、脆弱性が修正されるまでの間は、脆弱性\n関連情報が第三者に漏えいしないように適切に管理してください（発見者に対\nする情報非開示依頼、以下「情報非開示依頼」という）。脆弱性関連情報の管理\nおよび開示に係る法的な問題に関しては、付録３を参照してください。 \n \n4) 届け出る情報の内容 \n発見者は、届け出る情報の中で以下の点を明示してください（詳細は、\nhttps://www.ipa.go.jp/security/vuln/ を参照）。 \n(ア) 氏名等の発見者を識別するための情報 \n(イ) 電子メールアドレス等の発見者の連絡先 \n(ウ) (ア)および(イ)のウェブサイト運営者への通知の可否 \n(エ) ウェブサイト運営者から直接連絡を受けることの可否 \n(オ)  脆弱性関連情報に係るウェブアプリケーションが稼動しているウェ\nブサイトの URL \n(カ) 脆弱性関連情報の内容（脆弱性関連情報を確認する環境と、手順およ\nび結果） \n可能であれば、脆弱性が存在する証拠\n10\nを一緒に提出してください。\nただし、証拠の取得に際しては、関連法令に触れることがないように\n留意してください（付録３を参照）。 \n(キ) 個人情報の取扱い方法（ウェブサイト運営者との直接の情報交換の可\n否、ウェブサイト運営者への通知の可否） \n発見者が望まない場合、IPA は、ウェブサイト運営者へ発見者を特定\n \n9\n たとえば「ホームページに対するお問い合わせ窓口」のことです。 \n10\n 具体的には、「検証コード」、「画面キャプチャ」、「ログ」等。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n25 \n \nしうる情報を連絡することはありません。 \n(ク) 他の組織（製品開発者、他のセキュリティ関係機関等）への届出状況\n等 \n \n5) ウェブサイト運営者との直接の情報交換 \n発見者は、IPA に脆弱性関連情報を届け出た後、IPA と協議の上、ウェブサイ\nト運営者の了解を得て、ウェブサイト運営者と直接情報交換を行うことができ\nます。 \n \n6) 届出後の対応 \n発見者は、届出後、IPA に進捗状況の問い合わせを行うことができます。IPA\nは、本ガイドラインの３．に則って処理を行い、発見者から問い合わせがあった\n場合、適切な情報の開示を行います。発見者は、開示された情報をみだりに第三\n者に開示しないでください。"
      },
      {
        "page_num": 26,
        "text": "３．IPA（受付機関）の対応 \n \n1) 脆弱性関連情報の受付 \n脆弱性関連情報の受付に関し、詳細は以下の URL をご参照ください。 \nhttps://www.ipa.go.jp/security/vuln/  \n届出は 24 時間受け付けますが、受け付けた情報について 2)以降の作業を行うの\nは原則営業日のみとなります。 \n \n2) 届出の受理 \nIPA は、届出の記載が以下の条件をすべて満たしていると判断した時、その時\n点で届出を受理し、発見者に連絡します。 \n(ア)上記２．4)の項目がすべて記載されていること \n(イ)届出内容に矛盾等が無いこと \n(ウ)届出の対象が本ガイドラインの適用範囲に該当すること（\nIII章を参照） \n(エ)記載されている内容が脆弱性であること \n(オ)既知の脆弱性とは異なる脆弱性の関連情報であること（ウェブサイト運\n営者により既に修正された脆弱性ではないこと） \n \nなお、IPA は、これらの条件により、届出の受理または不受理を判断し、その\n理由とともに発見者に連絡します。なお、発見者に届出の受理を連絡した日が\nIPA による脆弱性関連情報の取扱いを開始した日（受理日）となります。"
      },
      {
        "page_num": 27,
        "text": "V．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n26 \n \n3) 違法な手段で入手された脆弱性関連情報への対応 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な手\n段で入手されたことが明白な脆弱性関連情報に関しては、処理を取りやめるこ\nとがあります。 \n \n4) 脆弱性関連情報への対応続行の判断 \nIPA は、以下の条件のいずれかと合致した場合、処理を取りやめるとともにウ\nェブサイト運営者および発見者に連絡します。なお、取扱いを終了する場合、\nIPA の発見者に対する情報非開示依頼は効力を失います。 \n(ア)脆弱性関連情報に該当しない場合 \n(イ)本ガイドラインの適用範囲外である場合 \n(ウ)脆弱性による影響が小さい場合（付録４を参照） \n(エ)ウェブサイト運営者から脆弱性関連情報が既知であり、その脆弱性が \n修正されていると連絡があった場合 \n(オ)ウェブサイトの不適切な運用（付録１を参照）のうち、脆弱性の原因が\n下記と判明したもので、IPA が注意喚起等の方法で広く対策を促した後、\n処理を取りやめる判断をした場合 \n・ウェブサイトが利用しているソフトウエア製品の設定情報が誤って\nいる場合や初期状態のままとなっている場合。 \n・ウェブサイトが利用しているソフトウエア製品の修正プログラムが\n適用されていない場合。 \n(カ)ウェブサイト運営者から適切な応答が得られない場合（ 5）を参照） \n(キ)ウェブサイト運営者から脆弱性による影響度が低い等の理由により対\n応を行わないと連絡があった場合 \n上記(オ)の注意喚起後は、該当するソフトウエア製品の製品開発者も対策方\n法の再度の周知をウェブサイト運営者へ行うことを推奨します。 \n \n5) ウェブサイト運営者への連絡 \nIPA は、上記 2)、3)および 4)における対応の是非の判断の結果、対応するこ\nとが妥当との判断を下した脆弱性関連情報について、速やかにウェブサイト運\n営者に通知します。また、ウェブサイト運営者が脆弱性の再現する状況を特定で\nきない場合等は、ウェブサイト運営者の了解を得た上で、IPA は IPA の内部また\nは外部で脆弱性関連情報に関する技術的分析を行います。なお、届出された脆弱\n性による影響が大きい場合、受付の順序に関わらず、優先的に取扱いを行います\n（付録４を参照）。 \n  ウェブサイトに掲載された宛先情報をもとに電子メールや電話、FAX 等いずれ\nの手段でウェブサイト運営者に脆弱性関連情報に係る問い合わせを試みても、\n一定期間にわたり的確な答えがない場合、IPA は、その脆弱性の影響範囲や取扱\n期間を考慮して取扱いを終了することがあります（ 4)(カ)を参照）。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n27"
      },
      {
        "page_num": 28,
        "text": "6) 発見者との情報交換 \nIPA は、届出を受理した後でも、発見者に問い合わせすることがあります。ま\nた、発見者から問い合わせがあった場合、ウェブサイト運営者と相談の上、適切\nな情報の開示を行います。 \n \n7) 脆弱性関連情報の取扱い \nIPA は、脆弱性関連情報に関して、発見者・ウェブサイト運営者以外の第三者\nに開示しません。ただし、下記のような正当な理由がある場合は、外部機関に脆\n弱性関連情報を開示することがあります。これらの場合、IPA は秘密保持契約を\n結びます。さらに、下記 8)に関しては例外とします。 \n（ア）脆弱性が再現する状況を特定できない等止むを得ない場合、IPA は国\n立研究開発法人産業技術総合研究所等の外部機関に脆弱性関連情報に\n関する技術的分析を依頼する \n（イ）政府機関のウェブサイトの場合、IPA は内閣サイバーセキュリティセ\nンター（NISC）へ当該ウェブサイト運営者への脆弱性関連情報の一部を\n開示し迅速な情報の取得を依頼する \n（ウ）地方公共団体のウェブサイトの場合、IPA は総務省へ当該ウェブサイ\nト運営者への脆弱性関連情報の一部を開示し迅速な情報の取得を依頼\nする \n（エ）個人情報が漏えいしているおそれがあり、ウェブサイト運営者による\n対応がされない場合、IPA は個人情報保護委員会に脆弱性関連情報を連\n絡し、個人情報保護法（平成 15 年法律第 57 号）第 42 条に基づく措置\nを依頼する \n \n8) ソフトウエア製品の脆弱性である場合の対応 \nIPA は、届け出られた脆弱性関連情報を分析する過程で、ソフトウエア製品の\n脆弱性であることを認識した場合、JPCERT/CC を介して製品開発者に連絡を行い\nます。その際、原則としてウェブサイトを特定可能な情報を提供しないように適\n切に管理します。ただし脆弱性の再現のため必要な場合、ウェブサイト運営者の\n同意が得られれば、当該ウェブサイトに関する情報を製品開発者に提供するこ\nとがあります。 \n \n9) 発見者の個人情報の管理 \nIPA は、氏名・連絡先を含む発見者に係る情報を、発見者が望む場合以外には、\nウェブサイト運営者および第三者に漏えいしないよう適切に管理します。 \n \n10) 脆弱性の修正の通知 \nIPA は、ウェブサイト運営者から脆弱性を修正した旨の通知を受けた場合、そ\n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n28 \n \nれを速やかに発見者に通知します。 \n \n11) 統計情報の集計と公表 \nIPA は、脆弱性に係る実態を周知徹底し危機意識の向上を図り、その結果とし\nての被害の予防のために、受け付けた脆弱性関連情報を集計し、統計情報として\nインターネット上等で原則、四半期ごとに公表します。統計情報には、届出件数\nの時間的推移等が含まれます。その際に、当該ウェブアプリケーションの脆弱性\n関連情報に関して、サイト名・URL・ウェブサイト運営者名が判別可能な形式で\n公表することはありません。"
      },
      {
        "page_num": 29,
        "text": "４．ウェブサイト運営者の対応 \n \nウェブアプリケーションに脆弱性が存在する場合には、ウェブサイト運営者\nは、これに関して適切な対応をすることが望まれます。 \nウェブサイト運営者における法的な論点は、付録３を参照してください。 \n以下で、ウェブサイト運営者が対応すべき事項を説明します。 \n \n1) 脆弱性関連情報への対処 \nウェブサイト運営者は、通知を受けたら、脆弱性の内容を検証し、脆弱性が存\n在することを確認した場合には、脆弱性の及ぼす影響を正確に把握し、その大き\nさを考慮して脆弱性を修正してください。また、当該脆弱性関連情報に関して検\n証した結果、および修正した場合その旨を IPA に連絡してください。この連絡\nは、IPA から脆弱性関連情報の通知を受けてから、3 ヶ月以内を目処としてくだ\nさい。 \n \n2) 問い合わせへの対応 \nウェブサイト運営者は、IPA からの脆弱性関連情報に係る問い合わせに的確に\n答えてください。 \n \n3) 発見者との直接の情報交換 \nウェブサイト運営者は、脆弱性を修正するために、IPA と協議の上、発見者の\n了解のある場合、発見者と直接情報交換を行うことが可能です。 \n \n4) ウェブサイト運営者内の情報の管理と開示 \nウェブサイト運営者は、脆弱性関連情報を正当な理由がない限り第三者に開\n示しないでください。ただし、ウェブサイト運営者が脆弱性修正を依頼した外部\n機関、およびウェブサイトの管理を委託している外部機関には、秘密保持契約を\n締結した上で脆弱性関連情報を連絡することを推奨します。 \n\nV．ウェブアプリケーションに係る脆弱性関連情報取扱 \n \n29 \n \nまた、ウェブサイト運営者は、脆弱性が修正されるまでの間は、脆弱性関連情\n報を第三者に漏えいしないように管理してください。なお、ウェブサイト運営者\nは、脆弱性の修正の過程でソフトウエア製品の脆弱性であることを認識した場\n合、脆弱性関連情報を第三者に正当な理由がない限り開示しないでください。ま\nた、当該脆弱性情報等が公表されるまで情報を第三者に漏えいしないように管\n理してください。 \n \n5) 脆弱性関連情報の公表 \nウェブサイト運営者は、ウェブアプリケーションの脆弱性関連情報に関して、\n積極的に公表する必要はありません。ただし、この脆弱性が原因で、個人情報が\n漏えいした等の事案が起こったまたは起こった可能性がある場合、二次被害の\n防止および関連事案の予防のために、以下の項目を含むように公表してくださ\nい。 \nまた、当該個人からの問い合わせに的確に回答するようにしてください。 \n・ 個人情報漏えいの概要 \n・ 漏えいしたと推察される期間 \n・ 漏えいしたと推察される件数 \n・ 漏えいしたと推察される個人情報の種類（属性等） \n・ 漏えいの原因 \n・ 問合せ先"
      },
      {
        "page_num": 30,
        "text": "付録１  用語の解説 \n \n30 \n \n付録１  用語の解説 \n \n１．ソフトウエア製品 \nソフトウエア製品（技術情報の統括や開発保守を行っている者をコミュニティ\nとしてしか特定できない、オープンソースソフトウエアのようなものも含みます）\nの種類は、OS、ブラウザ、メーラ等のクライアント上のソフトウエア、DBMS\n（Database Management System）、ウェブサーバ等のサーバ上のソフトウエア、プ\nリンタ、IC カード、PDA（Personal Digital Assistance）、コピー機等のソフトウ\nエアを組み込んだハードウエア、制御システム用製品等を想定しています。 \n制御システムは、他の機器やシステムの動作を管理、指示、制御するシステムま\nたは装置であり、センサやアクチュエータ等のフィールド機器、制御用ネットワー\nク、コントローラ、監視制御システム（SCADA：Supervisory  Control  And  Data \nAcquisition とも呼ばれる）等で構成されています。 \n制御システムは、一般にライフサイクルが長いこと、業務の性質上すぐに停止で\nきないため、対策が用意されてもそれを実施することが難しい場合があることか\nら、対策の実施に時間を要する点に配慮する必要があります。さらに、社会基盤を\n支える制御システムの場合、被害が生じたときの社会的影響が大きい点にも配慮\nする必要があります。 \n \n２．エクスプロイトコード \nエクスプロイトコードは、攻撃コードとも呼ばれることもあり、脆弱性を悪用す\nるソフトウエアのソースコードです。しかし、使い方によっては、脆弱性の検証に\n役立つこともあります。 \n \n３．ワークアラウンド \n当該脆弱性を修正する以外の方法で脆弱性による影響を回避・低減する方法で\nす。例えば、ソフトウエア製品においては、脆弱性のある機能の無効化や代替ソフ\nトウエアへの移行等があります。ウェブサイトにおいては、脆弱性の影響を受ける\nサービスの停止や、WAF（ウェブ・アプリケーション・ファイアウォール）の導入\n等があります。 \n \n４．パッチ \n脆弱性を有するソフトウエアから、脆弱性を解消するためにソフトウエアに対\nして適用する差分のソフトウエアあるいはデータのことです。 \n \n５．ウェブサイト運営者 \n\n付録１  用語の解説 \n \n31 \n \nウェブサイト運営者とは、ウェブアプリケーションを運営する主体です（例え\nば、ウェブサイト  https://www.ipa.go.jp/  のウェブサイト運営者は IPA です）。\nウェブサイトの管理を外部の事業者に委託している場合でも、あくまで委託元が\nウェブアプリケーションを運営する主体でありウェブサイト運営者となります。 \n \n６．プロトコルの実装に係る脆弱性 \n過去に報告があったプロトコルに関連する脆弱性の主なものを以下に挙げます。 \n(1) H.323 に係る脆弱性 \n(2) SSH2 に係る脆弱性 \n(3) OpenSSL に係る脆弱性 \n(4) ASN.1 に係る脆弱性 \n \n７．ウェブサイトの不適切な運用 \nウェブサイトの不適切な運用の例を以下に挙げます。 \n・ウェブサイトにおいて、本来提供するべき対象外の機能（ウェブサイト管理画\n面等）やファイル（個人情報ファイル等）が、アクセス制限なしに公開されて\nおり、セキュリティが維持できなくなっている。 \n・ウェブサイトで使用されているソフトウエア製品に脆弱性が存在している。 \n・サービスを行っていないウェブサイトの脆弱性が放置されている。"
      },
      {
        "page_num": 31,
        "text": "付録２  脆弱性情報取扱いのフロー \n \n32 \n \n付録２  脆弱性情報取扱いのフロー \n \nソフトウエア製品、ウェブアプリケーションそれぞれの脆弱性情報取扱いに関\nする全体的な流れを図３、図４に示す。"
      },
      {
        "page_num": 32,
        "text": "付録２  脆弱性情報取扱いのフロー \n \n33"
      },
      {
        "page_num": 33,
        "text": "発見者\nIPA\nJPCERT/CC\n製品開発者\n脆弱性関連情報の届出\n脆弱性関連情報\nの連絡\n不明点の確認\n届出受理の連絡\n公表の連絡\n対応状況の公表\n受理／不受理\nの決定\n受付\n以下を確認\n•\n項目をすべて記載\n•\n内容に矛盾が無い\n•\n適用範囲に該当\n•\n内容が脆弱性である\n•\n既知の脆弱性ではない\n製品開発者\nへ連絡\nIPA\n、\nJPCERT/CC\nが\n共同運営する\nポータルサイト\n（\nJVN\n）\n連絡先の確認\n図３ ソフトウエア製品における脆弱性情報取扱いの全体フロー\n連絡窓口\nの設置\n対策方法\nの作成\n対策情報\nの周知\n脆弱性の\n検証・評価\n対応状況の\n連絡\n脆弱性関連情報\nの連絡\n問い合わせ\n問い合わせ\n起算日の連絡\n問い合わせ\n対応状況\nの受付\n公表日の調整\n検証結果の報告\n対応状況の報告\n対応状況の共有\n統計情報の公表\nJPCERT/CC\nへ連絡\n1\n2\n3\n4\n6-16-2\n6-3\n6-4\n起算日の連絡\n5\n公表日の調整\n7\n8\n9\n10\n9\n起算日の連絡\n5\n公表日の調整\n8\n公表判定\n開催連絡と意見聴取\n6’-4\n脆弱性情報の公表\n(\n製品開発者の\n見解併記\n)\n統計情報の公表\n9’\n左記の6 以降、IPAが、JPCERT/CCから\n調整不能である旨の通知を受けた場合の対応\n場合によっては、重要インフラ事業者に優先的に情報提供する\n【調整不能案件の取扱い】\n影響が小さい脆弱性の場合、製品開発者に通知することで取扱終了とすることができる\nIPA\nおよび\nJPCERT/CC\n（\nIPA\nが組織）\n公表判定委員会\n6’-2\n結果通知\n7’\n判定に必要な情報\nの収集・整理\n6’-1\n併記する見解の聴取\n開催連絡\n意見提出\n意見提出\n6’-3\n結果通知\n見解提出\n8’-1\n製品開発者\n•\n判定結果が「公表しない」だった場合、取り扱いを終了する\n•\n判定結果が再調整だった場合、 製品開発者と再度調整を実施する\n連絡が取れない場合、連絡不能開発者一覧に公表し、製品開発者からの連絡を呼びかける\n8’-2\n見解提出\n10’\n起算日の連絡\n発見者へ\n公表の連絡\n\n付録２  脆弱性情報取扱いのフロー \n \n34"
      },
      {
        "page_num": 34,
        "text": "発見者\nIPA\nウェブサイト運営者\n脆弱性関連情報の届出\n脆弱性関連情報\nの連絡\n不明点の確認\n届出受理の連絡\n受理\n/\n不受理\nの決定\n受付\n脆弱性の\n検証・評価\n図４ ウェブアプリケーションにおける脆弱性情報取扱いの全体フロー\n修正\n担当窓口\nの確認\n連絡先の確認\n問い合わせ\n問い合わせ\n修正完了の報告\n修正完了の連絡\n統計情報\nの公表\n開始連絡\n取扱い開始の連絡\n対応状況\nの連絡\n修正完了\n連絡\n検証結果の報告\n1\n2\n3\n4\n5-1\n5-2\n5-35-4\n6\n7\nウェブサイト\n運営者へ連絡\n影響が小さい脆弱性の場合、ウェブサイト運営者に通知することで取扱終了とすることができる\n以下を確認\n•\n項目をすべて記載\n•\n内容に矛盾が無い\n•\n適用範囲に該当\n•\n内容が脆弱性である\n•\n既知の脆弱性ではない\n3\n\n付録３  法的な論点について \n \n35 \n \n付録３  法的な論点について \n \n１  発見者が心得ておくべき法的な論点 \n \n発見者が心得ておくべき法的な問題に関する法律専門家の見解を述べます。 \n \n１－１．脆弱性関連情報の発見に際しての法的な問題 \n \n（１）関係する行為と法令の関係 \na) ネットワークを用いた不正 \n・例えば、脆弱性関連情報を利用して、アクセス制御機能を回避し、\nインターネット等を介してシステムにアクセスした場合には、不正ア\nクセス禁止法（不正アクセス行為の禁止等に関する法律）に抵触しま\nす。 \n・例えば、管理者の了解無く、他人のパスワードを取得し、それを用\nいて権限なしでシステムにアクセスした場合には、不正アクセス禁止\n法に抵触します。 \n・故意にサーバの機能や性能の異常を来たそうとして何らかの行為を\nなし、コンピュータの性能を低下させたりした場合、刑法上の偽計（も\nしくは威力）業務妨害罪に抵触する可能性があります。さらに、その妨\n害の程度によっては、刑法の電子計算機損壊等業務妨害罪にも抵触す\nると解される可能性があります。 \nb) 暗号化されている無線通信の復号化 \n・暗号化されている無線通信を傍受し復号する行為（無線 LAN の WEP\nキーを解読して通信内容を復号すること）は、電波法 109 条の 2 に触\nれる可能性があります。 \n \n（２）不正アクセス禁止法に抵触しないと推察される行為の例 \n脆弱性の発見に最も関係が深い不正アクセス禁止法に対しては慎重な扱いが\n求められます。といっても脆弱性を発見する際に、必ずしも不正アクセス禁止\n法に抵触するとは限りません。以下に、不正アクセス禁止法に抵触しないと推\n察される行為の例を挙げます。 \n1) ウェブアプリケーションの利用権者が、正規の手順でログインする等し\nて通常のアクセスをした際に、ブラウザとサーバとの通信の内容を観察\nしたところ、それだけで脆弱性の存在を推定できた場合。 \n\n付録３  法的な論点について \n \n36 \n \n2) ウェブページのデータ入力欄に HTML のタグを含む文字列を入力したとこ\nろ、入力した文字列がそのまま表示された。この段階ではアクセス制御\n機能の制限を回避するに至らなかったが、悪意ある者に別の文字列を入\n力されれば、このサイトにセキュリティ上の問題が引き起こされかねな\nいと予想できた場合。 \n3) アクセス制御による制限を免れる目的ではなく、通常の自由なページ閲\n覧を目的として、日付やページ番号等を表すと推察される URL 中の数字\n列を、別の数字に差し替えてアクセスしてみたところ、社会通念上、本\n来は利用できてはならないはずと推定される結果が、偶発的に起きてし\nまった場合。（ただし、積極的に多数の数字列を変えて試す行為等は、\n制限を免れる目的とみなされる可能性があります。） \n \n（３）IPA の対応と発見者の法的責任 \nIPA は、脆弱性関連情報の入手方法に関して関知しません。ただし、違法な\n手段で入手されたことが明白な脆弱性関連情報に関しては、受け付けないこ\nとがあります。 \nまた、IPA が脆弱性関連情報を受け付けた場合でも、IPA は脆弱性関連情報\nの入手手段に関して合法であると判断したわけではありません。さらに、IPA\nが脆弱性関連情報を受け付けた場合、発見者の脆弱性関連情報の発見に係る\n法的責任が免責されるわけではありません。 \n \n１－２．脆弱性関連情報の管理および開示に際しての法的な問題 \n \n発見者の脆弱性関連情報の管理および開示に際しては、以下の法的な問題へ\nの注意が必要です。 \n \n1) 脆弱性についての調査・報告は、その率直な交換により、ソフトウエア\nやウェブアプリケーションシステムのセキュリティが結果として強化さ\nれ・向上するという側面があります。 \n2) しかしながら、その情報については、悪用というデメリットがあるの\nで、その点についての十分な配慮がなされるべきであり、その一つの方\n向性を提唱するのが、このガイドラインといえます。 \n3) また、情報自体そのような性格をもつので、発見者についても脆弱性関\n連情報の管理および開示について真摯な態度が必要とされます。 \n\n付録３  法的な論点について \n \n37 \n \n4) そのような真摯な態度を保つ限り脆弱性関連情報についての調査・報告\nは、社会的に有用なものと考えられます。 \n \nしかしながら、管理および開示について真摯な態度を欠く場合については、\n上述の限りではありません。そのような真摯な態度を欠く場合の具体的な例\nとして以下があります。 \na) 脆弱性関連情報の公表は、その情報の内容が真実と異なることを知っ\nていた場合、あるいは、真実である場合であっても、特定人の名誉を\n毀損する意図で公表がなされ、かつ、公共の利益と無関係である場合\nには、刑法の名誉毀損罪に触れる可能性があります。 \nb) 特定人の信用を毀損する意図で事実と異なる脆弱性関連情報を、事実\nと異なると認識して公表がなされる場合には、刑法の信用毀損罪に触\nれる可能性があります。 \nc) 通常人に求められる程度の相当の注意をもって調査・検証したりした\nのではなしに脆弱性関連情報であるとして公表し、かつ、脆弱性関連\n情報の開示に起因して損害が発生した場合、損害賠償責任等の民事責\n任を追及される可能性があります。"
      },
      {
        "page_num": 35,
        "text": "２  製品開発者が心得ておくべき法的な論点 \n \n製品開発者が心得ておくべき法的な問題に関する法律専門家の見解を述べま\nす。 \n \n(1)ソフトウエアの提供行為についていえば、セキュリティに問題が生じず、日\n頃の運用で安心して使えるというレベルのソフトウエアを提供することが、\n法律上、債務の本旨に従った履行（民法４１５条）として求められています。 \n(2)もし、提供したソフトウエアにおいて、設計上の問題、プログラミング上の\n問題、運用上の問題の如何を問わず、社会通念上、安心して使えるというレ\nベルにいたらない箇所が生じている場合には、その点に対してサポートの約\n定の趣旨に従い対策をすべきことが求められます。 \n(3)もっともその対策方法の選択については、種々の考慮が必要になります。 \n \nこの対策方法の選択に際しては、以下の点を論点として意識する必要があり\nます。 \n(a) 上記の対策方法の選択について、状況に応じて債務不履行責任（民法４１\n\n付録３  法的な論点について \n \n38 \n \n５条）、不法行為責任（民法７０９条）の対象となる可能性があります。 \n(b) 提供の際の契約で、これを免除する場合については、消費者契約法の適用\nがある場合には、責任の全部免除が認められない場合がありえます。 \n(c) 製造物責任法上の問題として、現時点において、ソフトウエアそれ自体に\nついては製造物責任が問われないと一般に解釈されていますが、電気機\n器や電子部品その他の工業製品等に組み込まれたソフトウエアは動産で\nある製造物ですので製造物責任法に定める責任規定の適用がなされるこ\nとがありえます。"
      },
      {
        "page_num": 36,
        "text": "３  ウェブサイト運営者が心得ておくべき法的な論点 \n \nウェブサイト運営者が心得ておくべき法的な問題に関する法律専門家の見解\nを述べます。 \n \n1) ウェブサイト運営者と、ウェブサイト利用者との間においては、そのウェ\nブアプリケーションの利用に際して、一定の契約関係にはいると考えられま\nす。そして、ウェブサイト利用者が、そのサイトに一定の個人情報等をゆだ\nねる場合には、ウェブサイト運営者は、そのサイトの利用契約に付随した義\n務として一定レベルのセキュリティ維持を果たすべき義務を負担している\nと考えることができます。 \n2) 各サイトに「プライバシポリシ」等が記載されている場合には、その内容を\nも前提にウェブサイト利用者とウェブサイト運営者は、契約関係にはいると\n考えられます。 \n3) この場合、ウェブサイト運営者において、上記のセキュリティ維持等につ\nいて過失がある場合、その過失による損害賠償の責めを免れるような規定は、\n消費者契約法上、全部免責の規定については無効となることがあります。"
      },
      {
        "page_num": 37,
        "text": "付録４  脆弱性の影響度の基準に関する考え方について \n \n39 \n \n付録４  脆弱性の影響度に関する考え方について \n \n脆弱性の「影響度」に関する考え方は、関係者から得られた情報や IPA・\nJPCERT/CC が把握している情報を勘案し、IPA および JPCERT/CC が総合的に判断\nした脆弱性の深刻度（CVSSv3 基本値スコア）と影響範囲により決定します。 \nソフトウエア製品の脆弱性、ウェブアプリケーションの脆弱性のいずれも下\n記の考え方で実施します。ただし、ウェブアプリケーションについては、これま\nでの経緯を踏まえ、CVSSv3 基本値スコアが「4.0 ～ 6.9」でかつ脆弱性の影響\n範囲が中の場合でも、受動型の攻撃であれば、取扱いを終了することを可能とし\nます。 \n影響度の考え方 \n \n脆弱性の深刻度  ：脆弱性の深刻度として、CVSSv3 基本値スコアを適用する。 \n脆弱性の影響範囲：以下の要素を勘案して選択する。①～③がすべて不明の場\n合は「広」と判断する。 \n  ①利用者数 \n当該ソフトウエアの利用者数。 \n  ②社会的影響力 \n重要インフラ等でも取扱っていると思われるソフトウエア製品の脆弱性\nである。 \n  ③攻撃の容易性\n \n攻撃コードの公表、または実際の攻撃の発生が確認された場合に「広」と\n判断する。届出についての取扱いを判断する時点の情報で判断を行う。 \n \n通常の対応    優先対応優先対応\n簡易な対応    通常の対応    優先対応\n簡易な対応    簡易な対応    通常の対応\n4.07.010.0\n0\n狭\n中\n広\n脆弱性の深刻度\n（CVSSv3基本値スコア）\n脆\n弱\n性\nの\n影\n響\n範\n囲\n\n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n40 \n \n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n１  連絡不能開発者一覧の公表\n11"
      },
      {
        "page_num": 38,
        "text": "製品開発者名や製品開発者を特定できるような情報を公表することで、掲載\nされた製品開発者からの連絡を求めていることを周知します。想定読者は、製品\n開発者本人です。"
      },
      {
        "page_num": 39,
        "text": "製品開発者情報  公開調査  \n \n概要 \nIPA（独立行政法人情報処理推進機構）および JPCERT コーディネーションセン\nターでは、情報セキュリティ早期警戒パートナーシップに基づいて届出られ\nたソフトウエア製品の製品開発者、またはその関係者からのご連絡を求めて\nいます。  \n \n調査対象 \n情報セキュリティ早期警戒パートナーシップに基づいて届けられたソフトウ\nエア製品で、インターネット等から入手しうる情報では連絡が取れない、以下\nの一覧に掲載されている製品開発者、またはその関係者が調査対象です。  \n \n連絡先 \nSubject に問い合わせ番号を明記し jvn@jvn.jp 宛に、ご連絡ください。"
      },
      {
        "page_num": 40,
        "text": "連絡不能開発者一覧 \n問合せ番号 開発者名 関連情報 一覧追加日 製品情報 備考 \nDID#AAAA       AAA          －      YYYY/MM/DD     －          － \nDID#BBBB       BBB          －      YYYY/MM/DD     －          － \nDID#CCCC        －          －      YYYY/MM/DD     －     XXXXX の製品\n開発者 \nDID#DDDD        －      http://ddd  YYYY/MM/DD  YYYY/MM/\nDD（開示） \nYYYYY の製品\n開発者 \nDID#EEEE       EEE     http://eee  YYYY/MM/DD  YYYY/MM/\nDD（開示） \nZZZZZ の製品\n開発者 \n \n11\n 連絡不能開発者一覧  https://jvn.jp/reply/index.html \n\n付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n41 \n \n２  対象製品情報の公表と関係者へのお願い \n \n製品開発者名や製品開発者を特定できるような情報に加えて、具体的な対象\n製品の名称やバージョンを公表することで、製品開発者だけでなく、製品関係\n者からの連絡を求めていることを周知します。想定読者は、製品開発者本人、\nまたは製品開発者との連絡方法を知っている方です。 \n \n【対象が官庁、法人の場合】 \nXXXXX の製品開発者に関する情報  \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または販売代理店等、本製品に関係する方は下記の宛先までご連\n絡をお願いします。  \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日 \n \n【対象が官庁、法人の場合（連絡期限追記）】 \nXXXXX の製品開発者に関する情報  \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または販売代理店等、本製品に関係する方は下記の宛先までご連\n絡をお願いします。  \n本件に関するご連絡は、yyyy 年 mm 月 dd 日まで受け付けます。  \nなお、yyyy 年 mm 月 dd 日までにご連絡をいただけなかった場合は、製品開発\n者と連絡が取れないため連絡不能と判断し、「情報セキュリティ早期警戒パ\nートナーシップガイドライン」の「IV.ソフトウエア製品に係る脆弱性関連\n情報取扱」の記載に準じて取り扱います。 \n \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n更新日：yyyy 年 mm 月 dd 日（連絡期限追記）"
      },
      {
        "page_num": 41,
        "text": "付録５  ソフトウエア製品における連絡不能案件の取扱いについて \n \n42 \n \n【対象が個人、コミュニティの場合】   \nXXXXX の製品開発者に関する情報 \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または製品開発者との連絡方法をご存じの方は下記の宛先までご\n連絡をお願いします。また、同製品の派生・関連製品のコミュニティに所属\nする製品開発者の方で、修正版の提供が可能な方からのご連絡もお待ちして\nいます。 \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n \n【対象が個人、コミュニティの場合（連絡期限追記）】 \nXXXXX の製品開発者に関する情報 \n \n製品名ｘｘｘ、バージョン xxxx の作者、または著作権を有している製品開\n発者の方、または製品開発者との連絡方法をご存じの方は下記の宛先までご\n連絡をお願いします。また、同製品の派生・関連製品のコミュニティに所属\nする製品開発者の方で、修正版の提供が可能な方からのご連絡もお待ちして\nいます。  \n本件に関するご連絡は、yyyy 年 mm 月 dd 日まで受け付けます。 \n \nなお、yyyy 年 mm 月 dd 日までにご連絡をいただけなかった場合は、製品開発\n者と連絡が取れないため連絡不能と判断し、「情報セキュリティ早期警戒パ\nートナーシップガイドライン」の「IV.ソフトウエア製品に係る脆弱性関連\n情報取扱」の記載に準じて取り扱います。 \n \n連絡先： jvn@jvn.jp    \n公開日：yyyy 年 mm 月 dd 日  \n更新日：yyyy 年 mm 月 dd 日（連絡期限追記）"
      },
      {
        "page_num": 42,
        "text": "付録６  国際標準に準拠するための留意点 \n \n43 \n \n付録６  ソフトウエア製品の脆弱性の取扱いに関する国際標準への対応 \n \n1.  ソフトウエア製品の脆弱性の取扱いに関する国際標準とベンダ \nソフトウエア製品の脆弱性の取扱いに関する国際標準として、ISO/IEC \n29147:2014 (vulnerability disclosure)、ISO/IEC 30111:2013 \n(vulnerability handling processes)が規格化されました。 \n今後、我が国のベンダがグローバルな事業展開を図る場合には、これらの国\n際標準に対応する必要性が高まります。例えば、海外の調達案件等において、\n顧客側から脆弱性対応に関する取組みについて説明を要求された場合、ベンダ\nとして国際標準に対応した体制・取組みを行っていることを説明することで、\n円滑な理解が得られると考えられます。 \nまた、自身の脆弱性の公開ポリシーを公表することで、発見者の協力を得る\n効果も期待できます。 \n \n2.  国際標準の概要 \nISO/IEC 29147:2014 はソフトウエア製品に係る事業者（製品開発者、オンラ\nインサービス事業者（4.(1)を参照）、中間ベンダ（4.(4)を参照）等を指す。\n以下、「ベンダ」という。）の脆弱性に関する社外とのやりとり（外部からの脆\n弱性に関する情報の受領、ユーザに対する脆弱性対策のアドバイザリ配布等）\nを規定しています。一方、ISO/IEC 30111:2013 はベンダの社内での脆弱性取扱\nいのプロセス（脆弱性の検証、脆弱性対策の開発等）の指針を提供します。 \n  これらの関係を次の図に示します。 \n\n付録６  国際標準に準拠するための留意点 \n \n44"
      },
      {
        "page_num": 43,
        "text": "図 1  ISO/IEC 29147 と ISO/IEC 30111 の対応 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n3. 情報セキュリティ早期警戒パートナーシップと国際標準の関係 \nこれらの国際標準は、情報セキュリティ早期警戒パートナーシップの取組み\nと比較して、大きな矛盾や不整合はありません。したがって、情報セキュリテ\nィ早期警戒パートナーシップガイドライン（以下、「P ガイドライン」という）\nに沿って脆弱性を取り扱っているベンダが国際標準に対応することも可能で\nす。 \nただし、ISO/IEC 29147:2014 への対応については、細かいレベルで留意すべ\nき事項が指摘されています。そこで、本資料では、P ガイドラインに対応して\nいるベンダが ISO/IEC 29147:2014 にも対応しようとする場合に留意すべき事\n項について補足します。 \n\n付録６  国際標準に準拠するための留意点 \n \n45"
      },
      {
        "page_num": 44,
        "text": "4.ISO/IEC 29147:2014 について留意すべき事項 \nP ガイドラインに対応しているベンダが ISO/IEC 29147:2014 にも対応しよう\nとする場合に留意すべき事項についてまとめると、次のようになります。 \n留意すべき事項              ISO/IEC 29147 対応に取り組む場合の留意点 \n全体  グローバルな事業展開を図るベンダにおいては、脆弱性取扱いにつ\nいて国際標準に対応していることを顧客に説明する必要性が高まっ\nていることがヒアリング調査から裏付けられた。 \nオンラインサー\nビス \n 脆弱性対策を適用したことについて、文書化し記録として残す。 \n クラウド事業者の場合、顧客の利用環境への影響を考慮し、ソフト\nウエアの更新については事前に周知することが重要。 \n脆弱性公開ポリ\nシー \n 脆弱性公開ポリシーを策定し、その一部を公開する。 \n 脆弱性公開ポリシーには、ベンダへの連絡方法、セキュアな通信オ\nプション、予想されるやり取りの説明、脆弱性と思われる届出を行\nう際に役立つ可能性がある情報、範囲外のサービス、届出をどうや\nって追跡するかを含める。 \n 脆弱性公開ポリシーの一部を公開することにより、発見者から直接\n脆弱性が届け出られる可能性も高まる。 \n 届け出られた脆弱性が他のベンダの供給する部品に内包されている\nケースも考えられるため、そうした場合の対応についてもあらかじ\nめ検討しておく。 \n脆弱性の受領  脆弱性公開ポリシーに則り、発見者や調整機関から脆弱性の届出を\n受け付ける対外的な窓口を用意する。 \n その上で、脆弱性の届出を受信した際には、受信した旨を 7 日以内\nに返信する。 \n お盆、正月等の長期休暇の際は、7 日以内に対応するのが難しい可能\n性がある。 \n中間ベンダ  ベンダは、中間ベンダに求められる対応（脆弱性の問題の切り分け、\n他のベンダとの調整を行うこと、発見者・調整機関に調整状況と今\n後の進め方について説明すること）に取り組む。 \n 中間ベンダとして他のベンダの商材を扱う場合、それらに自社の脆\n弱性対応基準を適用するのは難しく、実際には対応を要請するに留\nまることが多い。 \n クラウド事業者によっては、パートナー向けに審査基準を公開し、\nそれに準拠するよう要請しているケースもある。 \n\n付録６  国際標準に準拠するための留意点 \n \n46"
      },
      {
        "page_num": 45,
        "text": "以下に、これらの詳細について説明します。 \n(1) オンラインサービス \nISO/IEC 29147:2014 における「オンラインサービス」についての記載を引用\nします。 \n章・節 内容 \n3 Terms and \ndefinitions  \n3 用語と定義 \n3.4 online services \nservice which is implemented by hardware, software, or a \ncombination of them and provided over a communication line or \nnetwork \nNote 1 to entry: The vendor of an online service may also be \nreferred to as a service provider. Online services are similar \nto products in that both are primarily software systems. Two \nmain distinctions are that a service often appears to users as \na single instance of software and that users do not install, \nmanage, or deploy the software, but they only use the service. \n3.4 オンラインサービス \nハードウエア、ソフトウエアまたはその組み合わせによって実装さ\nれ、通信回線またはネットワーク経由で提供されるサービス \n注記 1  オンラインサービスのベンダは、サービスプロバイダと呼ば\nれることもある。オンラインサービスと製品は、両者とも主にソフト\nウエアシステムであるという点で似ている。両者の主な違いは、サー\nビスはユーザにとって 1 つのソフトウエアのように見えるという点\nと、ユーザはソフトウエアのインストール、管理または展開を行わ\nず、サービスを利用するだけという点である。 \n5.5 \nVulnerability \ndisclosure \nprocess \nsummary \n5.5 脆弱性公\n開プロセスの\n要約 \n5.5.4 Release phase \nThe vendor deploys the remediation. In an online service, the \nvendor deploys the remediation and documents the event. \n5.5.4 公開フェーズ \nベンダは対策を展開する。オンラインサービスの場合、ベンダは対策\nを展開し、その事象について文書化して記録として残す\n12\n。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n表中 3.4 節の定義から、オンラインサービスの事業者には、クラウド事業\n者、EC モール事業者、ウェブサイト運営者等が含まれます。オンラインサービ\nスの場合、P ガイドライン上は対策の適用以上の取組みを求めていません\n13\n。し\nかし、オンラインサービス事業者が何らかの理由で ISO/IEC 29147:2014 対応\nに取り組む場合、脆弱性対策を適用したことについて、文書化し記録として残\n \n12\n 必ずしも「公表」を意味しているわけではない。 \n13\n 個人情報漏えい等の事案が起きた可能性がある場合は、二次被害を防止するため、公表\nを要請している。 \n\n付録６  国際標準に準拠するための留意点 \n \n47 \n \nすことが望まれます。さらにクラウド事業者の場合、顧客の利用環境への影響\nを考慮し、ソフトウエアの更新については事前に周知することが重要です。 \n \n(2) 脆弱性公開ポリシー \nISO/IEC 29147:2014 における「脆弱性公開ポリシー」についての記載を引用\nします。 \n章・節 内容 \n6 Vulnerability \ndisclosure \npolicy \nconsiderations \n6 脆弱性公開ポ\nリシーに関する\n考察 \n \n6.1 General \nVendors should define their responsibilities in the \nvulnerability disclosure policy. Vendors should publicize \ntheir vulnerability disclosure policy or point to an existing \npublic vulnerability disclosure policy.  \n6.1 概要 \nベンダは、脆弱性公開ポリシーにおける責任を定義する必要があ\nる。ベンダは、自身の脆弱性公開ポリシーを公表する、もしくは、\n既存の一般的な脆弱性公開ポリシーを示す必要がある。 \n6.2 Minimum policy aspects  \nA vendor should create an overall vulnerability disclosure \npolicy, but they may choose to publicize only select sections \nif the internal policy contains sensitive information. A \nvulnerability disclosure policy should, at least, include \ninformation about the following. \na) How the vendor would like to be contacted \nVendors who adopt a policy of vulnerability disclosure will \ntypically offer a security website or page. This website/page \nprovides information on the vendor’s accepted method(s) for \nreceiving vulnerability information from a finder. \nContact information might include one or more of the \nfollowing: \n1) E-mail address;(例示は省略) \n2) Phone number; \n3) Web form. \n(以下タイトルのみ抜粋) \nb) Secure communication options \nc) Setting communication expectations \nd) Information that would be useful when submitting a \npossible vulnerability report \ne) Out-of-scope services \nf) How submitted reports are tracked \n\n付録６  国際標準に準拠するための留意点 \n \n48 \n \n6.2 最小限の要素 \nベンダは脆弱性公開ポリシーを策定するが、ポリシーが機微な情報\nを含むこともあるため、公開するのはその一部だけとしてもよい。\n脆弱性公開ポリシーは、少なくとも以下の情報を含める： \na）どのようにベンダに連絡して欲しいか \n脆弱性公開ポリシーを採用するベンダは、一般的にセキュリティの\nウェブサイトやページを提供する。このウェブサイト/ページは発見\n者から脆弱性情報を受信するためにベンダが認めた方法（複数可）\nに関する情報を提供する。問合せ先は、次の一項目以上含めること\nが望ましい： \n  1) 電子メールアドレス \n  2) 電話番号 \n  3) ウェブフォーム \nb）セキュアな通信オプション \nc）予想されるやり取りの説明 \nd）脆弱性と思われる届出を行う際に役立つ可能性がある情報 \ne）範囲外のサービス \nf）届出をどうやって追跡するか \n6.3 Optional policy aspects \nA vulnerability disclosure policy may contain multiple \noptional elements. \na) Credit to finder \nb) Synchronized public disclosure \nc) Distribution \n6.3 オプショナルなポリシーの要素 \n脆弱性公開ポリシーには、複数のオプション情報を含めてもよい。 \n  a）発見者の功績 \n  b）一般公開の同期 \n  c）配布 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \nP ガイドラインでは、ベンダに脆弱性公開ポリシーの策定を求めていません\nが、ISO/IEC 29147:2014 では、脆弱性公開ポリシーを策定することや、その一\n部を公開することを求めています。 \nしたがって、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む\n場合、 \n・脆弱性公開ポリシーを策定し、その一部\n14\nを公開すること \n・脆弱性公開ポリシーには、ベンダへの連絡方法、セキュアな通信オプショ\nン、予想されるやり取りの説明、脆弱性と思われる届出を行う際に役立つ\n可能性がある情報、範囲外のサービス、届出をどうやって追跡するかを含\n \n14\n どこまで公開すべきか判断が難しい可能性もあるため、先行事例を巻末に添付する。 \n\n付録６  国際標準に準拠するための留意点 \n \n49 \n \nめること \nが望まれます。中でもベンダへの連絡方法は公開する必要があるでしょう。ま\nた、脆弱性公開ポリシーの一部を公開することにより、発見者から直接脆弱性\nが届け出られる可能性も高まります。 \nさらに、届け出られた脆弱性が他のベンダの供給する部品に内包されている\nケースも考えられるため、そうした場合の対応についてもあらかじめ検討して\nおくべきでしょう。 \n \n(3) 脆弱性の受領 \nISO/IEC 29147:2014 における「脆弱性の受領」についての記載を引用しま\nす。 \n章・節 内容 \n7 Receipt of \nvulnerability \ninformation \n7 脆弱性情報\nの受領 \n \n7.3 Acknowledgement of receipt from finder or a coordinator  \nThe vendor should respond to a vulnerability report within the \ntime period specified in the vendor’s vulnerability \ndisclosure policy. It is recommended that an acknowledgement \nof receipt of a vulnerability report be provided to a finder \nwithin seven calendar days.  \n7.3 発見者や調整機関からの受領の確認 \nベンダは、自身の脆弱性公開ポリシーの中で規定した期間以内に、脆\n弱性の届出に対処する。脆弱性届出を受領した旨の連絡は、発見者に\n対し暦で 7 日以内に行うことが推奨される。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \nISO/IEC 29147:2014 の「受領」は、その内容には言及せず、単に受信した旨\nを返信する作業を指しています。例えば、IPA では、受信した旨を発見者に返\n信する「受信連絡」という作業がありますが、これが該当します。このような\n作業はできるだけ迅速に行うことが望まれます。 \nしたがって、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む\n場合、まず、脆弱性公開ポリシーに則り、発見者や調整機関から脆弱性の届出\nを受け付ける対外的な窓口を用意すること、その上で、脆弱性の届出を受信し\nた際には、受信した旨を 7 日以内に返信することが必要となります。 \nなお、お盆、正月等の長期休暇の際は、対応が難しい可能性があるので、留\n意が必要です。 \n \n(4) 中間ベンダ \nISO/IEC 29147:2014 における「中間ベンダ」についての記載を引用します。 \n章・節 内容 \n\n付録６  国際標準に準拠するための留意点 \n \n50 \n \n5.4 \nStakeholders \n5.4 利害関係\n者  \n5.4.3 Intermediate Vendor \nAn intermediate vendor gets a subsystem from a vendor and uses \nit to supply a system or service (or a combination of both) to \na user (or another intermediate vendor). Typical examples are \nthe following: \na) system houses that use a PC and an operating system to add \ntheir own healthcare administration software and sell the \ncombined system to a medical doctor (maybe together with a \nmaintenance contract); \nb) telecommunication providers that supply a mobile phone \ntogether with a service contract.  \n5.4.3 中間ベンダ \n中間ベンダは、ベンダからサブシステムを入手し、それを使ってシス\nテムまたはサービス（または両方の組み合わせ）をユーザ（または他\nの中間ベンダ）に提供する。典型的な例では次のようなものがある： \n1）PC や OS と自社のヘルスケア管理ソフトウエアを合わせ、統合した\nシステムを医師に販売する（保守契約も一緒に提供することも）シス\nテムハウス; \n2）携帯電話本体とサービス契約を合わせて提供する通信事業者。 \n7 Receipt of \nvulnerability \ninformation \n7 脆弱性情報\nの受領 \n7.5 On-going communication with finder \nVendors should evaluate the reported issue and make a \ndetermination whether it represents a vulnerability or not. \nThe vendor should inform the finder and coordinator, if \ninvolved, on the results. \nAn intermediate vendor should check whether it can decide on \nthe potential vulnerability on its own or needs to involve the \nvendor it got the related subsystem from. If another vendor \nneeds to be involved in the decision and if this delays the \nresponse, the intermediate vendor should inform the finder \nand/or the coordinator about this fact and about the further \nprocessing. \n7.5  発見者との進行中のやり取り \nベンダは届出を受けた問題を評価し、脆弱性かそうでないかを判断し\nなければならない。ベンダは、結果について発見者に（もし調整機関\nが関与していれば調整機関にも）知らせる。 \n中間ベンダは、潜在的な脆弱性に関して自身で判断できるか、関連す\nるサブシステムを購入したベンダを巻き込む必要があるか、確認しな\nければならない。他のベンダの関与を必要とし、そのために回答が遅\nれる場合、中間ベンダは発見者および／または調整機関にその事実と\n今後の進め方について知らせる。 \n（出所：ISO/IEC 29147:2014 を元に作成） \n \n中間ベンダとは、ユーザと対策を策定するベンダの間に介在するベンダであ\nり、SIer やリセラーが該当する場合も、組み込みベンダが該当する場合もあり\nます。例えば、自社が提供するプラットフォーム上で別のパートナーがサービ\nスを行っているケースも該当すると考えられます。大半のベンダに中間ベンダ\nとなる可能性があるため、中間ベンダへの要請は、実質的にはベンダ全体への\n\n付録６  国際標準に準拠するための留意点 \n \n51 \n \n要請と考えることができます。ユーザや発見者から見えるのは中間ベンダなの\nで、それらが対応すべき取組みを明確にすることは有益といえます。 \nP ガイドラインでは、「中間ベンダ」を定義しておらず、中間ベンダに求めら\nれる対応についても明示していません。 \nしかし、ベンダが何らかの理由で ISO/IEC 29147:2014 対応に取り組む場合\nには、ベンダは、中間ベンダに求められる対応（脆弱性の問題の切り分け、他\nのベンダとの調整を行うこと、発見者・調整機関に調整状況と今後の進め方に\nついて説明すること）に取り組むことが望まれます。 \nただし、中間ベンダとして他のベンダの商材を扱う場合、それらに自社の脆\n弱性対応基準を適用するのは難しく、実際には対応を要請するに留まることが\n多いと考えられます。それでも、クラウド事業者によっては、パートナー向け\nに審査基準を公開し、それに準拠するよう要請しているケースもあります。"
      },
      {
        "page_num": 46,
        "text": "付録６  国際標準に準拠するための留意点 \n \n52 \n \n参考 1 ISO/IEC 29147:2014 と情報セキュリティ早期警戒パートナーシップガ\nイドラインの対応 \nISO/IEC 29147:2014 の構成 \n情報セキュリティ早期警戒パートナーシッ\nプガイドラインの対応箇所 \n1.適用範囲 III. 本ガイドラインの適用の範囲 \n2.引用規格 － \n3.用語および定義 II. 用語の定義と前提 \n4.略語 － \n5.概念 \n5.1  一般 \n5.2  ISO/IEC 29147: 脆弱性の公開と\nISO/IEC 30111: 脆弱性取扱プロセスの間\nのインタフェース \n5.3  製品とオンラインサービス \n5.4  ステークホルダー \n5.5  脆弱性公開プロセスの概要 \n5.6  脆弱性公開時における情報交換 \n5.7  交換情報の機密性 \n5.8  脆弱性アドバイザリ \n5.9  脆弱性の悪用 \nI. はじめに \n○本ガイドラインの目的 \n○ 本ガイドラインの想定する読者 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n1. 概要 \n6.脆弱性公開ポリシーにおける考慮事項 \n6.1 全般 \n6.2 最小限のポリシーの要素 \n6.3 オプショナルなポリシーの要素 \n－ \n7.脆弱性情報の受理 \n7.1 全般 \n7.2 潜在的な脆弱性報告およびその安全な\n受信モデル \n7.3 発見者または調整機関からの受理確認 \n7.4 入ってくる報告の追跡 \n7.5 発見者との進行中の通信 \n7.6 詳細情報 \n7.7 調整機関からの支援 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n5. 製品開発者の対応 \n1) 窓口の設置 \n2) 脆弱性検証の実施 \n3) 脆弱性情報の公表日の調整 \n4) 発見者との直接の情報交換 \n5) 関連ウェブサイトに関する情報の取扱\nい \n6) 問い合わせへの対応 \n7) 対策方法および対応状況の連絡"
      },
      {
        "page_num": 47,
        "text": "付録６  国際標準に準拠するための留意点 \n \n53 \n \n8.ベンダ間における脆弱性の報告 \n8.1 全般 \n8.2 ベンダ間の脆弱性報告を求める典型的\nなケース \n8.3 他ベンダに対する脆弱性情報の報告 \n－ \n9.アドバイザリの配布 \n9.1 全般 \n9.2 アドバイザリの目的 \n9.3 アドバイザリの公開における配慮 \n9.4 アドバイザリのリリースのタイミング \n9.5 アドバイザリの内容 \n9.6 アドバイザリの通信 \n9.7 アドバイザリのフォーマット \n9.8 アドバイザリの真正性 \nIV. ソフトウエア製品に係る脆弱性関連情\n報取扱 \n5. 製品開発者の対応 \n 8)対策方法の周知 \n 9)製品開発者内の情報の管理と開示 \n付録 A.（補足情報）脆弱性／アドバイザ\nリ情報の取扱いに関する詳細 \n付録 B.（補足情報）ポリシー、アドバイ\nザリ、国際的な調整機関の事例 \n文献目録 \n－"
      },
      {
        "page_num": 48,
        "text": "付録６  国際標準に準拠するための留意点 \n \n54 \n \n参考 2 脆弱性公開ポリシーの事例 \n脆弱性公開ポリシーは、ISO/IEC 29147:2014 の Annex B の”B.1 Sample \nvulnerability disclosure policy”に例示されているが、既に国内外のベン\nダから開示されている事例も見られる。以下にそれらの参考例を示す。 \n \n■Cisco; “Security Vulnerability Policy” \nhttps://tools.cisco.com/security/center/resources/security_vulnerabili\nty_policy.html \n \n■IBM; “Report Security Vulnerabilities” \nhttps://www.ibm.com/security/secure-engineering/report.html \n \n■Microsoft; “Coordinated Vulnerability Disclosure” \nhttps://www.microsoft.com/en-us/msrc/cvd \n \n■Salesforce.com; \n「セールスフォース・ドットコムの脆弱性報告ポリシー」 \nhttps://www.salesforce.com/jp/company/disclosure/ \n「Force.com ISV セキュリティレビュー」 \nhttps://developer.salesforce.com/page/JP:Security_Review \n \n■サイボウズ; 「脆弱性情報ハンドリングポリシー」 \nhttps://cybozu.co.jp/company/security-policy/ \n \n■日立製作所; 「日立グループにおける製品脆弱性情報の開示プロセス」 \nhttp://www.hitachi.co.jp/hirt/publications/hirt-pub10008/index.html \n \n■GMO ペパボ; 「脆弱性報告制度」 \nhttp://pepabo.com/contact/vulnerability_reporting/"
      },
      {
        "page_num": 49,
        "text": "付録７  本ガイドラインの別冊・関連資料一覧 \n \n55 \n \n付録７  本ガイドラインの別冊・関連資料一覧 \n【別冊】 \n「ソフトウエア製品開発者による脆弱性対策情報の公表マニュアル」\n15\n  \n利用者に脆弱性関連情報が的確に届けられることを目標として、ソフトウエ\nア製品開発者向けに、脆弱性対策情報の望ましい公表の手順について方針を\n示す資料です。 \n \n「ウェブサイト運営者のための脆弱性対応ガイド」\n15\n \nウェブサイト運営者向けに、ウェブサイトの脆弱性対策の必要性や脆弱性対\n応の手順を紹介する資料です。 \n \n「ウェブサイト構築事業者のための脆弱性対応ガイド」 \n15\n \nウェブサイトの構築に係る方向けに、納入前と納入後に分けてウェブサイト\nの脆弱性対策のポイントを紹介する資料です。 \n \n「セキュリティ担当者のための脆弱性対応ガイド」\n15\n \n企業等において情報システムのセキュリティ管理を担当する方向けに、脆弱\n性対策の基本的な考え方を紹介する資料です。 \n \n「制御システム利用者のための脆弱性対応ガイド」第３版\n15\n \n工場やプラントにおける制御システムの導入・運用を行う企業の経営層・管\n理者の方向けに、セキュリティ対策や脆弱性対応を紹介する資料です。 \n \n【関連資料】 \n「平成二十九年経済産業省告示第十九号 ソフトウエア製品等の脆弱性関連情\n報に関する取扱規程」\n16\n \n旧告示「ソフトウエア等脆弱性関連情報取扱基準」が廃止となり、新たに定\nめられた告示です。 \n \n「情報セキュリティ早期警戒パートナーシップの紹介 \n- 脆弱性取扱プロセスの要点解説 -」\n15\n \n情報セキュリティ早期警戒パートナーシップガイドラインの概要版として\n作成した資料です。 \n \n15\n https://www.ipa.go.jp/security/vuln/index.html \n16\n https://www.meti.go.jp/policy/netsecurity/vul_notification.pdf \n\n付録７  本ガイドラインの別冊・関連資料一覧 \n \n56"
      },
      {
        "page_num": 50,
        "text": "「Information Security Early Warning Partnership  \n- Overview of Vulnerability Handling Process -」\n15\n \n情報セキュリティ早期警戒パートナーシップガイドラインの概要版を英訳\nした資料です。 \n \n「JPCERT/CC 脆弱性関連情報取扱いガイドライン」\n17\n \n経済産業省告示「ソフトウエア製品等の脆弱性関連情報に関する取扱規程」\nおよび IPA  と JPCERT/CC による「情報セキュリティ早期警戒パートナーシ\nップガイドライン」に対応して、製品開発者の方々に、脆弱性関連情報の取\n扱いに関する事項をお知らせすることを目的として作成された資料です。 \n \n「製品開発ベンダーにおける脆弱性関連情報取扱に関する体制と手順整備のた\nめのガイドライン」\n18\n \nシステムベンダを中心とする製品開発者が、発見者や調整機関から入手した\n脆弱性関連情報を社内的にどのように取り扱い、対応すべきか、必要な体制\nと手順を整備するために、JEITA および JISA がとりまとめた資料です。 \n \n「SI 事業者における脆弱性関連情報取扱に関する体制と手順整備のためのガイ\nダンス」\n19\n \nSI 事業者が、脆弱性情報が公表された後、製品開発ベンダや顧客と連携し、\n迅速かつ適切な対応をとるために必要な社内体制や対応手順を整備するた\nめに、JISA および JEITA がとりまとめた資料です。 \n \n「製品開発ベンダーにおける脆弱性関連情報取扱に関する体制と手順整備のた\nめのガイドライン」\n20\n \nPC ソフトウエアを中心とする製品開発者が、発見者や調整機関から入手し\nた脆弱性関連情報を社内的にどのように取り扱い、対応すべきか、必要な体 \n制と手順を整備するために、JPSA（現 SAJ）がとりまとめた資料です。 \n \n17\n https://www.jpcert.or.jp/vh/vul-guideline2014.pdf \n18\n http://it.jeita.or.jp/infosys/info/0407JEITA-guideline/guideline-v10.pdf \n19\n https://www.ipa.go.jp/files/000002992.pdf \n20\n https://www.saj.or.jp/activity/advocacy/20041203_security.pdf"
      },
      {
        "page_num": 51,
        "text": "57 \n \n・脆弱性関連情報流通の基本枠組み \n  独立行政法人情報処理推進機構（IPA）では、経済産業省告示を踏まえ、2004年7月からソフトウエア製品\nおよびウェブアプリケーションの脆弱性に関する届出を受け付けています。 \n  https://www.ipa.go.jp/security/vuln/report/index.html \n（参考） \n「ソフトウエア製品等の脆弱性関連情報に関する取扱規程」（平成29年経済産業省告示第19号） \n「受付機関及び調整機関を定める告示」（平成31年経済産業省告示第19号） \n「情報セキュリティ早期警戒パートナーシップ」 \n \n・本資料のダウンロード先 \n  本資料の配布に制限はありません。本資料は、次のURLからダウンロードできます。 \n   https://www.ipa.go.jp/security/ciadr/partnership_guide.html \n   https://www.jpcert.or.jp/vh/#link_japan \n・本資料に関するお問合わせ先 \n  独立行政法人情報処理推進機構（略称：IPA）  セキュリティセンター \n   〒113-6591  東京都文京区本駒込二丁目28番8号 文京グリーンコートセンターオフィス16階 \n   https://www.ipa.go.jp/security/ TEL: 03-5978-7527  FAX: 03-5978-7552 \n  一般社団法人JPCERTコーディネーションセンター（略称：JPCERT/CC） \n   〒103-0023  東京都中央区日本橋本町4-4-2  東山ビルディング8階 \n   https://www.jpcert.or.jp/  TEL: 03-6271-8901  FAX 03-6271-8908 \n情報セキュリティ早期警戒パートナーシップガイドライン \n２００４ 年 ７ 月 ８ 日 制定第１版発行    ２０１４ 年 ５ 月３０日 改訂第８版発行 \n２００５ 年 ７ 月 ８ 日 改訂第２版発行    ２０１５ 年 ５ 月２２日 改訂第９版発行 \n２００６ 年 ９ 月 １ 日 改訂第３版発行    ２０１６ 年 ５ 月３０日 改訂第１０版発行 \n２００７ 年 ６ 月１１日 改訂第４版発行    ２０１７ 年 ５ 月３０日 改訂第１１版発行 \n２００８ 年 ４ 月 ４ 日 改訂第５版発行    ２０１９ 年 ５ 月３０日 改訂第１２版発行 \n２００９ 年 ７ 月 ８ 日 改訂第６版発行    ２０２２ 年 ５ 月３１日 改訂第１２版第２刷発行 \n２０１１ 年 ３ 月２８日 改訂第７版発行       \n       \n [著作・制作]    情報システム等の脆弱性情報の取扱いに関する研究会 \n[事務局・発行]  独立行政法人情報処理推進機構"
      }
    ]
  }
}